{
  "About Rucheng Technology - Leading CNC Sheet Metal Manufacturer": "关于如程科技 - 领先的数控钣金设备制造商",
  "Admin": "管理员",
  "February 11, 2022": "2022年2月11日",
  "Leave a Comment": "发表评论",
  "About Rucheng Technology": "关于如程科技",
  "Rucheng Technology is a professional manufacturer specializing in CNC Press Brake, CNC Shearing Machine, Metal Cutting Machines, and Sheet Metal Processing Equipment.": "如程科技是一家专业制造商，专注于数控折弯机、数控剪板机、金属切割机和钣金加工设备。",
  "Our products are widely used in industries such as automotive manufacturing, telecommunications, and computer hardware.": "我们的产品广泛应用于汽车制造、电信和计算机硬件等行业。",
  "Advanced Production Capabilities": "先进的生产能力",
  "We possess advanced production lines and first-class testing equipment, adhering to international quality management systems to meet global standards.": "我们拥有先进的生产线和一流的测试设备，遵循国际质量管理体系以满足全球标准。",
  "Strong R&D and Innovation": "强大的研发与创新",
  "Innovation is at the core of our business. We have a dedicated R&D team that continuously develops and upgrades our CNC Press Brake, CNC Shearing Machine, and Metal Cutting Machines. Our engineers work closely with production teams to turn new ideas into reliable technologies.": "创新是我们业务的核心。我们拥有一支专门的研发团队，不断开发和升级我们的数控折弯机、数控剪板机和金属切割机。我们的工程师与生产团队密切合作，将新想法转化为可靠的技术。",
  "Commitment to Excellence": "追求卓越的承诺",
  "Our mission is to build a first-class brand in the field of CNC sheet metal machinery. We aim to become a globally recognized leader by maintaining focus on technology leadership, process control, and customer service.": "我们的使命是在数控钣金机械领域打造一流品牌。我们的目标是通过保持技术领先、工艺控制和客户服务的专注，成为全球公认的领导者。",
  "Why Choose Rucheng?": "为什么选择如程？",
  "Over 20 years of experience in CNC press brake manufacturing": "在数控折弯机制造方面拥有超过20年的经验",
  "Wide product range: from Mechanical Equipment to Robotic Solutions": "广泛的产品系列：从机械设备到机器人解决方案",
  "Exported to over 50 countries worldwide": "出口到全球50多个国家",
  "Custom solutions for your unique metal forming needs": "为您独特的金属成型需求提供定制解决方案",
  "Manufacturing & Technology": "制造与技术",
  "← Back to Blog": "← 返回博客"
}
