{
  "About Rucheng Technology - Leading CNC Sheet Metal Manufacturer": "حول Rucheng Technology - الشركة الرائدة في تصنيع الصفائح المعدنية باستخدام الحاسب الآلي",
  "Admin": "مسؤل",
  "February 11, 2022": "11 فبراير 2022",
  "Leave a Comment": "ترك تعليق",
  "About Rucheng Technology": "حول تكنولوجيا Rucheng",
  "Rucheng Technology is a professional manufacturer specializing in CNC Press Brake, CNC Shearing Machine, Metal Cutting Machines, and Sheet Metal Processing Equipment.": "Rucheng Technology هي شركة مصنعة محترفة متخصصة في مكابس الضغط CNC، وآلة القص CNC، وآلات القطع المعدنية، ومعدات معالجة الصفائح المعدنية.",
  "Our products are widely used in industries such as automotive manufacturing, telecommunications, and computer hardware.": "يتم استخدام منتجاتنا على نطاق واسع في صناعات مثل تصنيع السيارات والاتصالات وأجهزة الكمبيوتر.",
  "Advanced Production Capabilities": "قدرات الإنتاج المتقدمة",
  "We possess advanced production lines and first-class testing equipment, adhering to international quality management systems to meet global standards.": "نحن نمتلك خطوط إنتاج متقدمة ومعدات اختبار من الدرجة الأولى، ونلتزم بأنظمة إدارة الجودة الدولية لتلبية المعايير العالمية.",
  "Strong R&D and Innovation": "البحث والتطوير والابتكار القوي",
  "Innovation is at the core of our business. We have a dedicated R&D team that continuously develops and upgrades our CNC Press Brake, CNC Shearing Machine, and Metal Cutting Machines. Our engineers work closely with production teams to turn new ideas into reliable technologies.": "الابتكار هو جوهر عملنا. ",
  "Commitment to Excellence": "الالتزام بالتميز",
  "Our mission is to build a first-class brand in the field of CNC sheet metal machinery. We aim to become a globally recognized leader by maintaining focus on technology leadership, process control, and customer service.": "مهمتنا هي بناء علامة تجارية من الدرجة الأولى في مجال آلات الصفائح المعدنية CNC. ",
  "Why Choose Rucheng?": "لماذا تختار روتشينج؟",
  "Over 20 years of experience in CNC press brake manufacturing": "أكثر من 20 عامًا من الخبرة في تصنيع مكابح الضغط CNC",
  "Wide product range: from Mechanical Blade to Robotic Equipment": "مجموعة واسعة من المنتجات: من الشفرات الميكانيكية إلى المعدات الآلية",
  "Exported to over 50 countries worldwide": "يتم تصديرها إلى أكثر من 50 دولة حول العالم",
  "Custom solutions for your unique metal forming needs": "حلول مخصصة لاحتياجاتك الفريدة في مجال تشكيل المعادن",
  "Uncategorized": "غير مصنف",
  "Next Post—": "المقالة التالية—",
  "How to maintain the laser cutting machine?": "كيفية صيانة آلة القطع بالليزر؟",
  "← Back to Blog": "← العودة إلى المدونة"
}