{
  "About Rucheng Technology - Leading CNC Sheet Metal Manufacturer": "Acerca de Rucheng Technology: fabricante líder de chapa metálica CNC",
  "Admin": "Administración",
  "February 11, 2022": "11 de febrero de 2022",
  "Leave a Comment": "Deja un comentario",
  "About Rucheng Technology": "Acerca de la tecnología Rucheng",
  "Rucheng Technology is a professional manufacturer specializing in CNC Press Brake, CNC Shearing Machine, Metal Cutting Machines, and Sheet Metal Processing Equipment.": "Rucheng Technology es un fabricante profesional que se especializa en plegadoras CNC, máquinas cizallas CNC, máquinas cortadoras de metales y equipos de procesamiento de chapa metálica.",
  "Our products are widely used in industries such as automotive manufacturing, telecommunications, and computer hardware.": "Nuestros productos se utilizan ampliamente en industrias como la fabricación de automóviles, telecomunicaciones y hardware informático.",
  "Advanced Production Capabilities": "Capacidades de producción avanzadas",
  "We possess advanced production lines and first-class testing equipment, adhering to international quality management systems to meet global standards.": "Contamos con líneas de producción avanzadas y equipos de prueba de primera clase, adhiriéndose a sistemas internacionales de gestión de calidad para cumplir con los estándares globales.",
  "Strong R&D and Innovation": "Fuerte I+D e innovación",
  "Innovation is at the core of our business. We have a dedicated R&D team that continuously develops and upgrades our CNC Press Brake, CNC Shearing Machine, and Metal Cutting Machines. Our engineers work closely with production teams to turn new ideas into reliable technologies.": "La innovación es el núcleo de nuestro negocio. ",
  "Commitment to Excellence": "Compromiso con la excelencia",
  "Our mission is to build a first-class brand in the field of CNC sheet metal machinery. We aim to become a globally recognized leader by maintaining focus on technology leadership, process control, and customer service.": "Nuestra misión es construir una marca de primera clase en el campo de la maquinaria de chapa CNC. ",
  "Why Choose Rucheng?": "¿Por qué elegir Rucheng?",
  "Over 20 years of experience in CNC press brake manufacturing": "Más de 20 años de experiencia en la fabricación de plegadoras CNC.",
  "Wide product range: from Mechanical Blade to Robotic Equipment": "Amplia gama de productos: desde cuchillas mecánicas hasta equipos robóticos",
  "Exported to over 50 countries worldwide": "Exportado a más de 50 países en todo el mundo.",
  "Custom solutions for your unique metal forming needs": "Soluciones personalizadas para sus necesidades únicas de conformado de metales",
  "Uncategorized": "Sin categoría",
  "Next Post—": "Siguiente publicación—",
  "How to maintain the laser cutting machine?": "¿Cómo mantener la máquina de corte por láser?",
  "← Back to Blog": "← Volver al Blog"
}