{
  "About Rucheng Technology - Leading CNC Sheet Metal Manufacturer": "Rucheng Technology について - 大手 CNC 板金メーカー",
  "Admin": "管理者",
  "February 11, 2022": "2022 年 2 月 11 日",
  "Leave a Comment": "コメントを残す",
  "About Rucheng Technology": "Rucheng Technologyについて",
  "Rucheng Technology is a professional manufacturer specializing in CNC Press Brake, CNC Shearing Machine, Metal Cutting Machines, and Sheet Metal Processing Equipment.": "Rucheng Technology は、CNC プレス ブレーキ、CNC シャーリング マシン、金属切断機、板金加工装置を専門とする専門メーカーです。",
  "Our products are widely used in industries such as automotive manufacturing, telecommunications, and computer hardware.": "当社の製品は、自動車製造、電気通信、コンピュータハードウェアなどの業界で広く使用されています。",
  "Advanced Production Capabilities": "高度な生産能力",
  "We possess advanced production lines and first-class testing equipment, adhering to international quality management systems to meet global standards.": "当社は先進的な生産ラインと一流の試験設備を備え、世界基準を満たす国際的な品質管理システムを遵守しています。",
  "Strong R&D and Innovation": "強力な研究開発とイノベーション",
  "Innovation is at the core of our business. We have a dedicated R&D team that continuously develops and upgrades our CNC Press Brake, CNC Shearing Machine, and Metal Cutting Machines. Our engineers work closely with production teams to turn new ideas into reliable technologies.": "イノベーションは当社のビジネスの中核です。",
  "Commitment to Excellence": "卓越性へのこだわり",
  "Our mission is to build a first-class brand in the field of CNC sheet metal machinery. We aim to become a globally recognized leader by maintaining focus on technology leadership, process control, and customer service.": "私たちの使命は、CNC板金機械の分野で一流のブランドを構築することです。",
  "Why Choose Rucheng?": "なぜ如城を選ぶのか？",
  "Over 20 years of experience in CNC press brake manufacturing": "CNCプレスブレーキ製造における20年以上の経験",
  "Wide product range: from Mechanical Blade to Robotic Equipment": "機械ブレードからロボット機器まで幅広い製品範囲",
  "Exported to over 50 countries worldwide": "世界50カ国以上に輸出",
  "Custom solutions for your unique metal forming needs": "お客様独自の金属成形ニーズに対応するカスタム ソリューション",
  "Uncategorized": "未分類",
  "Next Post—": "次の投稿—",
  "How to maintain the laser cutting machine?": "レーザー切断機のメンテナンスはどうすればよいですか?",
  "← Back to Blog": "← ブログに戻る"
}