{
  "About Rucheng Technology - Leading CNC Sheet Metal Manufacturer": "Über Rucheng Technology – führender CNC-Blechhersteller",
  "Admin": "Admin",
  "February 11, 2022": "11. Februar 2022",
  "Leave a Comment": "Hinterlassen Sie einen Kommentar",
  "About Rucheng Technology": "Über Rucheng Technology",
  "Rucheng Technology is a professional manufacturer specializing in CNC Press Brake, CNC Shearing Machine, Metal Cutting Machines, and Sheet Metal Processing Equipment.": "Rucheng Technology ist ein professioneller Hersteller, der sich auf CNC-Abkantpressen, CNC-Schermaschinen, Metallschneidemaschinen und Blechbearbeitungsgeräte spezialisiert hat.",
  "Our products are widely used in industries such as automotive manufacturing, telecommunications, and computer hardware.": "Unsere Produkte werden häufig in Branchen wie der Automobilherstellung, der Telekommunikation und der Computerhardware eingesetzt.",
  "Advanced Production Capabilities": "Erweiterte Produktionsmöglichkeiten",
  "We possess advanced production lines and first-class testing equipment, adhering to international quality management systems to meet global standards.": "Wir verfügen über fortschrittliche Produktionslinien und erstklassige Prüfgeräte und halten uns an internationale Qualitätsmanagementsysteme, um globale Standards zu erfüllen.",
  "Strong R&D and Innovation": "Starke Forschung, Entwicklung und Innovation",
  "Innovation is at the core of our business. We have a dedicated R&D team that continuously develops and upgrades our CNC Press Brake, CNC Shearing Machine, and Metal Cutting Machines. Our engineers work closely with production teams to turn new ideas into reliable technologies.": "Innovation ist der Kern unseres Geschäfts. ",
  "Commitment to Excellence": "Verpflichtung zur Exzellenz",
  "Our mission is to build a first-class brand in the field of CNC sheet metal machinery. We aim to become a globally recognized leader by maintaining focus on technology leadership, process control, and customer service.": "Unsere Mission ist es, eine erstklassige Marke im Bereich CNC-Blechmaschinen aufzubauen. ",
  "Why Choose Rucheng?": "Warum Rucheng wählen?",
  "Over 20 years of experience in CNC press brake manufacturing": "Über 20 Jahre Erfahrung in der Herstellung von CNC-Abkantpressen",
  "Wide product range: from Mechanical Blade to Robotic Equipment": "Große Produktpalette: von der mechanischen Klinge bis zur Roboterausrüstung",
  "Exported to over 50 countries worldwide": "Exportiert in über 50 Länder weltweit",
  "Custom solutions for your unique metal forming needs": "Maßgeschneiderte Lösungen für Ihre individuellen Anforderungen an die Metallumformung",
  "Uncategorized": "Nicht kategorisiert",
  "Next Post—": "Nächster Beitrag—",
  "How to maintain the laser cutting machine?": "Wie wird die Laserschneidmaschine gewartet?",
  "← Back to Blog": "← Zurück zum Blog"
}