{
  "Maintenance and Maintenance of Shears": "Mantenimiento y Mantenimiento de Cizallas",
  "Admin": "Administración",
  "March 14, 2022": "14 de marzo de 2022",
  "Leave a Comment": "Deja un comentario",
  "Proper maintenance of shearing machines is essential for ensuring optimal performance, extending equipment lifespan, and maintaining workplace safety. Whether you operate hydraulic guillotine shears, swing beam shears, or CNC shearing machines, following a comprehensive maintenance program will minimize downtime and maximize productivity.": "El mantenimiento adecuado de las cizallas es esencial para garantizar un rendimiento óptimo, prolongar la vida útil del equipo y mantener la seguridad en el lugar de trabajo. ",
  "Why Regular Maintenance Matters": "Por qué es importante el mantenimiento regular",
  "Shearing machines operate under high loads and precision requirements. Without proper maintenance, several issues can arise:": "Las cizallas funcionan bajo cargas elevadas y requisitos de precisión. ",
  "Blade Wear: Dull or damaged blades produce poor cut quality and require excessive force.": "Desgaste de la cuchilla: Las cuchillas desafiladas o dañadas producen cortes de mala calidad y requieren fuerza excesiva.",
  "Hydraulic Problems: Contaminated oil or worn seals lead to pressure loss and erratic operation.": "Problemas hidráulicos: el aceite contaminado o los sellos desgastados provocan una pérdida de presión y un funcionamiento errático.",
  "Accuracy Loss: Worn components affect cutting precision and perpendicularity.": "Pérdida de precisión: los componentes desgastados afectan la precisión y la perpendicularidad del corte.",
  "Safety Risks: Neglected maintenance can compromise safety systems and create hazards.": "Riesgos de seguridad: el mantenimiento descuidado puede comprometer los sistemas de seguridad y crear peligros.",
  "Daily Maintenance Tasks": "Tareas de mantenimiento diario",
  "Operators should perform these checks at the beginning of each shift:": "Los operadores deben realizar estas comprobaciones al inicio de cada turno:",
  "Visually inspect the machine for obvious damage, leaks, or loose components": "Inspeccione visualmente la máquina en busca de daños obvios, fugas o componentes sueltos.",
  "Check hydraulic oil level in the reservoir": "Verifique el nivel de aceite hidráulico en el depósito.",
  "Verify that all safety guards and devices are functioning properly": "Verificar que todos los dispositivos y protecciones de seguridad estén funcionando correctamente.",
  "Test emergency stop buttons": "Probar los botones de parada de emergencia",
  "Check blade condition for visible chips, cracks, or excessive wear": "Verifique el estado de la hoja para ver si hay astillas visibles, grietas o desgaste excesivo.",
  "Clean the cutting table of debris and metal chips": "Limpiar la mesa de corte de residuos y virutas de metal.",
  "Lubricate guide rails and moving parts as specified": "Lubrique los rieles guía y las piezas móviles según lo especificado.",
  "Weekly Maintenance": "Mantenimiento semanal",
  "Hydraulic System: Check oil level, condition, and temperature. Look for contamination or unusual color.": "Sistema hidráulico: Verifique el nivel, la condición y la temperatura del aceite. ",
  "Filters: Inspect hydraulic and air filters for clogging. Replace if necessary.": "Filtros: Inspeccione los filtros hidráulicos y de aire en busca de obstrucciones. ",
  "Lubrication: Grease all lubrication points according to the lubrication chart.": "Lubricación: Engrase todos los puntos de lubricación según la tabla de lubricación.",
  "Blade Clearance: Verify and adjust blade gap if needed for optimal cutting.": "Espacio libre de la hoja: verifique y ajuste el espacio de la hoja si es necesario para un corte óptimo.",
  "Back Gauge: Check accuracy and adjust if positioning errors are detected.": "Medidor trasero: verifique la precisión y ajústelo si se detectan errores de posicionamiento.",
  "Monthly Maintenance": "Mantenimiento mensual",
  "Blade Inspection: Remove and inspect blades for wear, chips, or cracks. Measure blade edge condition and remaining usable length. Rotate or flip blades to use fresh cutting edges when available.": "Inspección de las hojas: Retire e inspeccione las hojas en busca de desgaste, astillas o grietas. ",
  "Hydraulic System Service: Test hydraulic oil for contamination and viscosity. Check all hydraulic hoses for cracks, bulges, or leaks. Inspect cylinder rods for scoring or wear.": "Servicio del sistema hidráulico: Pruebe el aceite hidráulico para detectar contaminación y viscosidad. ",
  "Mechanical Components: Check wear on guide rails and adjust clearances as needed. Verify squareness of back gauge to blade. Inspect all limit switches and sensors.": "Componentes mecánicos: verifique el desgaste de los rieles guía y ajuste las holguras según sea necesario. ",
  "Blade Maintenance Best Practices": "Mejores prácticas de mantenimiento de cuchillas",
  "Blades are the most critical wear components on shearing machines:": "Las cuchillas son los componentes de desgaste más críticos en las cizallas:",
  "Maintain proper blade clearance for optimal cut quality": "Mantenga el espacio libre adecuado entre las hojas para obtener una calidad de corte óptima",
  "Rotate blades regularly - most blades have four usable edges": "Gire las cuchillas con regularidad; la mayoría de las cuchillas tienen cuatro bordes utilizables",
  "Have blades reground by specialists using proper angles and cooling": "Haga que especialistas reafilen las hojas utilizando ángulos y enfriamiento adecuados.",
  "Never exceed rated thickness capacity": "Nunca exceda la capacidad de espesor nominal",
  "Hydraulic Oil Management": "Gestión del aceite hidráulico",
  "Hydraulic system health is critical for shearing machine performance:": "La salud del sistema hidráulico es fundamental para el rendimiento de la máquina cizalla:",
  "Use only manufacturer-recommended hydraulic oil grades": "Utilice únicamente los grados de aceite hidráulico recomendados por el fabricante.",
  "Maintain proper oil temperature during operation": "Mantenga la temperatura adecuada del aceite durante la operación.",
  "Keep oil clean - contamination is the leading cause of hydraulic failures": "Mantenga el aceite limpio: la contaminación es la principal causa de fallas hidráulicas",
  "Monitor oil condition regularly": "Monitoree la condición del aceite regularmente",
  "Prevent water contamination": "Prevenir la contaminación del agua",
  "Safety Considerations": "Consideraciones de seguridad",
  "Always prioritize safety during maintenance:": "Priorice siempre la seguridad durante el mantenimiento:",
  "Lock out and tag out electrical power before servicing": "Bloquee y etiquete la energía eléctrica antes de realizar mantenimiento.",
  "Relieve hydraulic pressure before disconnecting lines": "Alivie la presión hidráulica antes de desconectar las líneas.",
  "Use proper lifting equipment when handling heavy blades": "Utilice equipo de elevación adecuado al manipular hojas pesadas.",
  "Wear appropriate PPE including safety glasses and gloves": "Utilice EPP adecuado, incluidas gafas y guantes de seguridad.",
  "Never bypass safety guards or interlocks": "Nunca pase por alto las guardas de seguridad o los enclavamientos.",
  "Conclusion": "Conclusión",
  "A well-maintained shearing machine delivers consistent performance, superior cut quality, and long service life. At Rucheng Technology, we provide detailed maintenance documentation with all our shearing machines, along with training and support to help you maximize your equipment investment.": "Una máquina cizalla bien mantenida ofrece un rendimiento constante, una calidad de corte superior y una larga vida útil. ",
  "Maintenance": "Mantenimiento",
  "View All Posts—": "Ver todas las publicaciones—",
  "Back to Blog": "Volver al blog",
  "← Back to Blog": "← Volver al Blog"
}