{
  "CNC Punching Machine": "Штамповочный станок с ЧПУ",
  "Featuring advanced CNC control and multi-tool turret system, our CNC punching machine delivers exceptional speed and versatility. Complete punching, forming, and notching operations in a single setup.": "Благодаря усовершенствованному управлению ЧПУ и револьверной системе с несколькими инструментами наш перфорационный станок с ЧПУ обеспечивает исключительную скорость и универсальность. ",
  "Request Quote": "Запросить цену",
  "Watch Video": "Посмотреть видео",
  "Technical Specifications": "Технические характеристики",
  "High-performance fiber punching system with single table design for efficient metal processing": "Высокопроизводительная система перфорации волокон с конструкцией одного стола для эффективной обработки металла.",
  "Punching Capacity": "Пробивная способность",
  "Multiple tonnage options available": "Доступны различные варианты тоннажа",
  "Customizable working area": "Настраиваемая рабочая область",
  "Material: Steel, Stainless, Aluminum": "Материал: Сталь, Нержавеющая сталь, Алюминий",
  "Various thickness capabilities": "Различные возможности толщины",
  "Control System": "Система управления",
  "CNC System: Digital Control": "Система ЧПУ: цифровое управление",
  "Multi-tool turret system": "Многоинструментальная револьверная система",
  "High positioning accuracy": "Высокая точность позиционирования",
  "High repeat accuracy": "Высокая точность повторения",
  "Key Features": "Ключевые особенности",
  "Servo motor drive system": "Система сервомоторного привода",
  "Automatic tool changing": "Автоматическая смена инструмента",
  "Multiple forming operations": "Несколько операций формования",
  "High-speed punching capability": "Возможность высокоскоростной штамповки",
  "Why Choose Our CNC Punching Machine?": "Почему стоит выбрать наш штамповочный станок с ЧПУ?",
  "Discover the key advantages that make our punching machine the preferred choice for precision metal fabrication and sheet metal processing": "Откройте для себя ключевые преимущества, которые делают наш штамповочный станок предпочтительным выбором для точного изготовления металлов и обработки листового металла.",
  "Ultra-High Precision": "Сверхвысокая точность",
  "High positioning accuracy with minimal material deformation ensures clean, burr-free punched holes": "Высокая точность позиционирования при минимальной деформации материала обеспечивает чистые отверстия без заусенцев.",
  "Minimal Material Waste": "Минимальные отходы материала",
  "Precise punching operations minimize material waste and maximize production efficiency": "Точные операции штамповки минимизируют отходы материала и максимизируют эффективность производства.",
  "Fast Punching Speeds": "Высокая скорость штамповки",
  "High-speed punching operations dramatically increase productivity and throughput": "Высокоскоростные операции штамповки значительно повышают производительность и пропускную способность.",
  "No Tool Wear": "Отсутствие износа инструмента",
  "Non-contact cutting process eliminates tool wear, reducing maintenance costs and ensuring consistent quality": "Бесконтактный процесс резки исключает износ инструмента, снижает затраты на техническое обслуживание и обеспечивает стабильное качество.",
  "Versatile Materials": "Универсальные материалы",
  "Cuts steel, stainless steel, aluminum, copper, brass, and other reflective metals with ease": "Легко режет сталь, нержавеющую сталь, алюминий, медь, латунь и другие отражающие металлы.",
  "Low Operating Cost": "Низкие эксплуатационные расходы",
  "Minimal maintenance requirements with high efficiency reducing operational expenses": "Минимальные требования к техническому обслуживанию при высокой эффективности, снижающей эксплуатационные расходы.",
  "Key Components": "Ключевые компоненты",
  "Understanding the core components that deliver precision punching performance and reliability": "Понимание основных компонентов, обеспечивающих точность и надежность штамповки.",
  "CNC Control System": "Система управления ЧПУ",
  "Advanced CNC system (CypCut or Raytools) with intuitive interface for easy programming and operation. Supports complex path planning, automatic nesting, and real-time monitoring. Compatible with standard file formats (DXF, DWG) for seamless CAD/CAM integration.": "Усовершенствованная система ЧПУ (CypCut или Raytools) с интуитивно понятным интерфейсом для простого программирования и эксплуатации. ",
  "Linear Motor Drive System": "Система линейного привода",
  "High-precision servo motor drive system with precision ball screws and linear guides. Provides fast acceleration, high positioning accuracy, and smooth motion control. Dual-drive design ensures synchronized movement and long-term stability.": "Высокоточная система сервопривода с прецизионными шариковыми винтами и линейными направляющими. ",
  "Machine Bed & CNC Punch Press": "Станина станка и пункционный пресс с ЧПУ",
  "Heavy-duty welded steel frame with stress-relief treatment ensures long-term stability. Single working table with pneumatic clamps for material positioning. Blade-type or strip-type support structure prevents small parts from falling and protects cutting head from collision damage.": "Прочная сварная стальная рама со специальной обработкой обеспечивает долговременную стабильность. ",
  "Assist Gas & Cooling System": "Вспомогательный газ и система охлаждения",
  "Precision gas delivery system with automatic pressure control for oxygen, nitrogen, or air assist. Industrial water chiller maintains optimal laser source temperature. Dust extraction system ensures clean cutting environment and protects optical components from contamination.": "Прецизионная система подачи газа с автоматическим контролем давления кислорода, азота или воздуха. ",
  "Watch Our Machine in Action": "Посмотрите нашу машину в действии",
  "See the precision and speed of our punching machine in real production": "Посмотрите точность и скорость нашей штамповочной машины в реальном производстве.",
  "Applications": "Приложения",
  "Our punching machines are widely used across various industries for precision metal cutting and complex pattern processing": "Наши штамповочные станки широко используются в различных отраслях промышленности для точной резки металла и обработки сложных рисунков.",
  "Sheet Metal Fabrication": "Изготовление листового металла",
  "Precision punching of complex patterns, intricate designs, and tight tolerances for custom fabrication": "Точная штамповка сложных рисунков, замысловатых конструкций и жесткие допуски для изготовления по индивидуальному заказу.",
  "Automotive Parts": "Автомобильные запчасти",
  "Manufacturing chassis components, exhaust systems, brackets, and precision automotive parts with tight tolerances": "Производство компонентов шасси, выхлопных систем, кронштейнов и прецизионных автомобильных деталей с жесткими допусками.",
  "Elevator & Escalator": "Лифт и Эскалатор",
  "Cutting decorative panels, structural components, and safety parts for elevator and escalator manufacturing": "Резка декоративных панелей, конструктивных элементов и деталей безопасности для производства лифтов и эскалаторов.",
  "Electronics Enclosures": "Корпуса для электроники",
  "Laser cutting of server racks, control panels, electrical cabinets with precise ventilation holes": "Лазерная резка серверных стоек, панелей управления, электрошкафов с точными вентиляционными отверстиями",
  "Agricultural Machinery": "Сельскохозяйственная техника",
  "Manufacturing parts for tractors, harvesters, and farm equipment with complex geometries": "Производство деталей для тракторов, комбайнов и сельскохозяйственной техники сложной геометрии.",
  "Fitness Equipment": "Фитнес-оборудование",
  "Cutting structural frames, decorative covers, and mechanical parts for exercise machines": "Резка каркасов конструкций, декоративных крышек и механических деталей тренажеров.",
  "Advertising & Signage": "Реклама и вывески",
  "Cutting intricate letters, logos, and decorative metal signs with smooth edges": "Вырезание сложных букв, логотипов и декоративных металлических знаков с гладкими краями.",
  "Kitchen Equipment": "Кухонное оборудование",
  "Manufacturing stainless steel sinks, countertops, appliance panels, and commercial kitchen components": "Производство раковин, столешниц, панелей для бытовой техники и компонентов коммерческих кухонь из нержавеющей стали.",
  "Standard & Optional Configuration": "Стандартная и дополнительная конфигурация",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Настройте свою машину с помощью стандартных функций и дополнительных обновлений в соответствии с вашими конкретными требованиями.",
  "Standard Configuration": "Стандартная конфигурация",
  "Optional Upgrades": "Дополнительные обновления",
  "Need help choosing the right configuration?": "Нужна помощь в выборе правильной конфигурации?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about our punching machines": "Распространенные вопросы о наших штамповочных машинах",
  "Single table punching machines have one fixed working table, offering a more economical solution suitable for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing productivity by reducing idle time.": "Вырубные машины с одним столом имеют один фиксированный рабочий стол, что является более экономичным решением, подходящим для небольших и средних объемов производства. ",
  "Our punching machines can process various thicknesses of carbon steel, stainless steel, aluminum, and copper/brass (thicknesses vary based on machine capacity). Higher tonnage machines can process thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel, aluminum alloys, copper, brass, and other sheet metals.": "Наши штамповочные станки могут обрабатывать углеродистую сталь, нержавеющую сталь, алюминий и медь/латунь различной толщины (толщина варьируется в зависимости от мощности станка). ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser gas refills or mirror alignments are needed.": "Волоконные лазеры практически не требуют обслуживания по сравнению с CO2-лазерами. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization, basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Да, мы предоставляем комплексную поддержку, включая установку на месте, ввод машины в эксплуатацию и обучение операторов (обычно 3–5 дней). ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion), assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power consumption and minimal maintenance requirements.": "Эксплуатационные затраты включают электроэнергию (волоконные лазеры высокоэффективны с электрооптическим преобразованием ~30%), вспомогательный газ (азот, кислород или сжатый воздух), электроэнергию для водяного охлаждения и периодические расходные материалы (защитные линзы, насадки). ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications or higher power configurations may require 45-60 days. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Машины стандартной конфигурации обычно отправляются в течение 30–45 дней после подтверждения заказа. ",
  "Still have questions?": "Остались вопросы?",
  "Download Technical Brochure": "Загрузить техническую брошюру",
  "Get detailed technical specifications, dimensions, and performance data for our fiber punching machines. Download our comprehensive product brochure in PDF format.": "Получите подробные технические характеристики, размеры и данные о производительности наших машин для перфорации волокна. "
}