{
  "CNC Punching Machine": "CNCパンチングマシン",
  "Featuring advanced CNC control and multi-tool turret system, our CNC punching machine delivers exceptional speed and versatility. Complete punching, forming, and notching operations in a single setup.": "高度な CNC 制御とマルチツール タレット システムを備えた当社の CNC パンチング マシンは、優れた速度と多用途性を実現します。",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "High-performance fiber punching system with single table design for efficient metal processing": "効率的な金属加工を実現するシングルテーブル設計の高性能ファイバーパンチングシステム",
  "Punching Capacity": "パンチ能力",
  "Multiple tonnage options available": "複数のトン数オプションが利用可能",
  "Customizable working area": "カスタマイズ可能な作業領域",
  "Material: Steel, Stainless, Aluminum": "材質：スチール、ステンレス、アルミニウム",
  "Various thickness capabilities": "さまざまな厚さの機能",
  "Control System": "制御システム",
  "CNC System: Digital Control": "CNC システム: デジタル制御",
  "Multi-tool turret system": "マルチツールタレットシステム",
  "High positioning accuracy": "高い位置決め精度",
  "High repeat accuracy": "高い繰り返し精度",
  "Key Features": "主な特長",
  "Servo motor drive system": "サーボモーター駆動システム",
  "Automatic tool changing": "自動工具交換",
  "Multiple forming operations": "複数の成形操作",
  "High-speed punching capability": "高速穴あけ能力",
  "Why Choose Our CNC Punching Machine?": "当社の CNC パンチングマシンを選ぶ理由?",
  "Discover the key advantages that make our punching machine the preferred choice for precision metal fabrication and sheet metal processing": "当社のパンチングマシンが精密金属製造および板金加工に最適な選択肢となる主な利点をご覧ください。",
  "Ultra-High Precision": "超高精度",
  "High positioning accuracy with minimal material deformation ensures clean, burr-free punched holes": "材料の変形を最小限に抑えた高い位置決め精度により、きれいでバリのないパンチ穴が保証されます。",
  "Minimal Material Waste": "材料の無駄を最小限に抑える",
  "Precise punching operations minimize material waste and maximize production efficiency": "正確なパンチング操作により材料の無駄を最小限に抑え、生産効率を最大化します。",
  "Fast Punching Speeds": "速いパンチング速度",
  "High-speed punching operations dramatically increase productivity and throughput": "高速パンチング動作により、生産性とスループットが大幅に向上します。",
  "No Tool Wear": "工具の摩耗なし",
  "Non-contact cutting process eliminates tool wear, reducing maintenance costs and ensuring consistent quality": "非接触切断プロセスにより工具の磨耗がなくなり、メンテナンスコストが削減され、安定した品質が確保されます。",
  "Versatile Materials": "多用途な素材",
  "Cuts steel, stainless steel, aluminum, copper, brass, and other reflective metals with ease": "鋼、ステンレス鋼、アルミニウム、銅、真鍮、その他の反射金属を簡単に切断します。",
  "Low Operating Cost": "低い運用コスト",
  "Minimal maintenance requirements with high efficiency reducing operational expenses": "メンテナンス要件を最小限に抑え、高効率で運用コストを削減",
  "Key Components": "主要コンポーネント",
  "Understanding the core components that deliver precision punching performance and reliability": "精密なパンチング性能と信頼性を実現するコアコンポーネントを理解する",
  "CNC Control System": "CNC制御システム",
  "Advanced CNC system (CypCut or Raytools) with intuitive interface for easy programming and operation. Supports complex path planning, automatic nesting, and real-time monitoring. Compatible with standard file formats (DXF, DWG) for seamless CAD/CAM integration.": "プログラミングと操作が簡単な直感的なインターフェイスを備えた高度な CNC システム (CypCut または Raytools)。",
  "Linear Motor Drive System": "リニアモーター駆動システム",
  "High-precision servo motor drive system with precision ball screws and linear guides. Provides fast acceleration, high positioning accuracy, and smooth motion control. Dual-drive design ensures synchronized movement and long-term stability.": "精密ボールネジとリニアガイドを採用した高精度サーボモータ駆動システム。",
  "Machine Bed & CNC Punch Press": "マシンベッド＆CNCパンチプレス",
  "Heavy-duty welded steel frame with stress-relief treatment ensures long-term stability. Single working table with pneumatic clamps for material positioning. Blade-type or strip-type support structure prevents small parts from falling and protects cutting head from collision damage.": "応力緩和処理を施した頑丈な溶接スチールフレームにより、長期的な安定性が保証されます。",
  "Assist Gas & Cooling System": "アシストガス＆冷却システム",
  "Precision gas delivery system with automatic pressure control for oxygen, nitrogen, or air assist. Industrial water chiller maintains optimal laser source temperature. Dust extraction system ensures clean cutting environment and protects optical components from contamination.": "酸素、窒素、またはエアアシスト用の自動圧力制御を備えた高精度ガス供給システム。",
  "Watch Our Machine in Action": "機械の動作をご覧ください",
  "See the precision and speed of our punching machine in real production": "実際の生産現場で当社のパンチングマシンの精度とスピードをご覧ください。",
  "Applications": "アプリケーション",
  "Our punching machines are widely used across various industries for precision metal cutting and complex pattern processing": "当社のパンチングマシンは、精密な金属切断や複雑なパターン加工にさまざまな業界で幅広く使用されています。",
  "Sheet Metal Fabrication": "板金加工",
  "Precision punching of complex patterns, intricate designs, and tight tolerances for custom fabrication": "複雑なパターン、複雑なデザイン、カスタム製造のための厳しい公差の精密なパンチング",
  "Automotive Parts": "自動車部品",
  "Manufacturing chassis components, exhaust systems, brackets, and precision automotive parts with tight tolerances": "シャーシコンポーネント、排気システム、ブラケット、および厳しい公差での精密自動車部品の製造",
  "Elevator & Escalator": "エレベーター＆エスカレーター",
  "Cutting decorative panels, structural components, and safety parts for elevator and escalator manufacturing": "エレベーター、エスカレーター製造用の化粧パネル、構造部品、安全部品の切断",
  "Electronics Enclosures": "電子機器の筐体",
  "Laser cutting of server racks, control panels, electrical cabinets with precise ventilation holes": "精密な通気孔を備えたサーバーラック、制御パネル、電気キャビネットのレーザー切断",
  "Agricultural Machinery": "農業機械",
  "Manufacturing parts for tractors, harvesters, and farm equipment with complex geometries": "複雑な形状のトラクター、ハーベスター、農機具の部品の製造",
  "Fitness Equipment": "フィットネス機器",
  "Cutting structural frames, decorative covers, and mechanical parts for exercise machines": "運動器具の構造フレーム、装飾カバー、機械部品の切断",
  "Advertising & Signage": "広告と看板",
  "Cutting intricate letters, logos, and decorative metal signs with smooth edges": "複雑な文字、ロゴ、装飾的な金属サインを滑らかなエッジで切断します。",
  "Kitchen Equipment": "厨房機器",
  "Manufacturing stainless steel sinks, countertops, appliance panels, and commercial kitchen components": "ステンレス製のシンク、カウンタートップ、家電パネル、業務用厨房部品の製造",
  "Standard & Optional Configuration": "標準およびオプションの構成",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "標準機能とオプションのアップグレードを使用してマシンをカスタマイズし、特定の要件を満たすことができます",
  "Standard Configuration": "標準構成",
  "Optional Upgrades": "オプションのアップグレード",
  "Need help choosing the right configuration?": "適切な構成を選択するのにサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about our punching machines": "パンチングマシンに関するよくある質問",
  "Single table punching machines have one fixed working table, offering a more economical solution suitable for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing productivity by reducing idle time.": "シングルテーブルパンチングマシンには 1 つの固定作業テーブルがあり、低生産量から中生産量に適したより経済的なソリューションを提供します。",
  "Our punching machines can process various thicknesses of carbon steel, stainless steel, aluminum, and copper/brass (thicknesses vary based on machine capacity). Higher tonnage machines can process thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel, aluminum alloys, copper, brass, and other sheet metals.": "当社のパンチングマシンは、さまざまな厚さの炭素鋼、ステンレス鋼、アルミニウム、銅/真鍮を加工できます (厚さは機械の能力によって異なります)。",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser gas refills or mirror alignments are needed.": "ファイバー レーザーは、CO2 レーザーと比べてメンテナンスがほとんど不要です。",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization, basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "はい、オンサイトでの設置、機械の試運転、オペレーターのトレーニング (通常 3 ～ 5 日) を含む包括的なサポートを提供します。",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion), assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power consumption and minimal maintenance requirements.": "運用コストには、電気 (ファイバー レーザーは約 30% の電気光学変換で高効率です)、アシスト ガス (窒素、酸素、または圧縮空気)、冷水器の電気、および場合によっては消耗品 (保護レンズ、ノズル) が含まれます。",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications or higher power configurations may require 45-60 days. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "標準構成のマシンは通常、注文確認後 30 ～ 45 日以内に出荷されます。",
  "Still have questions?": "まだ質問がありますか?",
  "Download Technical Brochure": "技術パンフレットをダウンロード",
  "Get detailed technical specifications, dimensions, and performance data for our fiber punching machines. Download our comprehensive product brochure in PDF format.": "当社のファイバーパンチングマシンの詳細な技術仕様、寸法、性能データを入手してください。"
}