{
  "CNC Punching Machine": "Poinçonneuse CNC",
  "Featuring advanced CNC control and multi-tool turret system, our CNC punching machine delivers exceptional speed and versatility. Complete punching, forming, and notching operations in a single setup.": "Dotée d'un contrôle CNC avancé et d'un système de tourelle multi-outils, notre poinçonneuse CNC offre une vitesse et une polyvalence exceptionnelles. ",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "High-performance fiber punching system with single table design for efficient metal processing": "Système de poinçonnage de fibres hautes performances avec une conception à table unique pour un traitement efficace des métaux",
  "Punching Capacity": "Capacité de poinçonnage",
  "Multiple tonnage options available": "Plusieurs options de tonnage disponibles",
  "Customizable working area": "Espace de travail personnalisable",
  "Material: Steel, Stainless, Aluminum": "Matériau : acier, inoxydable, aluminium.",
  "Various thickness capabilities": "Différentes capacités d'épaisseur",
  "Control System": "Système de contrôle",
  "CNC System: Digital Control": "Système CNC : contrôle numérique",
  "Multi-tool turret system": "Système de tourelle multi-outils",
  "High positioning accuracy": "Haute précision de positionnement",
  "High repeat accuracy": "Haute précision de répétition",
  "Key Features": "Principales fonctionnalités",
  "Servo motor drive system": "Système d'entraînement par servomoteur",
  "Automatic tool changing": "Changement d'outil automatique",
  "Multiple forming operations": "Opérations de formage multiples",
  "High-speed punching capability": "Capacité de poinçonnage à grande vitesse",
  "Why Choose Our CNC Punching Machine?": "Pourquoi choisir notre poinçonneuse CNC ?",
  "Discover the key advantages that make our punching machine the preferred choice for precision metal fabrication and sheet metal processing": "Découvrez les principaux avantages qui font de notre poinçonneuse le choix privilégié pour la fabrication métallique de précision et le traitement de la tôle.",
  "Ultra-High Precision": "Ultra-haute précision",
  "High positioning accuracy with minimal material deformation ensures clean, burr-free punched holes": "Une précision de positionnement élevée avec une déformation minimale du matériau garantit des trous perforés propres et sans bavures",
  "Minimal Material Waste": "Déchets de matériaux minimes",
  "Precise punching operations minimize material waste and maximize production efficiency": "Des opérations de poinçonnage précises minimisent le gaspillage de matériaux et maximisent l'efficacité de la production",
  "Fast Punching Speeds": "Vitesses de poinçonnage rapides",
  "High-speed punching operations dramatically increase productivity and throughput": "Les opérations de poinçonnage à grande vitesse augmentent considérablement la productivité et le débit",
  "No Tool Wear": "Aucune usure des outils",
  "Non-contact cutting process eliminates tool wear, reducing maintenance costs and ensuring consistent quality": "Le processus de coupe sans contact élimine l'usure des outils, réduisant ainsi les coûts de maintenance et garantissant une qualité constante",
  "Versatile Materials": "Matériaux polyvalents",
  "Cuts steel, stainless steel, aluminum, copper, brass, and other reflective metals with ease": "Coupe facilement l'acier, l'acier inoxydable, l'aluminium, le cuivre, le laiton et d'autres métaux réfléchissants.",
  "Low Operating Cost": "Faible coût d'exploitation",
  "Minimal maintenance requirements with high efficiency reducing operational expenses": "Exigences de maintenance minimales avec une efficacité élevée réduisant les dépenses opérationnelles",
  "Key Components": "Composants clés",
  "Understanding the core components that deliver precision punching performance and reliability": "Comprendre les composants de base qui offrent des performances et une fiabilité de poinçonnage de précision",
  "CNC Control System": "Système de contrôle CNC",
  "Advanced CNC system (CypCut or Raytools) with intuitive interface for easy programming and operation. Supports complex path planning, automatic nesting, and real-time monitoring. Compatible with standard file formats (DXF, DWG) for seamless CAD/CAM integration.": "Système CNC avancé (CypCut ou Raytools) avec interface intuitive pour une programmation et une utilisation faciles. ",
  "Linear Motor Drive System": "Système d'entraînement à moteur linéaire",
  "High-precision servo motor drive system with precision ball screws and linear guides. Provides fast acceleration, high positioning accuracy, and smooth motion control. Dual-drive design ensures synchronized movement and long-term stability.": "Système d'entraînement servomoteur de haute précision avec vis à billes de précision et guides linéaires. ",
  "Machine Bed & CNC Punch Press": "Lit de machine et poinçonneuse CNC",
  "Heavy-duty welded steel frame with stress-relief treatment ensures long-term stability. Single working table with pneumatic clamps for material positioning. Blade-type or strip-type support structure prevents small parts from falling and protects cutting head from collision damage.": "Le cadre en acier soudé robuste avec traitement anti-stress assure une stabilité à long terme. ",
  "Assist Gas & Cooling System": "Système d'assistance au gaz et au refroidissement",
  "Precision gas delivery system with automatic pressure control for oxygen, nitrogen, or air assist. Industrial water chiller maintains optimal laser source temperature. Dust extraction system ensures clean cutting environment and protects optical components from contamination.": "Système de distribution de gaz de précision avec contrôle automatique de la pression pour l'oxygène, l'azote ou l'air. ",
  "Watch Our Machine in Action": "Regardez notre machine en action",
  "See the precision and speed of our punching machine in real production": "Découvrez la précision et la rapidité de notre poinçonneuse en production réelle",
  "Applications": "Applications",
  "Our punching machines are widely used across various industries for precision metal cutting and complex pattern processing": "Nos poinçonneuses sont largement utilisées dans diverses industries pour la découpe de précision des métaux et le traitement de motifs complexes.",
  "Sheet Metal Fabrication": "Fabrication de tôles",
  "Precision punching of complex patterns, intricate designs, and tight tolerances for custom fabrication": "Poinçonnage de précision de motifs complexes, de conceptions complexes et de tolérances serrées pour une fabrication personnalisée",
  "Automotive Parts": "Pièces automobiles",
  "Manufacturing chassis components, exhaust systems, brackets, and precision automotive parts with tight tolerances": "Fabrication de composants de châssis, de systèmes d'échappement, de supports et de pièces automobiles de précision avec des tolérances serrées",
  "Elevator & Escalator": "Ascenseur et escalier roulant",
  "Cutting decorative panels, structural components, and safety parts for elevator and escalator manufacturing": "Découpe de panneaux décoratifs, de composants structurels et de pièces de sécurité pour la fabrication d'ascenseurs et d'escaliers mécaniques",
  "Electronics Enclosures": "Boîtiers électroniques",
  "Laser cutting of server racks, control panels, electrical cabinets with precise ventilation holes": "Découpe laser de racks de serveurs, panneaux de contrôle, armoires électriques avec trous de ventilation précis",
  "Agricultural Machinery": "Machines agricoles",
  "Manufacturing parts for tractors, harvesters, and farm equipment with complex geometries": "Fabrication de pièces pour tracteurs, moissonneuses et équipements agricoles aux géométries complexes",
  "Fitness Equipment": "Équipement de conditionnement physique",
  "Cutting structural frames, decorative covers, and mechanical parts for exercise machines": "Découpe de cadres structurels, de couvercles décoratifs et de pièces mécaniques pour appareils d'exercice",
  "Advertising & Signage": "Publicité et signalisation",
  "Cutting intricate letters, logos, and decorative metal signs with smooth edges": "Découpe de lettres complexes, de logos et de panneaux métalliques décoratifs aux bords lisses",
  "Kitchen Equipment": "Équipement de cuisine",
  "Manufacturing stainless steel sinks, countertops, appliance panels, and commercial kitchen components": "Fabrication d'éviers, de comptoirs, de panneaux d'appareils électroménagers et de composants de cuisine commerciale en acier inoxydable",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personnalisez votre machine avec des fonctionnalités standard et des mises à niveau facultatives pour répondre à vos besoins spécifiques",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need help choosing the right configuration?": "Besoin d'aide pour choisir la bonne configuration ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our punching machines": "Questions courantes sur nos poinçonneuses",
  "Single table punching machines have one fixed working table, offering a more economical solution suitable for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing productivity by reducing idle time.": "Les poinçonneuses à table unique disposent d'une table de travail fixe, offrant une solution plus économique adaptée aux volumes de production faibles à moyens. ",
  "Our punching machines can process various thicknesses of carbon steel, stainless steel, aluminum, and copper/brass (thicknesses vary based on machine capacity). Higher tonnage machines can process thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel, aluminum alloys, copper, brass, and other sheet metals.": "Nos poinçonneuses peuvent traiter différentes épaisseurs d'acier au carbone, d'acier inoxydable, d'aluminium et de cuivre/laiton (les épaisseurs varient en fonction de la capacité de la machine). ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser gas refills or mirror alignments are needed.": "Les lasers à fibre ne nécessitent presque aucun entretien par rapport aux lasers CO2. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization, basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Oui, nous fournissons une assistance complète comprenant l'installation sur site, la mise en service de la machine et la formation des opérateurs (généralement 3 à 5 jours). ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion), assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power consumption and minimal maintenance requirements.": "Les coûts de fonctionnement comprennent l'électricité (les lasers à fibre sont très efficaces avec une conversion électro-optique d'environ 30 %), le gaz d'assistance (azote, oxygène ou air comprimé), l'électricité du refroidisseur d'eau et les consommables occasionnels (lentilles de protection, buses). ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications or higher power configurations may require 45-60 days. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Les machines à configuration standard sont généralement expédiées dans les 30 à 45 jours suivant la confirmation de la commande. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Get detailed technical specifications, dimensions, and performance data for our fiber punching machines. Download our comprehensive product brochure in PDF format.": "Obtenez des spécifications techniques détaillées, des dimensions et des données de performances pour nos poinçonneuses de fibres. "
}