{
  "CNC Hydraulic Guillotine Shearing Machine": "Cizalla guillotina hidráulica CNC",
  "Featuring precision vertical blade motion and advanced CNC control, our hydraulic guillotine shearing machine delivers exceptional cutting accuracy with minimal material waste and superior edge quality for various sheet metal applications.": "Con un movimiento vertical de precisión de la hoja y un control CNC avanzado, nuestra máquina cizalla de guillotina hidráulica ofrece una precisión de corte excepcional con un desperdicio mínimo de material y una calidad de borde superior para diversas aplicaciones de chapa metálica.",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "Advanced hydraulic guillotine shearing machine with NC control and precision cutting": "Cizalla guillotina hidráulica avanzada con control NC y corte de precisión",
  "Cutting Capacity": "Capacidad de corte",
  "Available in various capacity ranges": "Disponible en varios rangos de capacidad",
  "Multiple width options to suit different needs": "Múltiples opciones de ancho para adaptarse a diferentes necesidades",
  "Material: Steel, Stainless, Aluminum, Brass": "Material: acero, inoxidable, aluminio, latón",
  "Accuracy: ±0.01mm (CNC), ±0.1mm (Standard)": "Precisión: ±0,01 mm (CNC), ±0,1 mm (estándar)",
  "Control System": "Sistema de control",
  "NC Controller: Advanced digital": "Controlador NC: digital avanzado",
  "Back Gauge: Motorized ball screw": "Tope trasero: Husillo de bolas motorizado",
  "Stroke Counter: Digital display": "Contador de golpes: pantalla digital",
  "Programming: Cut length adjustment": "Programación: Ajuste de longitud de corte",
  "Key Features": "Características clave",
  "Vertical blade mechanism": "Mecanismo de cuchilla vertical",
  "CNC/NC hydraulic drive system": "Sistema de accionamiento hidráulico CNC/NC",
  "Adjustable cutting angle capability": "Capacidad de ángulo de corte ajustable",
  "Multi-step programming (CNC)": "Programación multipaso (CNC)",
  "Why Choose Our Guillotine Shearing Machine?": "¿Por qué elegir nuestra cizalla guillotina?",
  "Discover the key advantages that make our hydraulic guillotine shearing machine the preferred choice for sheet metal processing": "Descubra las ventajas clave que hacen de nuestra cizalla guillotina hidráulica la opción preferida para el procesamiento de chapa metálica.",
  "Superior Precision": "Precisión superior",
  "CNC models achieve cutting accuracy up to ±0.01mm with minimal distortion for demanding applications": "Los modelos CNC logran una precisión de corte de hasta ±0,01 mm con una distorsión mínima para aplicaciones exigentes.",
  "Minimal Material Waste": "Desperdicio mínimo de material",
  "Straight vertical cutting action produces virtually no material loss, maximizing efficiency and reducing costs": "La acción de corte vertical recta prácticamente no produce pérdida de material, lo que maximiza la eficiencia y reduce los costos.",
  "Heavy-Duty Capacity": "Capacidad de servicio pesado",
  "Capable of cutting thick materials in various metals including steel, stainless steel, aluminum, and brass with reliable performance": "Capaz de cortar materiales gruesos en varios metales, incluidos acero, acero inoxidable, aluminio y latón, con un rendimiento confiable",
  "Versatile Operation": "Operación versátil",
  "Adjustable cutting angles and multi-step programming enhance flexibility for diverse cutting requirements": "Los ángulos de corte ajustables y la programación de varios pasos mejoran la flexibilidad para diversos requisitos de corte",
  "Enhanced Safety": "Seguridad mejorada",
  "Operator stands clear of cutting zone with comprehensive guards, light curtains, and emergency stop systems": "El operador se mantiene alejado de la zona de corte con protecciones integrales, cortinas de luz y sistemas de parada de emergencia.",
  "Cost-Effective": "Rentable",
  "Affordable investment with low operating costs and long-term reliability for businesses of all sizes": "Inversión asequible con bajos costos operativos y confiabilidad a largo plazo para empresas de todos los tamaños",
  "Components": "Componentes",
  "Better understand the machine performance through detailed component descriptions and technical features": "Comprender mejor el rendimiento de la máquina a través de descripciones detalladas de los componentes y características técnicas.",
  "Frame Structure": "Estructura del marco",
  "The machine frame is constructed from heavy-duty welded steel with reinforced structure design. The robust vertical blade frame provides exceptional rigidity and stability, ensuring precise straight cuts and long-term accuracy even under continuous heavy-duty operation.": "El bastidor de la máquina está construido con acero soldado de alta resistencia con un diseño de estructura reforzada. ",
  "Controller": "Controlador",
  "Estun E21s, E200PS and Delem DAC310T controller can be used": "Se pueden utilizar los controladores Estun E21s, E200PS y Delem DAC310T.",
  "Hydraulic System": "Sistema hidráulico",
  "Equipped with high-quality hydraulic components, the system provides stable and reliable cutting force. The hydraulic drive ensures smooth operation with low noise levels and excellent energy efficiency. Built-in oil cooling system maintains optimal operating temperature.": "Equipado con componentes hidráulicos de alta calidad, el sistema proporciona una fuerza de corte estable y confiable. ",
  "NC Back Gauge System": "Sistema de tope trasero NC",
  "The motorized ball screw back gauge provides precise positioning with extended travel distance options. NC controller allows for programmable movements and automatic positioning, significantly improving efficiency and accuracy for repetitive cutting operations.": "El tope posterior del husillo de bolas motorizado proporciona un posicionamiento preciso con opciones de distancia de recorrido extendida. ",
  "Blade System": "Sistema de cuchillas",
  "High-quality tool steel blades with four usable cutting edges provide long service life and consistent cutting quality. Manual single-point blade gap adjustment allows for optimization based on material thickness, ensuring clean cuts with minimal burr formation.": "Las hojas de acero para herramientas de alta calidad con cuatro filos de corte utilizables brindan una larga vida útil y una calidad de corte constante. ",
  "Electrical System": "Sistema eléctrico",
  "The electrical system features high-quality components from renowned brands, ensuring reliable operation and long service life. The system includes industrial-grade motors, precision contactors, thermal overload protection, and an intuitive control panel. All electrical components are housed in a protective enclosure that meets international safety standards, providing stable and safe operation for the machine.": "El sistema eléctrico cuenta con componentes de alta calidad de marcas reconocidas, lo que garantiza un funcionamiento confiable y una larga vida útil. ",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "See the precision and efficiency of our hydraulic guillotine shearing machine": "Vea la precisión y eficiencia de nuestra cizalla guillotina hidráulica",
  "Applications": "Aplicaciones",
  "Our guillotine shearing machines are widely used across various industries for precision metal cutting": "Nuestras cizallas de guillotina se utilizan ampliamente en diversas industrias para el corte de metales de precisión.",
  "Sheet Metal Fabrication": "Fabricación de chapa metálica",
  "Precision cutting of steel, stainless steel, and aluminum sheets for various fabrication needs": "Corte de precisión de láminas de acero, acero inoxidable y aluminio para diversas necesidades de fabricación.",
  "Automotive Industry": "Industria automotriz",
  "Manufacturing of body panels, brackets, and structural components with clean edges": "Fabricación de paneles de carrocería, soportes y componentes estructurales con bordes limpios",
  "Construction": "Construcción",
  "Cutting metal sheets for roofing, siding, and structural steel components": "Corte de láminas de metal para techos, revestimientos y componentes de acero estructural.",
  "HVAC Manufacturing": "Fabricación de climatización",
  "Processing ductwork, ventilation panels, and air conditioning components": "Procesamiento de conductos, paneles de ventilación y componentes de aire acondicionado.",
  "Electronics Enclosures": "Cajas electrónicas",
  "Manufacturing cabinet panels, server racks, and control panel housings": "Fabricación de paneles de gabinetes, bastidores de servidores y carcasas de paneles de control.",
  "Machinery Manufacturing": "Fabricación de maquinaria",
  "Cutting metal parts for industrial equipment, machine guards, and custom components": "Corte de piezas metálicas para equipos industriales, protectores de máquinas y componentes personalizados.",
  "Furniture Industry": "Industria del mueble",
  "Processing metal furniture components, cabinets, and decorative panels": "Procesamiento de componentes metálicos para muebles, armarios y paneles decorativos.",
  "Shipbuilding": "Construcción naval",
  "Cutting steel plates for hull construction, bulkheads, and marine structures": "Corte de placas de acero para construcción de cascos, mamparos y estructuras marinas.",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personalice su máquina con funciones estándar y actualizaciones opcionales para satisfacer sus requisitos específicos",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our hydraulic guillotine shearing machines": "Preguntas comunes sobre nuestras cizallas de guillotina hidráulica",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and the ability to cut thicker materials. They produce minimal material waste and are ideal for applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller footprint, and are better suited for thinner materials.": "Las cizallas de guillotina utilizan un movimiento de hoja vertical que desciende hacia abajo, lo que proporciona mayor precisión y la capacidad de cortar materiales más gruesos. ",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel, aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and machine model. Please contact us for specific capacity options for your application.": "Nuestras máquinas cortadoras de guillotina pueden procesar diversos materiales metálicos, incluidos acero dulce, acero inoxidable, aluminio, cobre, latón y otras láminas de metal. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life. Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions, blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Las hojas están diseñadas con cuatro filos de corte utilizables, lo que prolonga significativamente su vida útil. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting. Training materials and operation manuals are also provided.": "Sí, brindamos capacitación integral para operadores como parte de nuestro servicio de instalación. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your order and keep you updated throughout the manufacturing process.": "Las configuraciones estándar generalmente se envían dentro de 30 a 45 días desde la confirmación del pedido. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "El mantenimiento regular es simple y directo: verifique los niveles de aceite hidráulico semanalmente, limpie la máquina diariamente, lubrique las piezas móviles según el cronograma e inspeccione el estado de la hoja con regularidad. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Get detailed technical specifications, dimensions, and performance data for our hydraulic guillotine shearing machines. Download our comprehensive product brochure in PDF format.": "Obtenga especificaciones técnicas detalladas, dimensiones y datos de rendimiento de nuestras cizallas de guillotina hidráulica. "
}