{
  "CNC Hydraulic Guillotine Shearing Machine": "Cisaille à guillotine hydraulique CNC",
  "Featuring precision vertical blade motion and advanced CNC control, our hydraulic guillotine shearing machine delivers exceptional cutting accuracy with minimal material waste and superior edge quality for various sheet metal applications.": "Dotée d'un mouvement vertical de précision de la lame et d'un contrôle CNC avancé, notre cisaille guillotine hydraulique offre une précision de coupe exceptionnelle avec un minimum de déchets de matériaux et une qualité de bord supérieure pour diverses applications de tôlerie.",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "Advanced hydraulic guillotine shearing machine with NC control and precision cutting": "Cisaille guillotine hydraulique avancée avec commande NC et coupe de précision",
  "Cutting Capacity": "Capacité de coupe",
  "Available in various capacity ranges": "Disponible dans différentes gammes de capacités",
  "Multiple width options to suit different needs": "Plusieurs options de largeur pour répondre à différents besoins",
  "Material: Steel, Stainless, Aluminum, Brass": "Matériau : acier, inoxydable, aluminium, laiton.",
  "Accuracy: ±0.01mm (CNC), ±0.1mm (Standard)": "Précision : ±0,01 mm (CNC), ±0,1 mm (standard)",
  "Control System": "Système de contrôle",
  "NC Controller: Advanced digital": "Contrôleur NC : numérique avancé",
  "Back Gauge: Motorized ball screw": "Jauge arrière : Vis à billes motorisée",
  "Stroke Counter: Digital display": "Compteur de coups : affichage numérique",
  "Programming: Cut length adjustment": "Programmation : Réglage de la longueur de coupe",
  "Key Features": "Principales fonctionnalités",
  "Vertical blade mechanism": "Mécanisme à lame verticale",
  "CNC/NC hydraulic drive system": "Système d'entraînement hydraulique CNC/NC",
  "Adjustable cutting angle capability": "Capacité d'angle de coupe réglable",
  "Multi-step programming (CNC)": "Programmation multi-étapes (CNC)",
  "Why Choose Our Guillotine Shearing Machine?": "Pourquoi choisir notre cisaille guillotine ?",
  "Discover the key advantages that make our hydraulic guillotine shearing machine the preferred choice for sheet metal processing": "Découvrez les principaux avantages qui font de notre cisaille guillotine hydraulique le choix privilégié pour le traitement de la tôle.",
  "Superior Precision": "Précision supérieure",
  "CNC models achieve cutting accuracy up to ±0.01mm with minimal distortion for demanding applications": "Les modèles CNC atteignent une précision de coupe allant jusqu'à ± 0,01 mm avec une distorsion minimale pour les applications exigeantes",
  "Minimal Material Waste": "Déchets de matériaux minimes",
  "Straight vertical cutting action produces virtually no material loss, maximizing efficiency and reducing costs": "L'action de coupe verticale droite ne produit pratiquement aucune perte de matière, maximisant l'efficacité et réduisant les coûts",
  "Heavy-Duty Capacity": "Capacité robuste",
  "Capable of cutting thick materials in various metals including steel, stainless steel, aluminum, and brass with reliable performance": "Capable de couper des matériaux épais dans divers métaux, notamment l'acier, l'acier inoxydable, l'aluminium et le laiton, avec des performances fiables",
  "Versatile Operation": "Fonctionnement polyvalent",
  "Adjustable cutting angles and multi-step programming enhance flexibility for diverse cutting requirements": "Les angles de coupe réglables et la programmation en plusieurs étapes améliorent la flexibilité pour répondre à diverses exigences de coupe",
  "Enhanced Safety": "Sécurité améliorée",
  "Operator stands clear of cutting zone with comprehensive guards, light curtains, and emergency stop systems": "L'opérateur se tient à l'écart de la zone de coupe grâce à des protections complètes, des barrières immatérielles et des systèmes d'arrêt d'urgence",
  "Cost-Effective": "Rentable",
  "Affordable investment with low operating costs and long-term reliability for businesses of all sizes": "Un investissement abordable avec de faibles coûts d'exploitation et une fiabilité à long terme pour les entreprises de toutes tailles",
  "Components": "Composants",
  "Better understand the machine performance through detailed component descriptions and technical features": "Mieux comprendre les performances de la machine grâce à des descriptions détaillées des composants et des caractéristiques techniques",
  "Frame Structure": "Structure du cadre",
  "The machine frame is constructed from heavy-duty welded steel with reinforced structure design. The robust vertical blade frame provides exceptional rigidity and stability, ensuring precise straight cuts and long-term accuracy even under continuous heavy-duty operation.": "Le châssis de la machine est construit en acier soudé robuste avec une structure renforcée. ",
  "Controller": "Contrôleur",
  "Estun E21s, E200PS and Delem DAC310T controller can be used": "Les contrôleurs Estun E21s, E200PS et Delem DAC310T peuvent être utilisés",
  "Hydraulic System": "Système hydraulique",
  "Equipped with high-quality hydraulic components, the system provides stable and reliable cutting force. The hydraulic drive ensures smooth operation with low noise levels and excellent energy efficiency. Built-in oil cooling system maintains optimal operating temperature.": "Équipé de composants hydrauliques de haute qualité, le système fournit une force de coupe stable et fiable. ",
  "NC Back Gauge System": "Système de jauge arrière NC",
  "The motorized ball screw back gauge provides precise positioning with extended travel distance options. NC controller allows for programmable movements and automatic positioning, significantly improving efficiency and accuracy for repetitive cutting operations.": "La butée arrière à vis à billes motorisée offre un positionnement précis avec des options de distance de déplacement étendues. ",
  "Blade System": "Système de lame",
  "High-quality tool steel blades with four usable cutting edges provide long service life and consistent cutting quality. Manual single-point blade gap adjustment allows for optimization based on material thickness, ensuring clean cuts with minimal burr formation.": "Les lames en acier à outils de haute qualité avec quatre tranchants utilisables offrent une longue durée de vie et une qualité de coupe constante. ",
  "Electrical System": "Système électrique",
  "The electrical system features high-quality components from renowned brands, ensuring reliable operation and long service life. The system includes industrial-grade motors, precision contactors, thermal overload protection, and an intuitive control panel. All electrical components are housed in a protective enclosure that meets international safety standards, providing stable and safe operation for the machine.": "Le système électrique comprend des composants de haute qualité de marques renommées, garantissant un fonctionnement fiable et une longue durée de vie. ",
  "Watch Our Machine in Action": "Regardez notre machine en action",
  "See the precision and efficiency of our hydraulic guillotine shearing machine": "Découvrez la précision et l’efficacité de notre cisaille guillotine hydraulique",
  "Applications": "Applications",
  "Our guillotine shearing machines are widely used across various industries for precision metal cutting": "Nos cisailles guillotine sont largement utilisées dans diverses industries pour la coupe de précision des métaux.",
  "Sheet Metal Fabrication": "Fabrication de tôles",
  "Precision cutting of steel, stainless steel, and aluminum sheets for various fabrication needs": "Découpe de précision de tôles d'acier, d'acier inoxydable et d'aluminium pour divers besoins de fabrication",
  "Automotive Industry": "Industrie automobile",
  "Manufacturing of body panels, brackets, and structural components with clean edges": "Fabrication de panneaux de carrosserie, de supports et de composants structurels aux bords nets",
  "Construction": "Construction",
  "Cutting metal sheets for roofing, siding, and structural steel components": "Découpe de tôles pour les composants de toiture, de bardage et de construction en acier",
  "HVAC Manufacturing": "Fabrication de CVC",
  "Processing ductwork, ventilation panels, and air conditioning components": "Traitement des conduits, des panneaux de ventilation et des composants de climatisation",
  "Electronics Enclosures": "Boîtiers électroniques",
  "Manufacturing cabinet panels, server racks, and control panel housings": "Fabrication de panneaux d'armoires, de racks de serveurs et de boîtiers de panneaux de commande",
  "Machinery Manufacturing": "Fabrication de machines",
  "Cutting metal parts for industrial equipment, machine guards, and custom components": "Découpe de pièces métalliques pour équipements industriels, protections de machines et composants personnalisés",
  "Furniture Industry": "Industrie du meuble",
  "Processing metal furniture components, cabinets, and decorative panels": "Traitement de composants de meubles, d'armoires et de panneaux décoratifs en métal",
  "Shipbuilding": "Construction navale",
  "Cutting steel plates for hull construction, bulkheads, and marine structures": "Découpe de plaques d'acier pour la construction de coques, de cloisons et de structures marines",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personnalisez votre machine avec des fonctionnalités standard et des mises à niveau facultatives pour répondre à vos besoins spécifiques",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need help choosing the right configuration?": "Besoin d'aide pour choisir la bonne configuration ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our hydraulic guillotine shearing machines": "Questions courantes sur nos cisailles à guillotine hydrauliques",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and the ability to cut thicker materials. They produce minimal material waste and are ideal for applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller footprint, and are better suited for thinner materials.": "Les cisailles guillotine utilisent un mouvement de lame vertical qui descend vers le bas, offrant une plus grande précision et la possibilité de couper des matériaux plus épais. ",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel, aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and machine model. Please contact us for specific capacity options for your application.": "Nos cisailles à guillotine peuvent traiter divers matériaux métalliques, notamment l'acier doux, l'acier inoxydable, l'aluminium, le cuivre, le laiton et d'autres tôles métalliques. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life. Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions, blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Les lames sont conçues avec quatre tranchants utilisables, ce qui prolonge considérablement leur durée de vie. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting. Training materials and operation manuals are also provided.": "Oui, nous proposons une formation complète des opérateurs dans le cadre de notre service d’installation. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your order and keep you updated throughout the manufacturing process.": "Les configurations standard sont généralement expédiées dans les 30 à 45 jours suivant la confirmation de la commande. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "L'entretien régulier est simple et direct : vérifiez les niveaux d'huile hydraulique chaque semaine, nettoyez la machine quotidiennement, lubrifiez les pièces mobiles selon le calendrier et inspectez régulièrement l'état de la lame. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Get detailed technical specifications, dimensions, and performance data for our hydraulic guillotine shearing machines. Download our comprehensive product brochure in PDF format.": "Obtenez des spécifications techniques détaillées, des dimensions et des données de performances pour nos cisailles à guillotine hydrauliques. "
}