{
  "CNC Hydraulic Guillotine Shearing Machine": "Гидравлические гильотинные ножницы с ЧПУ",
  "Featuring precision vertical blade motion and advanced CNC control, our hydraulic guillotine shearing machine delivers exceptional cutting accuracy with minimal material waste and superior edge quality for various sheet metal applications.": "Благодаря точному вертикальному движению лезвия и усовершенствованному управлению с ЧПУ наши гидравлические гильотинные ножницы обеспечивают исключительную точность резки с минимальными отходами материала и превосходным качеством кромок для различных применений листового металла.",
  "Request Quote": "Запросить цену",
  "Watch Video": "Посмотреть видео",
  "Technical Specifications": "Технические характеристики",
  "Advanced hydraulic guillotine shearing machine with NC control and precision cutting": "Усовершенствованная гидравлическая гильотинная машина для резки с ЧПУ и точной резкой.",
  "Cutting Capacity": "Режущая способность",
  "Available in various capacity ranges": "Доступен в различных диапазонах производительности",
  "Multiple width options to suit different needs": "Несколько вариантов ширины для удовлетворения различных потребностей",
  "Material: Steel, Stainless, Aluminum, Brass": "Материал: сталь, нержавеющая сталь, алюминий, латунь",
  "Accuracy: ±0.01mm (CNC), ±0.1mm (Standard)": "Точность: ±0,01 мм (ЧПУ), ±0,1 мм (стандарт)",
  "Control System": "Система управления",
  "NC Controller: Advanced digital": "Контроллер ЧПУ: усовершенствованный цифровой",
  "Back Gauge: Motorized ball screw": "Задний упор: моторизованный шариковый винт",
  "Stroke Counter: Digital display": "Счетчик ходов: цифровой дисплей",
  "Programming: Cut length adjustment": "Программирование: регулировка длины обрезки.",
  "Key Features": "Ключевые особенности",
  "Vertical blade mechanism": "Механизм вертикального лезвия",
  "CNC/NC hydraulic drive system": "Система гидравлического привода с ЧПУ/NC",
  "Adjustable cutting angle capability": "Возможность регулировки угла резки",
  "Multi-step programming (CNC)": "Многошаговое программирование (ЧПУ)",
  "Why Choose Our Guillotine Shearing Machine?": "Почему стоит выбрать нашу гильотинную стригальную машину?",
  "Discover the key advantages that make our hydraulic guillotine shearing machine the preferred choice for sheet metal processing": "Откройте для себя ключевые преимущества, которые делают наши гидравлические гильотинные ножницы предпочтительным выбором для обработки листового металла.",
  "Superior Precision": "Превосходная точность",
  "CNC models achieve cutting accuracy up to ±0.01mm with minimal distortion for demanding applications": "Модели с ЧПУ обеспечивают точность резки до ±0,01 мм с минимальными искажениями для требовательных применений.",
  "Minimal Material Waste": "Минимальные отходы материала",
  "Straight vertical cutting action produces virtually no material loss, maximizing efficiency and reducing costs": "Прямолинейная вертикальная резка практически не приводит к потерям материала, что повышает эффективность и снижает затраты.",
  "Heavy-Duty Capacity": "Тяжелая мощность",
  "Capable of cutting thick materials in various metals including steel, stainless steel, aluminum, and brass with reliable performance": "Способен резать толстые материалы из различных металлов, включая сталь, нержавеющую сталь, алюминий и латунь, с надежной производительностью.",
  "Versatile Operation": "Универсальная работа",
  "Adjustable cutting angles and multi-step programming enhance flexibility for diverse cutting requirements": "Регулируемые углы резания и многоэтапное программирование повышают гибкость при выполнении разнообразных требований к резке.",
  "Enhanced Safety": "Повышенная безопасность",
  "Operator stands clear of cutting zone with comprehensive guards, light curtains, and emergency stop systems": "Оператор находится вдали от зоны резки благодаря комплексным ограждениям, световым завесам и системам аварийной остановки.",
  "Cost-Effective": "Экономичный",
  "Affordable investment with low operating costs and long-term reliability for businesses of all sizes": "Доступные инвестиции с низкими эксплуатационными расходами и долгосрочной надежностью для предприятий любого размера.",
  "Components": "Компоненты",
  "Better understand the machine performance through detailed component descriptions and technical features": "Лучшее понимание производительности машины благодаря подробным описаниям компонентов и техническим характеристикам.",
  "Frame Structure": "Структура рамы",
  "The machine frame is constructed from heavy-duty welded steel with reinforced structure design. The robust vertical blade frame provides exceptional rigidity and stability, ensuring precise straight cuts and long-term accuracy even under continuous heavy-duty operation.": "Рама машины изготовлена ​​из прочной сварной стали с усиленной конструкцией. ",
  "Controller": "Контроллер",
  "Estun E21s, E200PS and Delem DAC310T controller can be used": "Можно использовать контроллер Estun E21s, E200PS и Delem DAC310T.",
  "Hydraulic System": "Гидравлическая система",
  "Equipped with high-quality hydraulic components, the system provides stable and reliable cutting force. The hydraulic drive ensures smooth operation with low noise levels and excellent energy efficiency. Built-in oil cooling system maintains optimal operating temperature.": "Система, оснащенная высококачественными гидравлическими компонентами, обеспечивает стабильную и надежную силу резания. ",
  "NC Back Gauge System": "Система заднего упора с ЧПУ",
  "The motorized ball screw back gauge provides precise positioning with extended travel distance options. NC controller allows for programmable movements and automatic positioning, significantly improving efficiency and accuracy for repetitive cutting operations.": "Задний упор с шарико-винтовой передачей с электроприводом обеспечивает точное позиционирование с возможностью увеличения расстояния перемещения. ",
  "Blade System": "Блейд-система",
  "High-quality tool steel blades with four usable cutting edges provide long service life and consistent cutting quality. Manual single-point blade gap adjustment allows for optimization based on material thickness, ensuring clean cuts with minimal burr formation.": "Лезвия из высококачественной инструментальной стали с четырьмя полезными режущими кромками обеспечивают длительный срок службы и стабильное качество резки. ",
  "Electrical System": "Электрическая система",
  "The electrical system features high-quality components from renowned brands, ensuring reliable operation and long service life. The system includes industrial-grade motors, precision contactors, thermal overload protection, and an intuitive control panel. All electrical components are housed in a protective enclosure that meets international safety standards, providing stable and safe operation for the machine.": "Электрическая система оснащена высококачественными компонентами известных брендов, обеспечивающими надежную работу и длительный срок службы. ",
  "Watch Our Machine in Action": "Посмотрите нашу машину в действии",
  "See the precision and efficiency of our hydraulic guillotine shearing machine": "Убедитесь в точности и эффективности наших гидравлических гильотинных ножниц.",
  "Applications": "Приложения",
  "Our guillotine shearing machines are widely used across various industries for precision metal cutting": "Наши гильотинные ножницы широко используются в различных отраслях промышленности для точной резки металла.",
  "Sheet Metal Fabrication": "Изготовление листового металла",
  "Precision cutting of steel, stainless steel, and aluminum sheets for various fabrication needs": "Точная резка листов стали, нержавеющей стали и алюминия для различных производственных нужд.",
  "Automotive Industry": "Автомобильная промышленность",
  "Manufacturing of body panels, brackets, and structural components with clean edges": "Изготовление панелей кузова, кронштейнов и конструктивных элементов с чистыми краями.",
  "Construction": "Строительство",
  "Cutting metal sheets for roofing, siding, and structural steel components": "Резка металлических листов для кровли, сайдинга и компонентов из конструкционной стали.",
  "HVAC Manufacturing": "Производство систем отопления, вентиляции и кондиционирования воздуха",
  "Processing ductwork, ventilation panels, and air conditioning components": "Обработка воздуховодов, вентиляционных панелей и компонентов кондиционирования воздуха",
  "Electronics Enclosures": "Корпуса для электроники",
  "Manufacturing cabinet panels, server racks, and control panel housings": "Производство шкафных панелей, серверных стоек и корпусов панелей управления.",
  "Machinery Manufacturing": "Машиностроение",
  "Cutting metal parts for industrial equipment, machine guards, and custom components": "Резка металлических деталей промышленного оборудования, ограждений машин и нестандартных компонентов.",
  "Furniture Industry": "Мебельная промышленность",
  "Processing metal furniture components, cabinets, and decorative panels": "Обработка металлических деталей мебели, шкафов и декоративных панелей.",
  "Shipbuilding": "Судостроение",
  "Cutting steel plates for hull construction, bulkheads, and marine structures": "Резка стальных листов для изготовления корпусов, переборок и морских конструкций.",
  "Standard & Optional Configuration": "Стандартная и дополнительная конфигурация",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Настройте свою машину с помощью стандартных функций и дополнительных обновлений в соответствии с вашими конкретными требованиями.",
  "Standard Configuration": "Стандартная конфигурация",
  "Optional Upgrades": "Дополнительные обновления",
  "Need help choosing the right configuration?": "Нужна помощь в выборе правильной конфигурации?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about our hydraulic guillotine shearing machines": "Распространенные вопросы о наших гидравлических гильотинных ножницах",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and the ability to cut thicker materials. They produce minimal material waste and are ideal for applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller footprint, and are better suited for thinner materials.": "Гильотинные ножницы используют вертикальное движение лезвия, которое опускается прямо вниз, обеспечивая более высокую точность и возможность резать более толстые материалы. ",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel, aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and machine model. Please contact us for specific capacity options for your application.": "Наши гильотинные ножницы могут обрабатывать различные металлические материалы, включая мягкую сталь, нержавеющую сталь, алюминий, медь, латунь и другие металлические листы. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life. Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions, blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Лезвия имеют четыре полезные режущие кромки, что значительно продлевает срок их службы. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting. Training materials and operation manuals are also provided.": "Да, мы обеспечиваем комплексное обучение операторов в рамках наших услуг по установке. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your order and keep you updated throughout the manufacturing process.": "Стандартные конфигурации обычно доставляются в течение 30–45 дней с момента подтверждения заказа. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "Регулярное техническое обслуживание простое и понятное: еженедельно проверяйте уровень гидравлического масла, ежедневно очищайте машину, смазывайте движущиеся части в соответствии с графиком и регулярно проверяйте состояние ножей. ",
  "Still have questions?": "Остались вопросы?",
  "Download Technical Brochure": "Загрузить техническую брошюру",
  "Get detailed technical specifications, dimensions, and performance data for our hydraulic guillotine shearing machines. Download our comprehensive product brochure in PDF format.": "Получите подробные технические характеристики, размеры и характеристики наших гидравлических гильотинных ножниц. "
}