{
  "CNC Hydraulic Guillotine Shearing Machine": "CNC油圧ギロチンシャーリングマシン",
  "Featuring precision vertical blade motion and advanced CNC control, our hydraulic guillotine shearing machine delivers exceptional cutting accuracy with minimal material waste and superior edge quality for various sheet metal applications.": "精密な垂直ブレード動作と高度な CNC 制御を特徴とする当社の油圧ギロチンシャーリングマシンは、材料の無駄を最小限に抑えながら優れた切断精度と、さまざまな板金用途に優れた刃先品質を提供します。",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "Advanced hydraulic guillotine shearing machine with NC control and precision cutting": "NC制御と精密切断を備えた先進の油圧ギロチンシャーリングマシン",
  "Cutting Capacity": "切断能力",
  "Available in various capacity ranges": "さまざまな容量範囲で利用可能",
  "Multiple width options to suit different needs": "さまざまなニーズに合わせた複数の幅オプション",
  "Material: Steel, Stainless, Aluminum, Brass": "材質：スチール、ステンレス、アルミニウム、真鍮",
  "Accuracy: ±0.01mm (CNC), ±0.1mm (Standard)": "精度：±0.01mm（CNC）、±0.1mm（標準）",
  "Control System": "制御システム",
  "NC Controller: Advanced digital": "NCコントローラ：アドバンストデジタル",
  "Back Gauge: Motorized ball screw": "バックゲージ：電動ボールネジ",
  "Stroke Counter: Digital display": "ストロークカウンター：デジタル表示",
  "Programming: Cut length adjustment": "プログラミング：カット長さ調整",
  "Key Features": "主な特長",
  "Vertical blade mechanism": "垂直刃機構",
  "CNC/NC hydraulic drive system": "CNC/NC油圧駆動システム",
  "Adjustable cutting angle capability": "調整可能な切断角度機能",
  "Multi-step programming (CNC)": "マルチステッププログラミング(CNC)",
  "Why Choose Our Guillotine Shearing Machine?": "当社のギロチンシャーリングマシンを選ぶ理由",
  "Discover the key advantages that make our hydraulic guillotine shearing machine the preferred choice for sheet metal processing": "当社の油圧ギロチンシャーリングマシンが板金加工に最適な選択肢となる主な利点をご覧ください。",
  "Superior Precision": "優れた精度",
  "CNC models achieve cutting accuracy up to ±0.01mm with minimal distortion for demanding applications": "CNC モデルは、要求の厳しい用途向けに歪みを最小限に抑えながら、最大 ±0.01 mm の切断精度を実現します。",
  "Minimal Material Waste": "材料の無駄を最小限に抑える",
  "Straight vertical cutting action produces virtually no material loss, maximizing efficiency and reducing costs": "まっすぐな垂直切断動作により、実質的に材料の損失が発生せず、効率が最大化され、コストが削減されます。",
  "Heavy-Duty Capacity": "耐久性の高い容量",
  "Capable of cutting thick materials in various metals including steel, stainless steel, aluminum, and brass with reliable performance": "鋼、ステンレス、アルミ、真鍮などの各種金属の厚物も確実に切断できます。",
  "Versatile Operation": "多彩な操作性",
  "Adjustable cutting angles and multi-step programming enhance flexibility for diverse cutting requirements": "調整可能な切断角度とマルチステッププログラミングにより、多様な切断要件に対する柔軟性が向上します",
  "Enhanced Safety": "安全性の強化",
  "Operator stands clear of cutting zone with comprehensive guards, light curtains, and emergency stop systems": "オペレーターは、包括的なガード、ライトカーテン、緊急停止システムにより切断ゾーンから離れた位置に立っています。",
  "Cost-Effective": "費用対効果が高い",
  "Affordable investment with low operating costs and long-term reliability for businesses of all sizes": "あらゆる規模の企業にとって、低い運用コストと長期的な信頼性を備えた手頃な投資",
  "Components": "コンポーネント",
  "Better understand the machine performance through detailed component descriptions and technical features": "コンポーネントの詳細な説明と技術的特徴を通じて、マシンのパフォーマンスをより深く理解できます。",
  "Frame Structure": "フレーム構造",
  "The machine frame is constructed from heavy-duty welded steel with reinforced structure design. The robust vertical blade frame provides exceptional rigidity and stability, ensuring precise straight cuts and long-term accuracy even under continuous heavy-duty operation.": "機械フレームは強化構造設計の頑丈な溶接鋼で作られています。",
  "Controller": "コントローラ",
  "Estun E21s, E200PS and Delem DAC310T controller can be used": "Estun E21s、E200PS、Delem DAC310T コントローラーが使用可能",
  "Hydraulic System": "油圧システム",
  "Equipped with high-quality hydraulic components, the system provides stable and reliable cutting force. The hydraulic drive ensures smooth operation with low noise levels and excellent energy efficiency. Built-in oil cooling system maintains optimal operating temperature.": "高品質の油圧コンポーネントを搭載し、安定した信頼性の高い切削力を提供します。",
  "NC Back Gauge System": "NCバックゲージシステム",
  "The motorized ball screw back gauge provides precise positioning with extended travel distance options. NC controller allows for programmable movements and automatic positioning, significantly improving efficiency and accuracy for repetitive cutting operations.": "電動ボールネジバックゲージは、移動距離のオプションを拡張して正確な位置決めを実現します。 ",
  "Blade System": "ブレードシステム",
  "High-quality tool steel blades with four usable cutting edges provide long service life and consistent cutting quality. Manual single-point blade gap adjustment allows for optimization based on material thickness, ensuring clean cuts with minimal burr formation.": "4 つの使用可能な切れ刃を備えた高品質工具鋼ブレードにより、長い耐用年数と安定した切断品質が実現します。",
  "Electrical System": "電気系統",
  "The electrical system features high-quality components from renowned brands, ensuring reliable operation and long service life. The system includes industrial-grade motors, precision contactors, thermal overload protection, and an intuitive control panel. All electrical components are housed in a protective enclosure that meets international safety standards, providing stable and safe operation for the machine.": "電気システムには有名ブランドの高品質コンポーネントが採用されており、信頼性の高い動作と長い耐用年数を保証します。",
  "Watch Our Machine in Action": "機械の動作をご覧ください",
  "See the precision and efficiency of our hydraulic guillotine shearing machine": "当社の油圧ギロチンシャーリングマシンの精度と効率をご覧ください。",
  "Applications": "アプリケーション",
  "Our guillotine shearing machines are widely used across various industries for precision metal cutting": "当社のギロチンシャーリングマシンは、精密金属切断用としてさまざまな業界で広く使用されています。",
  "Sheet Metal Fabrication": "板金加工",
  "Precision cutting of steel, stainless steel, and aluminum sheets for various fabrication needs": "さまざまな製造ニーズに対応する鋼、ステンレス鋼、アルミニウムのシートの精密切断",
  "Automotive Industry": "自動車産業",
  "Manufacturing of body panels, brackets, and structural components with clean edges": "きれいなエッジを備えたボディパネル、ブラケット、構造コンポーネントの製造",
  "Construction": "工事",
  "Cutting metal sheets for roofing, siding, and structural steel components": "屋根材、外壁材、構造用鋼材などの金属板の切断",
  "HVAC Manufacturing": "HVAC 製造",
  "Processing ductwork, ventilation panels, and air conditioning components": "ダクト、換気パネル、空調部品の加工",
  "Electronics Enclosures": "電子機器の筐体",
  "Manufacturing cabinet panels, server racks, and control panel housings": "キャビネットパネル、サーバーラック、制御盤筐体の製造",
  "Machinery Manufacturing": "機械製造業",
  "Cutting metal parts for industrial equipment, machine guards, and custom components": "産業機器、マシンガード、カスタムコンポーネント用の金属部品の切断",
  "Furniture Industry": "家具産業",
  "Processing metal furniture components, cabinets, and decorative panels": "金属製家具部品、キャビネット、化粧パネルの加工",
  "Shipbuilding": "造船",
  "Cutting steel plates for hull construction, bulkheads, and marine structures": "船体構造用、隔壁用、海洋構造物用鋼板の切断",
  "Standard & Optional Configuration": "標準およびオプションの構成",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "標準機能とオプションのアップグレードを使用してマシンをカスタマイズし、特定の要件を満たすことができます",
  "Standard Configuration": "標準構成",
  "Optional Upgrades": "オプションのアップグレード",
  "Need help choosing the right configuration?": "適切な構成を選択するのにサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about our hydraulic guillotine shearing machines": "油圧ギロチンシャーリングに関するよくある質問",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and the ability to cut thicker materials. They produce minimal material waste and are ideal for applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller footprint, and are better suited for thinner materials.": "ギロチンはさみは、まっすぐ下に降りる垂直の刃の動きを使用するため、より高い精度と厚い材料の切断能力を実現します。",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel, aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and machine model. Please contact us for specific capacity options for your application.": "当社のギロチンシャーリングは、軟鋼、ステンレス鋼、アルミニウム、銅、真鍮などの金属板を含むさまざまな金属材料を加工できます。",
  "The blades are designed with four usable cutting edges, which significantly extends their service life. Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions, blades can last for tens of thousands of cuts before requiring rotation or replacement.": "ブレードは 4 つの使用可能な刃先を備えて設計されており、耐用年数が大幅に延長されます。",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting. Training materials and operation manuals are also provided.": "はい、設置サービスの一環として、包括的なオペレータートレーニングを提供しています。",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your order and keep you updated throughout the manufacturing process.": "標準構成は通常、注文確認から 30 ～ 45 日以内に発送されます。",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "定期的なメンテナンスはシンプルで簡単です。作動油レベルを毎週チェックし、機械を毎日清掃し、スケジュールに従って可動部品に注油し、ブレードの状態を定期的に検査します。",
  "Still have questions?": "まだ質問がありますか?",
  "Download Technical Brochure": "技術パンフレットをダウンロード",
  "Get detailed technical specifications, dimensions, and performance data for our hydraulic guillotine shearing machines. Download our comprehensive product brochure in PDF format.": "当社の油圧ギロチンシャーリングマシンの詳細な技術仕様、寸法、性能データをご覧ください。"
}