{
  "Hydraulic Swing Beam Shearing Machine": "Cisaille hydraulique à poutre pivotante",
  "Featuring an innovative swinging blade design with arc-shaped cutting motion, our hydraulic swing beam shearing machine delivers efficient and precise sheet metal cutting with a compact footprint and exceptional stability.": "Dotée d'une conception innovante de lame oscillante avec un mouvement de coupe en forme d'arc, notre cisaille hydraulique à poutre oscillante offre une coupe de tôle efficace et précise avec un encombrement compact et une stabilité exceptionnelle.",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "Advanced hydraulic swing beam shearing machine with NC control and precision cutting": "Cisaille hydraulique avancée à poutre pivotante avec commande NC et coupe de précision",
  "Cutting Capacity": "Capacité de coupe",
  "Available in various capacity ranges": "Disponible dans différentes gammes de capacités",
  "Multiple width options to suit different needs": "Plusieurs options de largeur pour répondre à différents besoins",
  "Material: Steel, Stainless, Aluminum": "Matériau : acier, inoxydable, aluminium.",
  "Cutting Angle: Straight cuts with precision": "Angle de coupe : coupes droites avec précision",
  "Control System": "Système de contrôle",
  "NC Controller: Advanced digital": "Contrôleur NC : numérique avancé",
  "Back Gauge: Motorized ball screw": "Jauge arrière : Vis à billes motorisée",
  "Stroke Counter: Digital display": "Compteur de coups : affichage numérique",
  "Programming: Cut length adjustment": "Programmation : Réglage de la longueur de coupe",
  "Key Features": "Principales fonctionnalités",
  "Swinging blade mechanism": "Mécanisme à lame oscillante",
  "Hydraulic drive system": "Système d'entraînement hydraulique",
  "Adjustable blade gap": "Écart de lame réglable",
  "Front protection system": "Système de protection avant",
  "Why Choose Our Swing Beam Shearing Machine?": "Pourquoi choisir notre cisaille à poutre pivotante ?",
  "Discover the key advantages that make our hydraulic swing beam shearing machine the preferred choice for sheet metal processing": "Découvrez les principaux avantages qui font de notre cisaille hydraulique à poutre pivotante le choix privilégié pour le traitement de la tôle.",
  "High Efficiency": "Haute efficacité",
  "Fast working speed and smooth cutting action ensure maximum productivity with minimal downtime": "Une vitesse de travail rapide et une action de coupe fluide garantissent une productivité maximale avec un temps d'arrêt minimal",
  "Simple Operation": "Opération simple",
  "Intuitive controls and straightforward setup reduce training time and make operation easy for all skill levels": "Des commandes intuitives et une configuration simple réduisent le temps de formation et facilitent l'utilisation pour tous les niveaux de compétence.",
  "Excellent Stability": "Excellente stabilité",
  "Swing arm design provides superior stability during cutting operations, ensuring consistent quality": "La conception du bras oscillant offre une stabilité supérieure pendant les opérations de coupe, garantissant une qualité constante",
  "Compact Footprint": "Encombrement compact",
  "Space-saving design ideal for facilities with limited floor space while maintaining full functionality": "Conception peu encombrante, idéale pour les installations avec un espace au sol limité tout en conservant toutes les fonctionnalités",
  "Safety Features": "Caractéristiques de sécurité",
  "Comprehensive safety systems including guards and emergency stops ensure operator protection": "Des systèmes de sécurité complets comprenant des protections et des arrêts d'urgence assurent la protection de l'opérateur",
  "Cost-Effective": "Rentable",
  "Economical solution for cutting thin to medium thickness materials with excellent performance-to-price ratio": "Solution économique pour couper des matériaux d'épaisseur fine à moyenne avec un excellent rapport performance/prix",
  "Components": "Composants",
  "Better understand the machine performance through detailed component descriptions and technical features": "Mieux comprendre les performances de la machine grâce à des descriptions détaillées des composants et des caractéristiques techniques",
  "Frame Structure": "Structure du cadre",
  "The machine frame is constructed from high-quality steel with a welded structure design. The compact and simple pendulum arm mechanism provides excellent rigidity and stability, ensuring straight and accurate cuts throughout the machine's operational life.": "Le châssis de la machine est construit en acier de haute qualité avec une structure soudée. ",
  "Swing Beam Mechanism": "Mécanisme de poutre pivotante",
  "The innovative swinging blade design creates an arc-shaped cutting motion that ensures material straightness and clean cuts. This mechanism provides fast working speed with good stability, ideal for processing thin to medium thickness materials efficiently.": "La conception innovante de la lame oscillante crée un mouvement de coupe en forme d'arc qui garantit la rectitude du matériau et des coupes nettes. ",
  "Hydraulic System": "Système hydraulique",
  "Equipped with high-quality hydraulic components, the system provides stable and reliable cutting force. The hydraulic drive ensures smooth operation with low noise levels and excellent energy efficiency. Built-in oil cooling system maintains optimal operating temperature.": "Équipé de composants hydrauliques de haute qualité, le système fournit une force de coupe stable et fiable. ",
  "NC Back Gauge System": "Système de jauge arrière NC",
  "The motorized ball screw back gauge provides precise positioning with extended travel distance options. NC controller allows for programmable movements and automatic positioning, significantly improving efficiency and accuracy for repetitive cutting operations.": "La butée arrière à vis à billes motorisée offre un positionnement précis avec des options de distance de déplacement étendues. ",
  "Blade System": "Système de lame",
  "High-quality tool steel blades with four usable cutting edges provide long service life and consistent cutting quality. Manual single-point blade gap adjustment allows for optimization based on material thickness, ensuring clean cuts with minimal burr formation.": "Les lames en acier à outils de haute qualité avec quatre tranchants utilisables offrent une longue durée de vie et une qualité de coupe constante. ",
  "Watch Our Machine in Action": "Regardez notre machine en action",
  "See the precision and efficiency of our hydraulic swing beam shearing machine": "Découvrez la précision et l’efficacité de notre cisaille hydraulique à poutre pivotante",
  "Applications": "Applications",
  "Our swing beam shearing machines are widely used across various industries for precision metal cutting": "Nos cisailles à poutre pivotante sont largement utilisées dans diverses industries pour la coupe de précision des métaux.",
  "Sheet Metal Fabrication": "Fabrication de tôles",
  "Precision cutting of steel, stainless steel, and aluminum sheets for various fabrication needs": "Découpe de précision de tôles d'acier, d'acier inoxydable et d'aluminium pour divers besoins de fabrication",
  "Automotive Industry": "Industrie automobile",
  "Manufacturing of body panels, brackets, and structural components with clean edges": "Fabrication de panneaux de carrosserie, de supports et de composants structurels aux bords nets",
  "Construction": "Construction",
  "Cutting metal sheets for roofing, siding, and structural steel components": "Découpe de tôles pour les composants de toiture, de bardage et de construction en acier",
  "HVAC Manufacturing": "Fabrication de CVC",
  "Processing ductwork, ventilation panels, and air conditioning components": "Traitement des conduits, des panneaux de ventilation et des composants de climatisation",
  "Electronics Enclosures": "Boîtiers électroniques",
  "Manufacturing cabinet panels, server racks, and control panel housings": "Fabrication de panneaux d'armoires, de racks de serveurs et de boîtiers de panneaux de commande",
  "Machinery Manufacturing": "Fabrication de machines",
  "Cutting metal parts for industrial equipment, machine guards, and custom components": "Découpe de pièces métalliques pour équipements industriels, protections de machines et composants personnalisés",
  "Furniture Industry": "Industrie du meuble",
  "Processing metal furniture components, cabinets, and decorative panels": "Traitement de composants de meubles, d'armoires et de panneaux décoratifs en métal",
  "Shipbuilding": "Construction navale",
  "Cutting steel plates for hull construction, bulkheads, and marine structures": "Découpe de plaques d'acier pour la construction de coques, de cloisons et de structures marines",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personnalisez votre machine avec des fonctionnalités standard et des mises à niveau facultatives pour répondre à vos besoins spécifiques",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need help choosing the right configuration?": "Besoin d'aide pour choisir la bonne configuration ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our hydraulic swing beam shearing machines": "Questions courantes sur nos cisailles hydrauliques à poutre pivotante",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials. Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher precision.": "Les cisailles à poutre pivotante utilisent une conception de bras pendulaire avec un mouvement de coupe en forme d'arc, offrant des avantages tels qu'un encombrement réduit, une bonne stabilité et une vitesse de travail rapide. ",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel, aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and machine model. Please contact us for specific capacity options for your application.": "Nos cisailles à poutre pivotante peuvent traiter divers matériaux métalliques, notamment l'acier doux, l'acier inoxydable, l'aluminium, les plaques de cuivre et d'autres tôles métalliques. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life. Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions, blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Les lames sont conçues avec quatre tranchants utilisables, ce qui prolonge considérablement leur durée de vie. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting. Training materials and operation manuals are also provided.": "Oui, nous proposons une formation complète des opérateurs dans le cadre de notre service d’installation. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your order and keep you updated throughout the manufacturing process.": "Les configurations standard sont généralement expédiées dans les 30 à 45 jours suivant la confirmation de la commande. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "L'entretien régulier est simple et direct : vérifiez les niveaux d'huile hydraulique chaque semaine, nettoyez la machine quotidiennement, lubrifiez les pièces mobiles selon le calendrier et inspectez régulièrement l'état de la lame. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Get detailed technical specifications, dimensions, and performance data for our hydraulic swing beam shearing machines. Download our comprehensive product brochure in PDF format.": "Obtenez des spécifications techniques détaillées, des dimensions et des données de performances pour nos cisailles hydrauliques à poutre pivotante. "
}