{
  "Hydraulic Swing Beam Shearing Machine": "液压摆式剪板机",
  "Featuring an innovative swinging blade design with arc-shaped cutting motion, our hydraulic swing beam shearing machine delivers efficient and precise sheet metal cutting with a compact footprint and exceptional stability.": "我们的液压摆式剪板机采用创新的摆动刀片设计和弧形切割运动，可实现高效、精确的金属板材切割，占地面积紧凑，稳定性极佳。",
  "Request Quote": "请求报价",
  "Watch Video": "观看视频",
  "Technical Specifications": "技术规格",
  "Advanced hydraulic swing beam shearing machine with NC control and precision cutting": "先进的液压摆式剪板机，数控控制，精密剪切",
  "Cutting Capacity": "切割能力",
  "Available in various capacity ranges": "提供各种容量范围",
  "Multiple width options to suit different needs": "多种宽度选择，满足不同需求",
  "Material: Steel, Stainless, Aluminum": "材质：钢、不锈钢、铝",
  "Cutting Angle: Straight cuts with precision": "切割角度：直线切割，精确",
  "Control System": "控制系统",
  "NC Controller: Advanced digital": "NC控制器：先进的数字化",
  "Back Gauge: Motorized ball screw": "后挡料：电动滚珠丝杠",
  "Stroke Counter: Digital display": "行程计数器：数字显示",
  "Programming: Cut length adjustment": "编程：切割长度调整",
  "Key Features": "主要特点",
  "Swinging blade mechanism": "摆动刀片机构",
  "Hydraulic drive system": "液压驱动系统",
  "Adjustable blade gap": "刀片间隙可调",
  "Front protection system": "前部防护系统",
  "Why Choose Our Swing Beam Shearing Machine?": "为什么选择我们的摆式剪板机？",
  "Discover the key advantages that make our hydraulic swing beam shearing machine the preferred choice for sheet metal processing": "了解使我们的液压摆式剪板机成为钣金加工首选的关键优势",
  "High Efficiency": "高效率",
  "Fast working speed and smooth cutting action ensure maximum productivity with minimal downtime": "快速的工作速度和平稳的切割动作确保最大的生产率和最短的停机时间",
  "Simple Operation": "操作简单",
  "Intuitive controls and straightforward setup reduce training time and make operation easy for all skill levels": "直观的控制和简单的设置减少了培训时间，并使所有技能水平的操作都变得简单",
  "Excellent Stability": "优异的稳定性",
  "Swing arm design provides superior stability during cutting operations, ensuring consistent quality": "摇臂设计在切割操作过程中提供卓越的稳定性，确保质量稳定",
  "Compact Footprint": "占地面积紧凑",
  "Space-saving design ideal for facilities with limited floor space while maintaining full functionality": "节省空间的设计非常适合占地面积有限的设施，同时保持完整的功能",
  "Safety Features": "安全特性",
  "Comprehensive safety systems including guards and emergency stops ensure operator protection": "包括防护装置和紧急停止装置在内的综合安全系统可确保操作员受到保护",
  "Cost-Effective": "性价比高",
  "Economical solution for cutting thin to medium thickness materials with excellent performance-to-price ratio": "用于切割薄到中等厚度材料的经济解决方案，具有出色的性价比",
  "Components": "成分",
  "Better understand the machine performance through detailed component descriptions and technical features": "通过详细的部件描述和技术特点更好地了解机器性能",
  "Frame Structure": "框架结构",
  "The machine frame is constructed from high-quality steel with a welded structure design. The compact and simple pendulum arm mechanism provides excellent rigidity and stability, ensuring straight and accurate cuts throughout the machine's operational life.": "机架采用优质钢材制成，采用焊接结构设计。",
  "Swing Beam Mechanism": "摆梁机构",
  "The innovative swinging blade design creates an arc-shaped cutting motion that ensures material straightness and clean cuts. This mechanism provides fast working speed with good stability, ideal for processing thin to medium thickness materials efficiently.": "创新的摆动刀片设计产生弧形切割运动，确保材料直线度和干净的切割。",
  "Hydraulic System": "液压系统",
  "Equipped with high-quality hydraulic components, the system provides stable and reliable cutting force. The hydraulic drive ensures smooth operation with low noise levels and excellent energy efficiency. Built-in oil cooling system maintains optimal operating temperature.": "系统配备优质液压元件，提供稳定可靠的切削力。",
  "NC Back Gauge System": "数控后挡料系统",
  "The motorized ball screw back gauge provides precise positioning with extended travel distance options. NC controller allows for programmable movements and automatic positioning, significantly improving efficiency and accuracy for repetitive cutting operations.": "电动滚珠丝杠后挡料可提供精确定位和延长行程距离选项。 ",
  "Blade System": "刀片系统",
  "High-quality tool steel blades with four usable cutting edges provide long service life and consistent cutting quality. Manual single-point blade gap adjustment allows for optimization based on material thickness, ensuring clean cuts with minimal burr formation.": "高品质工具钢刀片具有四个可用切削刃，可提供较长的使用寿命和一致的切削质量。",
  "Watch Our Machine in Action": "观看我们的机器运行情况",
  "See the precision and efficiency of our hydraulic swing beam shearing machine": "了解我们的液压摆式剪板机的精度和效率",
  "Applications": "应用领域",
  "Our swing beam shearing machines are widely used across various industries for precision metal cutting": "我们的摆式剪板机广泛应用于各个行业的精密金属切割",
  "Sheet Metal Fabrication": "钣金加工",
  "Precision cutting of steel, stainless steel, and aluminum sheets for various fabrication needs": "精密切割钢、不锈钢和铝板，满足各种制造需求",
  "Automotive Industry": "汽车行业",
  "Manufacturing of body panels, brackets, and structural components with clean edges": "制造边缘干净的车身面板、支架和结构部件",
  "Construction": "建造",
  "Cutting metal sheets for roofing, siding, and structural steel components": "切割屋顶、壁板和钢结构部件的金属板",
  "HVAC Manufacturing": "暖通空调制造",
  "Processing ductwork, ventilation panels, and air conditioning components": "加工管道系统、通风板和空调部件",
  "Electronics Enclosures": "电子产品外壳",
  "Manufacturing cabinet panels, server racks, and control panel housings": "制造机柜面板、服务器机架和控制面板外壳",
  "Machinery Manufacturing": "机械制造",
  "Cutting metal parts for industrial equipment, machine guards, and custom components": "切割工业设备、机器防护罩和定制部件的金属零件",
  "Furniture Industry": "家具行业",
  "Processing metal furniture components, cabinets, and decorative panels": "加工金属家具部件、橱柜和装饰面板",
  "Shipbuilding": "造船",
  "Cutting steel plates for hull construction, bulkheads, and marine structures": "切割用于船体结构、舱壁和海洋结构的钢板",
  "Standard & Optional Configuration": "标准及可选配置",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "通过标准功能和可选升级来定制您的机器，以满足您的特定要求",
  "Standard Configuration": "标准配置",
  "Optional Upgrades": "可选升级",
  "Need help choosing the right configuration?": "需要帮助选择正确的配置吗？",
  "Frequently Asked Questions": "常见问题解答",
  "Common questions about our hydraulic swing beam shearing machines": "有关我们的液压摆式剪板机的常见问题",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials. Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher precision.": "摆式剪板机采用摆臂设计，剪切运动为圆弧形，具有占地面积小、稳定性好、工作速度快等优点。",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel, aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and machine model. Please contact us for specific capacity options for your application.": "我们的摆式剪板机可以加工各种金属材料，包括低碳钢、不锈钢、铝板、铜板和其他金属板材。",
  "The blades are designed with four usable cutting edges, which significantly extends their service life. Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions, blades can last for tens of thousands of cuts before requiring rotation or replacement.": "刀片设计有四个可用切削刃，可显着延长其使用寿命。",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting. Training materials and operation manuals are also provided.": "是的，作为安装服务的一部分，我们提供全面的操作员培训。",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your order and keep you updated throughout the manufacturing process.": "标准配置通常在订单确认后 30-45 天内发货。",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "定期维护简单明了：每周检查液压油油位，每天清洁机器，根据时间表润滑运动部件，并定期检查刀片状况。",
  "Still have questions?": "还有疑问吗？",
  "Download Technical Brochure": "下载技术手册",
  "Get detailed technical specifications, dimensions, and performance data for our hydraulic swing beam shearing machines. Download our comprehensive product brochure in PDF format.": "获取我们的液压摆式剪板机的详细技术规格、尺寸和性能数据。"
}