{
  "Hydraulic Swing Beam Shearing Machine": "Hydraulische Schwenkbalkenschermaschine",
  "Featuring an innovative swinging blade design with arc-shaped cutting motion, our hydraulic swing beam shearing machine delivers efficient and precise sheet metal cutting with a compact footprint and exceptional stability.": "Unsere hydraulische Schwenkbalkenschere verfügt über ein innovatives Schwingmesserdesign mit bogenförmiger Schneidbewegung und ermöglicht effizientes und präzises Blechschneiden bei kompakter Stellfläche und außergewöhnlicher Stabilität.",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "Advanced hydraulic swing beam shearing machine with NC control and precision cutting": "Fortschrittliche hydraulische Schwenkbalkenschere mit NC-Steuerung und Präzisionsschnitt",
  "Cutting Capacity": "Schnittkapazität",
  "Available in various capacity ranges": "Erhältlich in verschiedenen Kapazitätsbereichen",
  "Multiple width options to suit different needs": "Mehrere Breitenoptionen für unterschiedliche Anforderungen",
  "Material: Steel, Stainless, Aluminum": "Material: Stahl, Edelstahl, Aluminium",
  "Cutting Angle: Straight cuts with precision": "Schnittwinkel: Gerade Schnitte mit Präzision",
  "Control System": "Kontrollsystem",
  "NC Controller: Advanced digital": "NC-Controller: Fortschrittlich digital",
  "Back Gauge: Motorized ball screw": "Hinteranschlag: Motorisierte Kugelumlaufspindel",
  "Stroke Counter: Digital display": "Hubzähler: Digitalanzeige",
  "Programming: Cut length adjustment": "Programmierung: Schnittlängenanpassung",
  "Key Features": "Hauptmerkmale",
  "Swinging blade mechanism": "Mechanismus mit schwingender Klinge",
  "Hydraulic drive system": "Hydraulisches Antriebssystem",
  "Adjustable blade gap": "Einstellbarer Klingenspalt",
  "Front protection system": "Frontschutzsystem",
  "Why Choose Our Swing Beam Shearing Machine?": "Warum sollten Sie sich für unsere Schwenkbalkenschermaschine entscheiden?",
  "Discover the key advantages that make our hydraulic swing beam shearing machine the preferred choice for sheet metal processing": "Entdecken Sie die entscheidenden Vorteile, die unsere hydraulische Schwenkbalkenschere zur bevorzugten Wahl für die Blechbearbeitung machen",
  "High Efficiency": "Hohe Effizienz",
  "Fast working speed and smooth cutting action ensure maximum productivity with minimal downtime": "Schnelle Arbeitsgeschwindigkeit und gleichmäßiger Schneidvorgang sorgen für maximale Produktivität bei minimalen Ausfallzeiten",
  "Simple Operation": "Einfache Bedienung",
  "Intuitive controls and straightforward setup reduce training time and make operation easy for all skill levels": "Intuitive Bedienelemente und eine unkomplizierte Einrichtung verkürzen die Einarbeitungszeit und machen die Bedienung für alle Fähigkeitsstufen einfach",
  "Excellent Stability": "Ausgezeichnete Stabilität",
  "Swing arm design provides superior stability during cutting operations, ensuring consistent quality": "Das Design des Schwenkarms sorgt für hervorragende Stabilität beim Schneidvorgang und gewährleistet eine gleichbleibende Qualität",
  "Compact Footprint": "Kompakte Stellfläche",
  "Space-saving design ideal for facilities with limited floor space while maintaining full functionality": "Platzsparendes Design, ideal für Einrichtungen mit begrenzter Grundfläche bei voller Funktionalität",
  "Safety Features": "Sicherheitsfunktionen",
  "Comprehensive safety systems including guards and emergency stops ensure operator protection": "Umfassende Sicherheitssysteme einschließlich Schutzvorrichtungen und Notstopps gewährleisten den Schutz des Bedieners",
  "Cost-Effective": "Kostengünstig",
  "Economical solution for cutting thin to medium thickness materials with excellent performance-to-price ratio": "Wirtschaftliche Lösung zum Schneiden dünner bis mitteldicker Materialien mit hervorragendem Preis-Leistungs-Verhältnis",
  "Components": "Komponenten",
  "Better understand the machine performance through detailed component descriptions and technical features": "Verstehen Sie die Maschinenleistung besser durch detaillierte Komponentenbeschreibungen und technische Merkmale",
  "Frame Structure": "Rahmenstruktur",
  "The machine frame is constructed from high-quality steel with a welded structure design. The compact and simple pendulum arm mechanism provides excellent rigidity and stability, ensuring straight and accurate cuts throughout the machine's operational life.": "Der Maschinenrahmen besteht aus hochwertigem Stahl mit Schweißkonstruktion. ",
  "Swing Beam Mechanism": "Schwenkbalkenmechanismus",
  "The innovative swinging blade design creates an arc-shaped cutting motion that ensures material straightness and clean cuts. This mechanism provides fast working speed with good stability, ideal for processing thin to medium thickness materials efficiently.": "Das innovative Design der schwingenden Klinge erzeugt eine bogenförmige Schneidbewegung, die für Geradheit des Materials und saubere Schnitte sorgt. ",
  "Hydraulic System": "Hydrauliksystem",
  "Equipped with high-quality hydraulic components, the system provides stable and reliable cutting force. The hydraulic drive ensures smooth operation with low noise levels and excellent energy efficiency. Built-in oil cooling system maintains optimal operating temperature.": "Ausgestattet mit hochwertigen Hydraulikkomponenten sorgt das System für eine stabile und zuverlässige Schnittkraft. ",
  "NC Back Gauge System": "NC-Hinteranschlagsystem",
  "The motorized ball screw back gauge provides precise positioning with extended travel distance options. NC controller allows for programmable movements and automatic positioning, significantly improving efficiency and accuracy for repetitive cutting operations.": "Der motorisierte Hinteranschlag mit Kugelumlaufspindel ermöglicht eine präzise Positionierung mit erweiterten Verfahrwegoptionen. ",
  "Blade System": "Klingensystem",
  "High-quality tool steel blades with four usable cutting edges provide long service life and consistent cutting quality. Manual single-point blade gap adjustment allows for optimization based on material thickness, ensuring clean cuts with minimal burr formation.": "Hochwertige Werkzeugstahlklingen mit vier nutzbaren Schneiden sorgen für lange Standzeiten und gleichbleibende Schnittqualität. ",
  "Watch Our Machine in Action": "Sehen Sie unsere Maschine in Aktion",
  "See the precision and efficiency of our hydraulic swing beam shearing machine": "Erleben Sie die Präzision und Effizienz unserer hydraulischen Schwenkbalkenschere",
  "Applications": "Anwendungen",
  "Our swing beam shearing machines are widely used across various industries for precision metal cutting": "Unsere Schwenkbalken-Schneidemaschinen werden in verschiedenen Branchen zum Präzisionsschneiden von Metall eingesetzt",
  "Sheet Metal Fabrication": "Blechbearbeitung",
  "Precision cutting of steel, stainless steel, and aluminum sheets for various fabrication needs": "Präzisionsschneiden von Stahl-, Edelstahl- und Aluminiumblechen für verschiedene Fertigungsanforderungen",
  "Automotive Industry": "Automobilindustrie",
  "Manufacturing of body panels, brackets, and structural components with clean edges": "Herstellung von Karosserieteilen, Halterungen und Strukturbauteilen mit sauberen Kanten",
  "Construction": "Konstruktion",
  "Cutting metal sheets for roofing, siding, and structural steel components": "Schneiden von Blechen für Dächer, Fassadenverkleidungen und Stahlbauteile",
  "HVAC Manufacturing": "HVAC-Herstellung",
  "Processing ductwork, ventilation panels, and air conditioning components": "Bearbeitung von Rohrleitungen, Lüftungsplatten und Klimaanlagenkomponenten",
  "Electronics Enclosures": "Elektronikgehäuse",
  "Manufacturing cabinet panels, server racks, and control panel housings": "Herstellung von Schrankpaneelen, Serverracks und Schalttafelgehäusen",
  "Machinery Manufacturing": "Maschinenbau",
  "Cutting metal parts for industrial equipment, machine guards, and custom components": "Schneiden von Metallteilen für Industrieanlagen, Maschinenschutz und kundenspezifische Komponenten",
  "Furniture Industry": "Möbelindustrie",
  "Processing metal furniture components, cabinets, and decorative panels": "Bearbeitung von Möbelteilen, Schränken und Dekorplatten aus Metall",
  "Shipbuilding": "Schiffbau",
  "Cutting steel plates for hull construction, bulkheads, and marine structures": "Schneiden von Stahlplatten für Rumpfkonstruktionen, Schotte und Schiffskonstruktionen",
  "Standard & Optional Configuration": "Standard- und optionale Konfiguration",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Passen Sie Ihre Maschine mit Standardfunktionen und optionalen Upgrades an Ihre spezifischen Anforderungen an",
  "Standard Configuration": "Standardkonfiguration",
  "Optional Upgrades": "Optionale Upgrades",
  "Need help choosing the right configuration?": "Benötigen Sie Hilfe bei der Auswahl der richtigen Konfiguration?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about our hydraulic swing beam shearing machines": "Häufige Fragen zu unseren hydraulischen Schwenkbalkenscheren",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials. Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher precision.": "Schwenkbalkenscheren verwenden ein Pendelarmdesign mit einer bogenförmigen Schnittbewegung und bieten Vorteile wie einen geringeren Platzbedarf, gute Stabilität und eine schnelle Arbeitsgeschwindigkeit. ",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel, aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and machine model. Please contact us for specific capacity options for your application.": "Unsere Schwenkbalkenschermaschinen können verschiedene Metallmaterialien verarbeiten, darunter Baustahl, Edelstahl, Aluminium, Kupferplatten und andere Metallbleche. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life. Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions, blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Die Klingen sind mit vier nutzbaren Schneiden ausgestattet, was ihre Lebensdauer deutlich verlängert. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting. Training materials and operation manuals are also provided.": "Ja, im Rahmen unseres Installationsservice bieten wir eine umfassende Bedienerschulung an. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your order and keep you updated throughout the manufacturing process.": "Standardkonfigurationen werden in der Regel innerhalb von 30–45 Tagen nach Auftragsbestätigung versendet. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "Die regelmäßige Wartung ist einfach und unkompliziert: Überprüfen Sie wöchentlich den Hydraulikölstand, reinigen Sie die Maschine täglich, schmieren Sie bewegliche Teile gemäß dem Zeitplan und prüfen Sie regelmäßig den Zustand der Klinge. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Download Technical Brochure": "Laden Sie die technische Broschüre herunter",
  "Get detailed technical specifications, dimensions, and performance data for our hydraulic swing beam shearing machines. Download our comprehensive product brochure in PDF format.": "Erhalten Sie detaillierte technische Spezifikationen, Abmessungen und Leistungsdaten für unsere hydraulischen Schwenkbalkenscheren. "
}