{
  "Hydraulic Swing Beam Shearing Machine": "Cizalla hidráulica de viga oscilante",
  "Featuring an innovative swinging blade design with arc-shaped cutting motion, our hydraulic swing beam shearing machine delivers efficient and precise sheet metal cutting with a compact footprint and exceptional stability.": "Con un innovador diseño de hoja oscilante con movimiento de corte en forma de arco, nuestra máquina cizalla hidráulica con viga oscilante ofrece un corte de chapa metálica eficiente y preciso con un tamaño compacto y una estabilidad excepcional.",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "Advanced hydraulic swing beam shearing machine with NC control and precision cutting": "Cizalla hidráulica avanzada con viga oscilante con control NC y corte de precisión",
  "Cutting Capacity": "Capacidad de corte",
  "Available in various capacity ranges": "Disponible en varios rangos de capacidad",
  "Multiple width options to suit different needs": "Múltiples opciones de ancho para adaptarse a diferentes necesidades",
  "Material: Steel, Stainless, Aluminum": "Material: acero, inoxidable, aluminio",
  "Cutting Angle: Straight cuts with precision": "Ángulo de corte: Cortes rectos con precisión",
  "Control System": "Sistema de control",
  "NC Controller: Advanced digital": "Controlador NC: digital avanzado",
  "Back Gauge: Motorized ball screw": "Tope trasero: Husillo de bolas motorizado",
  "Stroke Counter: Digital display": "Contador de golpes: pantalla digital",
  "Programming: Cut length adjustment": "Programación: Ajuste de longitud de corte",
  "Key Features": "Características clave",
  "Swinging blade mechanism": "Mecanismo de hoja oscilante",
  "Hydraulic drive system": "Sistema de accionamiento hidráulico",
  "Adjustable blade gap": "Espacio de hoja ajustable",
  "Front protection system": "Sistema de protección frontal",
  "Why Choose Our Swing Beam Shearing Machine?": "¿Por qué elegir nuestra máquina cizalla con viga oscilante?",
  "Discover the key advantages that make our hydraulic swing beam shearing machine the preferred choice for sheet metal processing": "Descubra las ventajas clave que hacen de nuestra cizalla hidráulica de viga oscilante la opción preferida para el procesamiento de chapa metálica",
  "High Efficiency": "Alta eficiencia",
  "Fast working speed and smooth cutting action ensure maximum productivity with minimal downtime": "La velocidad de trabajo rápida y la acción de corte suave garantizan la máxima productividad con un tiempo de inactividad mínimo",
  "Simple Operation": "Operación sencilla",
  "Intuitive controls and straightforward setup reduce training time and make operation easy for all skill levels": "Los controles intuitivos y la configuración sencilla reducen el tiempo de capacitación y facilitan la operación para todos los niveles",
  "Excellent Stability": "Excelente estabilidad",
  "Swing arm design provides superior stability during cutting operations, ensuring consistent quality": "El diseño del brazo oscilante proporciona una estabilidad superior durante las operaciones de corte, lo que garantiza una calidad constante",
  "Compact Footprint": "Huella compacta",
  "Space-saving design ideal for facilities with limited floor space while maintaining full functionality": "Diseño que ahorra espacio, ideal para instalaciones con espacio limitado y al mismo tiempo mantiene la funcionalidad completa.",
  "Safety Features": "Características de seguridad",
  "Comprehensive safety systems including guards and emergency stops ensure operator protection": "Los sistemas de seguridad integrales, que incluyen protecciones y paradas de emergencia, garantizan la protección del operador.",
  "Cost-Effective": "Rentable",
  "Economical solution for cutting thin to medium thickness materials with excellent performance-to-price ratio": "Solución económica para cortar materiales de espesor fino a medio con una excelente relación rendimiento-precio",
  "Components": "Componentes",
  "Better understand the machine performance through detailed component descriptions and technical features": "Comprender mejor el rendimiento de la máquina a través de descripciones detalladas de los componentes y características técnicas.",
  "Frame Structure": "Estructura del marco",
  "The machine frame is constructed from high-quality steel with a welded structure design. The compact and simple pendulum arm mechanism provides excellent rigidity and stability, ensuring straight and accurate cuts throughout the machine's operational life.": "El bastidor de la máquina está construido con acero de alta calidad con un diseño de estructura soldada. ",
  "Swing Beam Mechanism": "Mecanismo de viga oscilante",
  "The innovative swinging blade design creates an arc-shaped cutting motion that ensures material straightness and clean cuts. This mechanism provides fast working speed with good stability, ideal for processing thin to medium thickness materials efficiently.": "El innovador diseño de la hoja oscilante crea un movimiento de corte en forma de arco que garantiza la rectitud del material y cortes limpios. ",
  "Hydraulic System": "Sistema hidráulico",
  "Equipped with high-quality hydraulic components, the system provides stable and reliable cutting force. The hydraulic drive ensures smooth operation with low noise levels and excellent energy efficiency. Built-in oil cooling system maintains optimal operating temperature.": "Equipado con componentes hidráulicos de alta calidad, el sistema proporciona una fuerza de corte estable y confiable. ",
  "NC Back Gauge System": "Sistema de tope trasero NC",
  "The motorized ball screw back gauge provides precise positioning with extended travel distance options. NC controller allows for programmable movements and automatic positioning, significantly improving efficiency and accuracy for repetitive cutting operations.": "El tope posterior del husillo de bolas motorizado proporciona un posicionamiento preciso con opciones de distancia de recorrido extendida. ",
  "Blade System": "Sistema de cuchillas",
  "High-quality tool steel blades with four usable cutting edges provide long service life and consistent cutting quality. Manual single-point blade gap adjustment allows for optimization based on material thickness, ensuring clean cuts with minimal burr formation.": "Las hojas de acero para herramientas de alta calidad con cuatro filos de corte utilizables brindan una larga vida útil y una calidad de corte constante. ",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "See the precision and efficiency of our hydraulic swing beam shearing machine": "Vea la precisión y eficiencia de nuestra máquina cizalla hidráulica de viga oscilante",
  "Applications": "Aplicaciones",
  "Our swing beam shearing machines are widely used across various industries for precision metal cutting": "Nuestras máquinas cizallas de viga oscilante se utilizan ampliamente en diversas industrias para el corte de metales de precisión.",
  "Sheet Metal Fabrication": "Fabricación de chapa metálica",
  "Precision cutting of steel, stainless steel, and aluminum sheets for various fabrication needs": "Corte de precisión de láminas de acero, acero inoxidable y aluminio para diversas necesidades de fabricación.",
  "Automotive Industry": "Industria automotriz",
  "Manufacturing of body panels, brackets, and structural components with clean edges": "Fabricación de paneles de carrocería, soportes y componentes estructurales con bordes limpios",
  "Construction": "Construcción",
  "Cutting metal sheets for roofing, siding, and structural steel components": "Corte de láminas de metal para techos, revestimientos y componentes de acero estructural.",
  "HVAC Manufacturing": "Fabricación de climatización",
  "Processing ductwork, ventilation panels, and air conditioning components": "Procesamiento de conductos, paneles de ventilación y componentes de aire acondicionado.",
  "Electronics Enclosures": "Cajas electrónicas",
  "Manufacturing cabinet panels, server racks, and control panel housings": "Fabricación de paneles de gabinetes, bastidores de servidores y carcasas de paneles de control.",
  "Machinery Manufacturing": "Fabricación de maquinaria",
  "Cutting metal parts for industrial equipment, machine guards, and custom components": "Corte de piezas metálicas para equipos industriales, protectores de máquinas y componentes personalizados.",
  "Furniture Industry": "Industria del mueble",
  "Processing metal furniture components, cabinets, and decorative panels": "Procesamiento de componentes metálicos para muebles, armarios y paneles decorativos.",
  "Shipbuilding": "Construcción naval",
  "Cutting steel plates for hull construction, bulkheads, and marine structures": "Corte de placas de acero para construcción de cascos, mamparos y estructuras marinas.",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personalice su máquina con funciones estándar y actualizaciones opcionales para satisfacer sus requisitos específicos",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our hydraulic swing beam shearing machines": "Preguntas comunes sobre nuestras cizallas hidráulicas de viga oscilante",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials. Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher precision.": "Las cizallas con viga oscilante utilizan un diseño de brazo pendular con un movimiento de corte en forma de arco, lo que ofrece ventajas como una huella más pequeña, buena estabilidad y una velocidad de trabajo rápida. ",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel, aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and machine model. Please contact us for specific capacity options for your application.": "Nuestras máquinas cizallas de viga oscilante pueden procesar diversos materiales metálicos, incluidos acero dulce, acero inoxidable, aluminio, placas de cobre y otras láminas de metal. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life. Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions, blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Las hojas están diseñadas con cuatro filos de corte utilizables, lo que prolonga significativamente su vida útil. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting. Training materials and operation manuals are also provided.": "Sí, brindamos capacitación integral para operadores como parte de nuestro servicio de instalación. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your order and keep you updated throughout the manufacturing process.": "Las configuraciones estándar generalmente se envían dentro de 30 a 45 días desde la confirmación del pedido. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "El mantenimiento regular es simple y directo: verifique los niveles de aceite hidráulico semanalmente, limpie la máquina diariamente, lubrique las piezas móviles según el cronograma e inspeccione el estado de la hoja con regularidad. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Get detailed technical specifications, dimensions, and performance data for our hydraulic swing beam shearing machines. Download our comprehensive product brochure in PDF format.": "Obtenga especificaciones técnicas detalladas, dimensiones y datos de rendimiento de nuestras cizallas hidráulicas con viga oscilante. "
}