{
  "Hydraulic Swing Beam Shearing Machine": "آلة القص ذات الشعاع المتأرجح الهيدروليكي",
  "Featuring an innovative swinging blade design with arc-shaped cutting motion, our hydraulic swing beam shearing machine delivers efficient and precise sheet metal cutting with a compact footprint and exceptional stability.": "تتميز بتصميم مبتكر للشفرة المتأرجحة مع حركة قطع على شكل قوس، فإن آلة القص ذات العارضة المتأرجحة الهيدروليكية توفر قطعًا فعالاً ودقيقًا للصفائح المعدنية مع بصمة مدمجة وثبات استثنائي.",
  "Request Quote": "طلب اقتباس",
  "Watch Video": "شاهد الفيديو",
  "Technical Specifications": "المواصفات الفنية",
  "Advanced hydraulic swing beam shearing machine with NC control and precision cutting": "آلة قص شعاع التأرجح الهيدروليكية المتقدمة مع التحكم NC والقطع الدقيق",
  "Cutting Capacity": "قدرة القطع",
  "Available in various capacity ranges": "متوفر في نطاقات القدرات المختلفة",
  "Multiple width options to suit different needs": "خيارات عرض متعددة لتناسب الاحتياجات المختلفة",
  "Material: Steel, Stainless, Aluminum": "المواد: الفولاذ، الفولاذ المقاوم للصدأ، الألومنيوم",
  "Cutting Angle: Straight cuts with precision": "زاوية القطع: قطع مستقيمة بدقة",
  "Control System": "نظام التحكم",
  "NC Controller: Advanced digital": "وحدة التحكم NC: رقمية متقدمة",
  "Back Gauge: Motorized ball screw": "المقياس الخلفي: الكرة اللولبية الآلية",
  "Stroke Counter: Digital display": "عداد السكتة الدماغية: العرض الرقمي",
  "Programming: Cut length adjustment": "البرمجة: تعديل طول القطع",
  "Key Features": "الميزات الرئيسية",
  "Swinging blade mechanism": "آلية شفرة التأرجح",
  "Hydraulic drive system": "نظام القيادة الهيدروليكية",
  "Adjustable blade gap": "فجوة شفرة قابلة للتعديل",
  "Front protection system": "نظام الحماية الامامي",
  "Why Choose Our Swing Beam Shearing Machine?": "لماذا تختار آلة القص ذات العارضة المتأرجحة الخاصة بنا؟",
  "Discover the key advantages that make our hydraulic swing beam shearing machine the preferred choice for sheet metal processing": "اكتشف المزايا الرئيسية التي تجعل آلة القص ذات العارضة المتأرجحة الهيدروليكية هي الخيار المفضل لمعالجة الصفائح المعدنية",
  "High Efficiency": "كفاءة عالية",
  "Fast working speed and smooth cutting action ensure maximum productivity with minimal downtime": "تضمن سرعة العمل السريعة وإجراءات القطع السلسة أقصى قدر من الإنتاجية بأقل وقت توقف",
  "Simple Operation": "عملية بسيطة",
  "Intuitive controls and straightforward setup reduce training time and make operation easy for all skill levels": "تعمل عناصر التحكم البديهية والإعداد المباشر على تقليل وقت التدريب وتجعل التشغيل سهلاً لجميع مستويات المهارة",
  "Excellent Stability": "استقرار ممتاز",
  "Swing arm design provides superior stability during cutting operations, ensuring consistent quality": "يوفر تصميم الذراع المتأرجح ثباتًا فائقًا أثناء عمليات القطع، مما يضمن الجودة المتسقة",
  "Compact Footprint": "البصمة المدمجة",
  "Space-saving design ideal for facilities with limited floor space while maintaining full functionality": "تصميم موفر للمساحة مثالي للمرافق ذات المساحة الأرضية المحدودة مع الحفاظ على الأداء الوظيفي الكامل",
  "Safety Features": "ميزات السلامة",
  "Comprehensive safety systems including guards and emergency stops ensure operator protection": "أنظمة السلامة الشاملة بما في ذلك الحراس ومحطات التوقف في حالات الطوارئ تضمن حماية المشغل",
  "Cost-Effective": "فعالة من حيث التكلفة",
  "Economical solution for cutting thin to medium thickness materials with excellent performance-to-price ratio": "حل اقتصادي لقطع المواد الرقيقة إلى المتوسطة السُمك مع نسبة أداء ممتازة إلى السعر",
  "Components": "عناصر",
  "Better understand the machine performance through detailed component descriptions and technical features": "فهم أداء الماكينة بشكل أفضل من خلال الأوصاف التفصيلية للمكونات والميزات التقنية",
  "Frame Structure": "هيكل الإطار",
  "The machine frame is constructed from high-quality steel with a welded structure design. The compact and simple pendulum arm mechanism provides excellent rigidity and stability, ensuring straight and accurate cuts throughout the machine's operational life.": "هيكل الآلة مصنوع من الفولاذ عالي الجودة مع تصميم هيكل ملحوم. ",
  "Swing Beam Mechanism": "آلية شعاع التأرجح",
  "The innovative swinging blade design creates an arc-shaped cutting motion that ensures material straightness and clean cuts. This mechanism provides fast working speed with good stability, ideal for processing thin to medium thickness materials efficiently.": "يخلق تصميم الشفرة المتأرجحة المبتكرة حركة قطع على شكل قوس تضمن استقامة المواد وقطعًا نظيفة. ",
  "Hydraulic System": "النظام الهيدروليكي",
  "Equipped with high-quality hydraulic components, the system provides stable and reliable cutting force. The hydraulic drive ensures smooth operation with low noise levels and excellent energy efficiency. Built-in oil cooling system maintains optimal operating temperature.": "إنه مُجهز بمكونات هيدروليكية عالية الجودة، ويوفر النظام قوة قطع مستقرة وموثوقة. ",
  "NC Back Gauge System": "نظام القياس الخلفي NC",
  "The motorized ball screw back gauge provides precise positioning with extended travel distance options. NC controller allows for programmable movements and automatic positioning, significantly improving efficiency and accuracy for repetitive cutting operations.": "يوفر المقياس الخلفي اللولبي الكروي المزود بمحرك تحديد موضع دقيق مع خيارات مسافة سفر ممتدة. ",
  "Blade System": "نظام بليد",
  "High-quality tool steel blades with four usable cutting edges provide long service life and consistent cutting quality. Manual single-point blade gap adjustment allows for optimization based on material thickness, ensuring clean cuts with minimal burr formation.": "شفرات فولاذية عالية الجودة مع أربع حواف قطع قابلة للاستخدام توفر عمر خدمة طويل وجودة قطع ثابتة. ",
  "Watch Our Machine in Action": "شاهد آلتنا أثناء عملها",
  "See the precision and efficiency of our hydraulic swing beam shearing machine": "شاهد دقة وكفاءة آلة القص ذات العارضة المتأرجحة الهيدروليكية",
  "Applications": "التطبيقات",
  "Our swing beam shearing machines are widely used across various industries for precision metal cutting": "يتم استخدام آلات القص ذات العارضة المتأرجحة لدينا على نطاق واسع في مختلف الصناعات لقطع المعادن بدقة",
  "Sheet Metal Fabrication": "تصنيع الصفائح المعدنية",
  "Precision cutting of steel, stainless steel, and aluminum sheets for various fabrication needs": "قطع دقيق لصفائح الفولاذ والفولاذ المقاوم للصدأ والألومنيوم لتلبية احتياجات التصنيع المختلفة",
  "Automotive Industry": "صناعة السيارات",
  "Manufacturing of body panels, brackets, and structural components with clean edges": "تصنيع ألواح الجسم والأقواس والمكونات الهيكلية بحواف نظيفة",
  "Construction": "بناء",
  "Cutting metal sheets for roofing, siding, and structural steel components": "قطع الصفائح المعدنية للأسقف والجوانب والمكونات الفولاذية الهيكلية",
  "HVAC Manufacturing": "تصنيع التدفئة والتهوية وتكييف الهواء (HVAC).",
  "Processing ductwork, ventilation panels, and air conditioning components": "معالجة مجاري الهواء وألواح التهوية ومكونات تكييف الهواء",
  "Electronics Enclosures": "حاويات الالكترونيات",
  "Manufacturing cabinet panels, server racks, and control panel housings": "تصنيع لوحات الخزائن ورفوف الخوادم وأغطية لوحات التحكم",
  "Machinery Manufacturing": "تصنيع الآلات",
  "Cutting metal parts for industrial equipment, machine guards, and custom components": "قطع الأجزاء المعدنية للمعدات الصناعية وواقيات الآلات والمكونات المخصصة",
  "Furniture Industry": "صناعة الأثاث",
  "Processing metal furniture components, cabinets, and decorative panels": "تجهيز مكونات الأثاث المعدني والخزائن والألواح الزخرفية",
  "Shipbuilding": "بناء السفن",
  "Cutting steel plates for hull construction, bulkheads, and marine structures": "قطع الألواح الفولاذية لبناء الهياكل والحواجز والهياكل البحرية",
  "Standard & Optional Configuration": "التكوين القياسي والاختياري",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "قم بتخصيص جهازك بالميزات القياسية والترقيات الاختيارية لتلبية متطلباتك المحددة",
  "Standard Configuration": "التكوين القياسي",
  "Optional Upgrades": "ترقيات اختيارية",
  "Need help choosing the right configuration?": "هل تحتاج إلى مساعدة في اختيار التكوين الصحيح؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about our hydraulic swing beam shearing machines": "الأسئلة الشائعة حول آلات القص ذات العارضة المتأرجحة الهيدروليكية",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials. Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher precision.": "تستخدم المقصات ذات العارضة المتأرجحة تصميم ذراع البندول مع حركة القطع على شكل قوس، مما يوفر مزايا مثل مساحة أصغر، واستقرار جيد، وسرعة عمل سريعة. ",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel, aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and machine model. Please contact us for specific capacity options for your application.": "يمكن لآلات القص ذات العارضة المتأرجحة الخاصة بنا معالجة العديد من المواد المعدنية بما في ذلك الفولاذ الطري والفولاذ المقاوم للصدأ والألمنيوم والألواح النحاسية والصفائح المعدنية الأخرى. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life. Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions, blades can last for tens of thousands of cuts before requiring rotation or replacement.": "تم تصميم الشفرات بأربعة حواف قطع قابلة للاستخدام، مما يزيد من عمر الخدمة بشكل كبير. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting. Training materials and operation manuals are also provided.": "نعم، نحن نقدم تدريبًا شاملاً للمشغلين كجزء من خدمة التركيب لدينا. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your order and keep you updated throughout the manufacturing process.": "يتم شحن التكوينات القياسية عادةً خلال 30-45 يومًا من تأكيد الطلب. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "تتميز الصيانة الدورية بالبساطة والوضوح: افحص مستويات الزيت الهيدروليكي أسبوعيًا، ونظف الماكينة يوميًا، وقم بتشحيم الأجزاء المتحركة وفقًا للجدول الزمني، وافحص حالة الشفرة بانتظام. ",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "Download Technical Brochure": "تحميل الكتيب الفني",
  "Get detailed technical specifications, dimensions, and performance data for our hydraulic swing beam shearing machines. Download our comprehensive product brochure in PDF format.": "احصل على المواصفات الفنية التفصيلية والأبعاد وبيانات الأداء لآلات القص ذات العارضة الهيدروليكية المتأرجحة. "
}