{
  "Four-Column Hydraulic Press": "Presse hydraulique à quatre colonnes",
  "Featuring advanced four-column structure and precision hydraulic system, our hydraulic press delivers exceptional force distribution and stability with multiple tonnage capacity options. Complete metal forming, stamping, deep drawing, and forging operations with precision.": "Dotée d'une structure avancée à quatre colonnes et d'un système hydraulique de précision, notre presse hydraulique offre une répartition et une stabilité de force exceptionnelles avec plusieurs options de capacité de tonnage. ",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "High-performance four-column hydraulic press with precision control for efficient metal forming operations": "Presse hydraulique haute performance à quatre colonnes avec contrôle de précision pour des opérations efficaces de formage des métaux",
  "Press Capacity": "Capacité de la presse",
  "Nominal Pressure: Multiple tonnage options available": "Pression nominale : plusieurs options de tonnage disponibles",
  "Working Table: Customizable dimensions": "Table de travail : Dimensions personnalisables",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Matériau : acier, inoxydable, aluminium, cuivre, laiton.",
  "Max Stroke: Adjustable stroke length": "Course maximale : longueur de course réglable",
  "Control System": "Système de contrôle",
  "Control: PLC + Touch Screen (Siemens/Mitsubishi)": "Contrôle : PLC + écran tactile (Siemens/Mitsubishi)",
  "Hydraulic System: Dual-pump design": "Système hydraulique : conception à double pompe",
  "Positioning Accuracy: High precision": "Précision de positionnement : haute précision",
  "Pressure Control: Proportional valve system": "Contrôle de pression : système de valve proportionnelle",
  "Key Features": "Principales fonctionnalités",
  "Four-column guided structure": "Structure guidée à quatre colonnes",
  "Adjustable stroke length": "Longueur de course réglable",
  "Fast/slow dual-speed system": "Système à double vitesse rapide/lent",
  "Motor Power: Various power options available": "Puissance du moteur : Diverses options de puissance disponibles",
  "Why Choose Our Four-Column Hydraulic Press?": "Pourquoi choisir notre presse hydraulique à quatre colonnes ?",
  "Discover the key advantages that make our hydraulic press the preferred choice for precision metal forming, stamping, and deep drawing operations": "Découvrez les principaux avantages qui font de notre presse hydraulique le choix privilégié pour les opérations de formage, d'emboutissage et d'emboutissage profond de précision des métaux.",
  "Even Force Distribution": "Répartition uniforme des forces",
  "Four-column structure ensures uniform pressure across the entire workpiece eliminating deflection common in single-column presses for superior quality": "La structure à quatre colonnes assure une pression uniforme sur toute la pièce, éliminant la déflexion courante dans les presses à colonne unique pour une qualité supérieure",
  "Wide Tonnage Range": "Large gamme de tonnages",
  "Available in multiple tonnage capacities to handle everything from precision electronics parts to heavy automotive components": "Disponible en plusieurs capacités de tonnage pour tout gérer, des pièces électroniques de précision aux composants automobiles lourds",
  "Precision Control": "Contrôle de précision",
  "PLC control with touch screen interface and proportional valve system provides high positioning accuracy for critical applications": "Le contrôle PLC avec interface à écran tactile et système de vanne proportionnelle offre une précision de positionnement élevée pour les applications critiques",
  "Adjustable Stroke": "Course réglable",
  "Variable stroke length adjustment accommodates different workpiece heights and forming requirements for maximum versatility": "Le réglage variable de la longueur de course s'adapte à différentes hauteurs de pièces et exigences de formage pour une polyvalence maximale",
  "Robust Construction": "Construction robuste",
  "Heavy-duty steel frame with stress-relief treatment ensures long-term stability and durability under extreme tonnage": "Le cadre en acier robuste avec traitement anti-stress assure une stabilité et une durabilité à long terme sous un tonnage extrême",
  "Energy Efficient": "Efficacité énergétique",
  "Dual-speed hydraulic system with fast approach and slow forming cycles reduces energy consumption and operating costs": "Le système hydraulique à deux vitesses avec une approche rapide et des cycles de formage lents réduit la consommation d'énergie et les coûts d'exploitation",
  "Key Components": "Composants clés",
  "Understanding the core components that deliver precision hydraulic press performance and reliability": "Comprendre les composants essentiels qui assurent les performances et la fiabilité des presses hydrauliques de précision",
  "Hydraulic Power System": "Système d'énergie hydraulique",
  "High-performance hydraulic system with dual-pump design featuring multiple tonnage capacity options and proportional valve control for precise pressure regulation. Offers exceptional force distribution, fast/slow dual-speed operation, and energy-efficient cycles with automatic pressure holding. Stable output ensures consistent forming quality.": "Système hydraulique haute performance avec conception à double pompe offrant plusieurs options de capacité de tonnage et commande de soupape proportionnelle pour une régulation précise de la pression. ",
  "PLC Control System": "Système de contrôle PLC",
  "Advanced PLC system (Siemens or Mitsubishi) with color touch screen interface for intuitive programming and operation. Supports multiple working modes, automatic/manual control, real-time pressure monitoring, and safety interlocks. Store up to 100 programs for different forming operations.": "Système PLC avancé (Siemens ou Mitsubishi) avec interface à écran tactile couleur pour une programmation et un fonctionnement intuitifs. ",
  "Four-Column Guided Structure": "Structure guidée à quatre colonnes",
  "Precision four-column design with hardened and ground guide posts ensures perfect alignment and even force distribution across the workpiece. Eliminates deflection and tilting during pressing operations. Built-in linear bearings provide smooth vertical movement with minimal friction and long service life.": "La conception précise à quatre colonnes avec des poteaux de guidage trempés et rectifiés garantit un alignement parfait et une répartition uniforme de la force sur la pièce à usiner. ",
  "Main Hydraulic Cylinder & Ram": "Cylindre hydraulique principal et vérin",
  "Heavy-duty main cylinder with precision-machined ram provides consistent tonnage throughout the stroke. Chrome-plated piston rod resists wear and corrosion. Multiple cylinder configurations available for different tonnage requirements. Fast approach and slow forming speeds optimize cycle time.": "Le cylindre principal robuste avec vérin usiné avec précision fournit un tonnage constant tout au long de la course. ",
  "Watch Our Machine in Action": "Regardez notre machine en action",
  "See the precision and power of our four-column hydraulic press in real production": "Découvrez la précision et la puissance de notre presse hydraulique à quatre colonnes en production réelle",
  "Applications": "Applications",
  "Our four-column hydraulic presses are widely used across various industries for precision metal forming, stamping, and deep drawing": "Nos presses hydrauliques à quatre colonnes sont largement utilisées dans diverses industries pour le formage, l'emboutissage et l'emboutissage profond de précision des métaux.",
  "Automotive Industry": "Industrie automobile",
  "Metal stamping of car body panels, brackets, transmission gears, axle components, and deep drawing of automotive parts under extreme tonnage": "Estampage métallique de panneaux de carrosserie, supports, engrenages de transmission, composants d'essieux et emboutissage profond de pièces automobiles sous tonnage extrême",
  "Aerospace Components": "Composants aérospatiaux",
  "Composite layering with carbon fiber for aircraft wings, forming turbine blades and landing gear components with precision": "Stratification composite avec fibre de carbone pour les ailes d'avion, formant avec précision des aubes de turbine et des composants de train d'atterrissage",
  "Metal Forming": "Formage des métaux",
  "Deep drawing, bending, blanking, and embossing operations for cookware, sinks, and complex metal shapes": "Opérations d'emboutissage profond, de pliage, de découpage et de gaufrage pour les ustensiles de cuisine, les éviers et les formes métalliques complexes",
  "Powder Metallurgy": "Métallurgie des poudres",
  "Compacting metal powders into precision parts for automotive, electronics, and industrial applications": "Compactage de poudres métalliques en pièces de précision pour les applications automobiles, électroniques et industrielles",
  "Plastics & Rubber Molding": "Moulage de plastiques et de caoutchouc",
  "Compression molding of plastic and rubber products, gaskets, seals, and industrial components": "Moulage par compression de produits en plastique et en caoutchouc, de joints d'étanchéité et de composants industriels",
  "Appliance Manufacturing": "Fabrication d'appareils électroménagers",
  "Forming panels, doors, and structural components for refrigerators, washing machines, and home appliances": "Formage de panneaux, portes et composants structurels pour réfrigérateurs, machines à laver et appareils électroménagers",
  "Electronics Components": "Composants électroniques",
  "Precision stamping and forming of electronic enclosures, heat sinks, and metal shields for devices": "Estampage et formage de précision de boîtiers électroniques, de dissipateurs thermiques et de boucliers métalliques pour appareils",
  "Metal Forging": "Forgeage des métaux",
  "Hot and cold forging of metal parts including tools, hardware, and industrial fasteners with high tonnage capacity": "Forgeage à chaud et à froid de pièces métalliques, notamment d'outils, de quincaillerie et de fixations industrielles, avec une capacité de tonnage élevée",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personnalisez votre machine avec des fonctionnalités standard et des mises à niveau facultatives pour répondre à vos besoins spécifiques",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need help choosing the right configuration?": "Besoin d'aide pour choisir la bonne configuration ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our four-column hydraulic presses": "Questions courantes sur nos presses hydrauliques à quatre colonnes",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece, eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing, metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also provides superior stability and precision for high-tonnage applications.": "Les presses hydrauliques à quatre colonnes sont dotées de quatre poteaux de guidage qui assurent une répartition uniforme de la force sur l'ensemble de la pièce, éliminant ainsi la déflexion et l'inclinaison courantes dans les presses à colonne unique ou à châssis en C. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking, powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based on material type, thickness, and forming operation requirements.": "Nos presses hydrauliques traitent une large gamme de matériaux, notamment l'acier, l'acier inoxydable, l'aluminium, le cuivre, le laiton, les plastiques, le caoutchouc et les matériaux composites. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings, checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper maintenance ensures reliable operation and extends machine lifespan for many years.": "L'entretien régulier comprend : la vérification des niveaux et de la qualité de l'huile hydraulique (vidanges d'huile périodiques), l'inspection des tuyaux et des raccords hydrauliques pour déceler les fuites, le nettoyage ou le remplacement des filtres, la lubrification des poteaux de guidage et des roulements linéaires, la vérification des manomètres et des vannes de commande. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance, and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment, safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "Oui, nous fournissons une assistance complète comprenant l'installation sur site, la mise en service de la machine, des conseils sur les exigences en matière de fondation et la formation des opérateurs. ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle while consuming minimal energy during fast approach and return strokes.": "Les coûts d'exploitation comprennent l'électricité pour le moteur de la pompe hydraulique (les besoins en énergie varient selon le tonnage), l'huile hydraulique (remplacements périodiques), le remplacement des filtres, la lubrification et le remplacement occasionnel des joints. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage machines or custom specifications may require additional time due to larger component manufacturing requirements. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Les machines à configuration standard sont généralement expédiées dans un délai raisonnable après la confirmation de la commande. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Get detailed technical specifications, dimensions, tonnage charts, and performance data for our four-column hydraulic presses. Download our comprehensive product brochure in PDF format.": "Obtenez des spécifications techniques détaillées, des dimensions, des tableaux de tonnage et des données de performances pour nos presses hydrauliques à quatre colonnes. "
}