{
  "Four-Column Hydraulic Press": "مكبس هيدروليكي بأربعة أعمدة",
  "Featuring advanced four-column structure and precision hydraulic system, our hydraulic press delivers exceptional force distribution and stability with multiple tonnage capacity options. Complete metal forming, stamping, deep drawing, and forging operations with precision.": "تتميز بهيكل متطور مكون من أربعة أعمدة ونظام هيدروليكي دقيق، فإن مكبسنا الهيدروليكي يوفر توزيعًا استثنائيًا للقوة واستقرارًا مع خيارات سعة الحمولة المتعددة. ",
  "Request Quote": "طلب اقتباس",
  "Watch Video": "شاهد الفيديو",
  "Technical Specifications": "المواصفات الفنية",
  "High-performance four-column hydraulic press with precision control for efficient metal forming operations": "مكبس هيدروليكي عالي الأداء بأربعة أعمدة مع تحكم دقيق لعمليات تشكيل المعادن بكفاءة",
  "Press Capacity": "قدرة الصحافة",
  "Nominal Pressure: Multiple tonnage options available": "الضغط الاسمي: تتوفر خيارات حمولة متعددة",
  "Working Table: Customizable dimensions": "طاولة العمل: أبعاد قابلة للتخصيص",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "المواد: الفولاذ، الفولاذ المقاوم للصدأ، الألومنيوم، النحاس، النحاس",
  "Max Stroke: Adjustable stroke length": "الحد الأقصى للسكتة الدماغية: طول السكتة الدماغية قابل للتعديل",
  "Control System": "نظام التحكم",
  "Control: PLC + Touch Screen (Siemens/Mitsubishi)": "التحكم: PLC + شاشة تعمل باللمس (سيمنز / ميتسوبيشي)",
  "Hydraulic System: Dual-pump design": "النظام الهيدروليكي: تصميم المضخة المزدوجة",
  "Positioning Accuracy: High precision": "دقة تحديد المواقع: دقة عالية",
  "Pressure Control: Proportional valve system": "التحكم في الضغط: نظام الصمام النسبي",
  "Key Features": "الميزات الرئيسية",
  "Four-column guided structure": "هيكل موجه بأربعة أعمدة",
  "Adjustable stroke length": "طول السكتة الدماغية قابل للتعديل",
  "Fast/slow dual-speed system": "نظام ثنائي السرعة سريع/بطيء",
  "Motor Power: Various power options available": "قوة المحرك: تتوفر خيارات طاقة مختلفة",
  "Why Choose Our Four-Column Hydraulic Press?": "لماذا تختار مكبسنا الهيدروليكي بأربعة أعمدة؟",
  "Discover the key advantages that make our hydraulic press the preferred choice for precision metal forming, stamping, and deep drawing operations": "اكتشف المزايا الرئيسية التي تجعل مكبسنا الهيدروليكي هو الخيار المفضل لتشكيل المعادن بدقة، والختم، وعمليات السحب العميق",
  "Even Force Distribution": "حتى توزيع القوة",
  "Four-column structure ensures uniform pressure across the entire workpiece eliminating deflection common in single-column presses for superior quality": "يضمن الهيكل ذو الأربعة أعمدة ضغطًا موحدًا عبر قطعة العمل بأكملها مما يمنع الانحراف الشائع في مكابس العمود الواحد للحصول على جودة فائقة",
  "Wide Tonnage Range": "نطاق حمولة واسع",
  "Available in multiple tonnage capacities to handle everything from precision electronics parts to heavy automotive components": "متوفر بسعات حمولة متعددة للتعامل مع كل شيء بدءًا من الأجزاء الإلكترونية الدقيقة وحتى مكونات السيارات الثقيلة",
  "Precision Control": "التحكم الدقيق",
  "PLC control with touch screen interface and proportional valve system provides high positioning accuracy for critical applications": "يوفر التحكم PLC مع واجهة شاشة اللمس ونظام الصمام النسبي دقة تحديد موضع عالية للتطبيقات المهمة",
  "Adjustable Stroke": "السكتة الدماغية قابلة للتعديل",
  "Variable stroke length adjustment accommodates different workpiece heights and forming requirements for maximum versatility": "يلائم تعديل طول الشوط المتغير ارتفاعات قطع العمل المختلفة ومتطلبات التشكيل لتحقيق أقصى قدر من التنوع",
  "Robust Construction": "البناء القوي",
  "Heavy-duty steel frame with stress-relief treatment ensures long-term stability and durability under extreme tonnage": "إطار فولاذي عالي التحمل مع معالجة لتخفيف الضغط يضمن الثبات والمتانة على المدى الطويل تحت الحمولة القصوى",
  "Energy Efficient": "كفاءة في استخدام الطاقة",
  "Dual-speed hydraulic system with fast approach and slow forming cycles reduces energy consumption and operating costs": "يعمل النظام الهيدروليكي ثنائي السرعة مع الاقتراب السريع ودورات التشكيل البطيئة على تقليل استهلاك الطاقة وتكاليف التشغيل",
  "Key Components": "المكونات الرئيسية",
  "Understanding the core components that deliver precision hydraulic press performance and reliability": "فهم المكونات الأساسية التي توفر أداء وموثوقية الضغط الهيدروليكي الدقيق",
  "Hydraulic Power System": "نظام الطاقة الهيدروليكية",
  "High-performance hydraulic system with dual-pump design featuring multiple tonnage capacity options and proportional valve control for precise pressure regulation. Offers exceptional force distribution, fast/slow dual-speed operation, and energy-efficient cycles with automatic pressure holding. Stable output ensures consistent forming quality.": "نظام هيدروليكي عالي الأداء مع تصميم مزدوج المضخة يتميز بخيارات سعة حمولة متعددة وتحكم تناسبي في الصمام لتنظيم الضغط بدقة. ",
  "PLC Control System": "نظام التحكم PLC",
  "Advanced PLC system (Siemens or Mitsubishi) with color touch screen interface for intuitive programming and operation. Supports multiple working modes, automatic/manual control, real-time pressure monitoring, and safety interlocks. Store up to 100 programs for different forming operations.": "نظام PLC متقدم (Siemens أو Mitsubishi) مع واجهة شاشة ملونة تعمل باللمس للبرمجة والتشغيل البديهي. ",
  "Four-Column Guided Structure": "هيكل موجه بأربعة أعمدة",
  "Precision four-column design with hardened and ground guide posts ensures perfect alignment and even force distribution across the workpiece. Eliminates deflection and tilting during pressing operations. Built-in linear bearings provide smooth vertical movement with minimal friction and long service life.": "يضمن التصميم الدقيق المكون من أربعة أعمدة مع أعمدة توجيه صلبة وأرضية محاذاة مثالية وتوزيعًا متساويًا للقوة عبر قطعة العمل. ",
  "Main Hydraulic Cylinder & Ram": "الاسطوانة الهيدروليكية الرئيسية والكبش",
  "Heavy-duty main cylinder with precision-machined ram provides consistent tonnage throughout the stroke. Chrome-plated piston rod resists wear and corrosion. Multiple cylinder configurations available for different tonnage requirements. Fast approach and slow forming speeds optimize cycle time.": "توفر الأسطوانة الرئيسية للخدمة الشاقة المزودة بمكبس مُصنع بدقة حمولة ثابتة طوال الشوط. ",
  "Watch Our Machine in Action": "شاهد آلتنا أثناء عملها",
  "See the precision and power of our four-column hydraulic press in real production": "شاهد دقة وقوة مكبسنا الهيدروليكي ذو الأربعة أعمدة في الإنتاج الحقيقي",
  "Applications": "التطبيقات",
  "Our four-column hydraulic presses are widely used across various industries for precision metal forming, stamping, and deep drawing": "يتم استخدام مكابسنا الهيدروليكية ذات الأربعة أعمدة على نطاق واسع في العديد من الصناعات لتشكيل المعادن بدقة، والختم، والسحب العميق",
  "Automotive Industry": "صناعة السيارات",
  "Metal stamping of car body panels, brackets, transmission gears, axle components, and deep drawing of automotive parts under extreme tonnage": "الختم المعدني لألواح جسم السيارة والأقواس وتروس ناقل الحركة ومكونات المحور والسحب العميق لأجزاء السيارة تحت الحمولة القصوى",
  "Aerospace Components": "مكونات الفضاء الجوي",
  "Composite layering with carbon fiber for aircraft wings, forming turbine blades and landing gear components with precision": "طبقات مركبة من ألياف الكربون لأجنحة الطائرات، وتشكل شفرات التوربينات ومكونات معدات الهبوط بدقة",
  "Metal Forming": "تشكيل المعادن",
  "Deep drawing, bending, blanking, and embossing operations for cookware, sinks, and complex metal shapes": "- عمليات الرسم العميق والثني والتقطيع والنقش على أواني الطهي والمغاسل والأشكال المعدنية المعقدة",
  "Powder Metallurgy": "تعدين المساحيق",
  "Compacting metal powders into precision parts for automotive, electronics, and industrial applications": "ضغط المساحيق المعدنية إلى أجزاء دقيقة للسيارات والإلكترونيات والتطبيقات الصناعية",
  "Plastics & Rubber Molding": "صب البلاستيك والمطاط",
  "Compression molding of plastic and rubber products, gaskets, seals, and industrial components": "صب ضغط المنتجات البلاستيكية والمطاطية والحشيات والأختام والمكونات الصناعية",
  "Appliance Manufacturing": "تصنيع الأجهزة",
  "Forming panels, doors, and structural components for refrigerators, washing machines, and home appliances": "تشكيل الألواح والأبواب والمكونات الهيكلية للثلاجات والغسالات والأجهزة المنزلية",
  "Electronics Components": "مكونات الالكترونيات",
  "Precision stamping and forming of electronic enclosures, heat sinks, and metal shields for devices": "دقة الختم وتشكيل العبوات الإلكترونية والمشتتات الحرارية والدروع المعدنية للأجهزة",
  "Metal Forging": "تزوير المعادن",
  "Hot and cold forging of metal parts including tools, hardware, and industrial fasteners with high tonnage capacity": "التشكيل الساخن والبارد للأجزاء المعدنية بما في ذلك الأدوات والأجهزة والمثبتات الصناعية ذات الحمولة العالية",
  "Standard & Optional Configuration": "التكوين القياسي والاختياري",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "قم بتخصيص جهازك بالميزات القياسية والترقيات الاختيارية لتلبية متطلباتك المحددة",
  "Standard Configuration": "التكوين القياسي",
  "Optional Upgrades": "ترقيات اختيارية",
  "Need help choosing the right configuration?": "هل تحتاج إلى مساعدة في اختيار التكوين الصحيح؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about our four-column hydraulic presses": "أسئلة شائعة حول مكابسنا الهيدروليكية ذات الأربعة أعمدة",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece, eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing, metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also provides superior stability and precision for high-tonnage applications.": "تتميز المكابس الهيدروليكية ذات الأربعة أعمدة بأربعة أعمدة توجيه تضمن التوزيع المتساوي للقوة عبر قطعة العمل بأكملها، مما يمنع الانحراف والإمالة الشائعة في المكابس ذات العمود الواحد أو المكابس ذات الإطار C. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking, powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based on material type, thickness, and forming operation requirements.": "تتعامل مكابسنا الهيدروليكية مع مجموعة واسعة من المواد بما في ذلك الفولاذ والفولاذ المقاوم للصدأ والألومنيوم والنحاس والنحاس والبلاستيك والمطاط والمواد المركبة. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings, checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper maintenance ensures reliable operation and extends machine lifespan for many years.": "تشمل الصيانة الدورية: فحص مستويات الزيت الهيدروليكي وجودته (تغيير الزيت بشكل دوري)، وفحص الخراطيم الهيدروليكية والتوصيلات بحثًا عن التسريبات، وتنظيف أو استبدال المرشحات، وأعمدة توجيه التشحيم والمحامل الخطية، وفحص أجهزة قياس الضغط وصمامات التحكم. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance, and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment, safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "نعم، نحن نقدم الدعم الشامل بما في ذلك التثبيت في الموقع، وتشغيل الماكينة، وتوجيه متطلبات الأساس، وتدريب المشغلين. ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle while consuming minimal energy during fast approach and return strokes.": "تشمل تكاليف التشغيل الكهرباء لمحرك المضخة الهيدروليكية (تختلف متطلبات الطاقة حسب الحمولة)، والزيت الهيدروليكي (الاستبدال الدوري)، واستبدال المرشح، والتشحيم، واستبدال السدادات من حين لآخر. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage machines or custom specifications may require additional time due to larger component manufacturing requirements. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "عادةً ما يتم شحن آلات التكوين القياسية خلال إطار زمني معقول بعد تأكيد الطلب. ",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "Download Technical Brochure": "تحميل الكتيب الفني",
  "Get detailed technical specifications, dimensions, tonnage charts, and performance data for our four-column hydraulic presses. Download our comprehensive product brochure in PDF format.": "احصل على المواصفات الفنية التفصيلية والأبعاد ومخططات الحمولة وبيانات الأداء لمكابسنا الهيدروليكية ذات الأربعة أعمدة. "
}