{
  "Four-Column Hydraulic Press": "Prensa hidráulica de cuatro columnas",
  "Featuring advanced four-column structure and precision hydraulic system, our hydraulic press delivers exceptional force distribution and stability with multiple tonnage capacity options. Complete metal forming, stamping, deep drawing, and forging operations with precision.": "Con una estructura avanzada de cuatro columnas y un sistema hidráulico de precisión, nuestra prensa hidráulica ofrece una distribución de fuerza y ​​estabilidad excepcionales con múltiples opciones de capacidad de tonelaje. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "High-performance four-column hydraulic press with precision control for efficient metal forming operations": "Prensa hidráulica de cuatro columnas de alto rendimiento con control de precisión para operaciones eficientes de conformado de metales",
  "Press Capacity": "Capacidad de prensa",
  "Nominal Pressure: Multiple tonnage options available": "Presión nominal: múltiples opciones de tonelaje disponibles",
  "Working Table: Customizable dimensions": "Mesa de Trabajo: Dimensiones personalizables",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Material: acero, inoxidable, aluminio, cobre, latón",
  "Max Stroke: Adjustable stroke length": "Carrera máxima: longitud de carrera ajustable",
  "Control System": "Sistema de control",
  "Control: PLC + Touch Screen (Siemens/Mitsubishi)": "Control: PLC + Pantalla táctil (Siemens/Mitsubishi)",
  "Hydraulic System: Dual-pump design": "Sistema hidráulico: diseño de bomba doble",
  "Positioning Accuracy: High precision": "Precisión de posicionamiento: alta precisión",
  "Pressure Control: Proportional valve system": "Control de presión: sistema de válvula proporcional",
  "Key Features": "Características clave",
  "Four-column guided structure": "Estructura guiada de cuatro columnas.",
  "Adjustable stroke length": "Longitud de carrera ajustable",
  "Fast/slow dual-speed system": "Sistema de doble velocidad rápido/lento",
  "Motor Power: Various power options available": "Potencia del motor: varias opciones de potencia disponibles",
  "Why Choose Our Four-Column Hydraulic Press?": "¿Por qué elegir nuestra prensa hidráulica de cuatro columnas?",
  "Discover the key advantages that make our hydraulic press the preferred choice for precision metal forming, stamping, and deep drawing operations": "Descubra las ventajas clave que hacen de nuestra prensa hidráulica la opción preferida para operaciones de conformado, estampado y embutición profunda de metales de precisión.",
  "Even Force Distribution": "Distribución uniforme de la fuerza",
  "Four-column structure ensures uniform pressure across the entire workpiece eliminating deflection common in single-column presses for superior quality": "La estructura de cuatro columnas garantiza una presión uniforme en toda la pieza de trabajo, eliminando la deflexión común en las prensas de una sola columna para una calidad superior.",
  "Wide Tonnage Range": "Amplio rango de tonelaje",
  "Available in multiple tonnage capacities to handle everything from precision electronics parts to heavy automotive components": "Disponible en capacidades de múltiples tonelajes para manejar todo, desde piezas electrónicas de precisión hasta componentes automotrices pesados.",
  "Precision Control": "Control de precisión",
  "PLC control with touch screen interface and proportional valve system provides high positioning accuracy for critical applications": "El control PLC con interfaz de pantalla táctil y sistema de válvula proporcional proporciona una alta precisión de posicionamiento para aplicaciones críticas",
  "Adjustable Stroke": "Carrera ajustable",
  "Variable stroke length adjustment accommodates different workpiece heights and forming requirements for maximum versatility": "El ajuste de longitud de carrera variable se adapta a diferentes alturas de piezas de trabajo y requisitos de conformado para una máxima versatilidad",
  "Robust Construction": "Construcción robusta",
  "Heavy-duty steel frame with stress-relief treatment ensures long-term stability and durability under extreme tonnage": "El marco de acero resistente con tratamiento de alivio de tensión garantiza estabilidad y durabilidad a largo plazo bajo tonelaje extremo.",
  "Energy Efficient": "Eficiencia energética",
  "Dual-speed hydraulic system with fast approach and slow forming cycles reduces energy consumption and operating costs": "El sistema hidráulico de doble velocidad con aproximación rápida y ciclos de formación lentos reduce el consumo de energía y los costos operativos.",
  "Key Components": "Componentes clave",
  "Understanding the core components that deliver precision hydraulic press performance and reliability": "Comprender los componentes principales que ofrecen rendimiento y confiabilidad de la prensa hidráulica de precisión",
  "Hydraulic Power System": "Sistema de energía hidráulica",
  "High-performance hydraulic system with dual-pump design featuring multiple tonnage capacity options and proportional valve control for precise pressure regulation. Offers exceptional force distribution, fast/slow dual-speed operation, and energy-efficient cycles with automatic pressure holding. Stable output ensures consistent forming quality.": "Sistema hidráulico de alto rendimiento con diseño de bomba doble que ofrece múltiples opciones de capacidad de tonelaje y control de válvula proporcional para una regulación precisa de la presión. ",
  "PLC Control System": "Sistema de control PLC",
  "Advanced PLC system (Siemens or Mitsubishi) with color touch screen interface for intuitive programming and operation. Supports multiple working modes, automatic/manual control, real-time pressure monitoring, and safety interlocks. Store up to 100 programs for different forming operations.": "Sistema PLC avanzado (Siemens o Mitsubishi) con interfaz de pantalla táctil a color para programación y operación intuitivas. ",
  "Four-Column Guided Structure": "Estructura guiada de cuatro columnas",
  "Precision four-column design with hardened and ground guide posts ensures perfect alignment and even force distribution across the workpiece. Eliminates deflection and tilting during pressing operations. Built-in linear bearings provide smooth vertical movement with minimal friction and long service life.": "El diseño de precisión de cuatro columnas con postes guía endurecidos y rectificados garantiza una alineación perfecta y una distribución uniforme de la fuerza en toda la pieza de trabajo. ",
  "Main Hydraulic Cylinder & Ram": "Cilindro hidráulico principal y ariete",
  "Heavy-duty main cylinder with precision-machined ram provides consistent tonnage throughout the stroke. Chrome-plated piston rod resists wear and corrosion. Multiple cylinder configurations available for different tonnage requirements. Fast approach and slow forming speeds optimize cycle time.": "El cilindro principal de servicio pesado con ariete mecanizado con precisión proporciona un tonelaje constante durante toda la carrera. ",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "See the precision and power of our four-column hydraulic press in real production": "Vea la precisión y potencia de nuestra prensa hidráulica de cuatro columnas en producción real",
  "Applications": "Aplicaciones",
  "Our four-column hydraulic presses are widely used across various industries for precision metal forming, stamping, and deep drawing": "Nuestras prensas hidráulicas de cuatro columnas se utilizan ampliamente en diversas industrias para el conformado, estampado y embutición profunda de metales con precisión.",
  "Automotive Industry": "Industria automotriz",
  "Metal stamping of car body panels, brackets, transmission gears, axle components, and deep drawing of automotive parts under extreme tonnage": "Estampado metálico de paneles de carrocería, soportes, engranajes de transmisión, componentes de ejes y embutición profunda de piezas de automóviles de tonelaje extremo.",
  "Aerospace Components": "Componentes aeroespaciales",
  "Composite layering with carbon fiber for aircraft wings, forming turbine blades and landing gear components with precision": "Capas de composite con fibra de carbono para alas de aviones, formando con precisión palas de turbinas y componentes de trenes de aterrizaje",
  "Metal Forming": "Conformado de metales",
  "Deep drawing, bending, blanking, and embossing operations for cookware, sinks, and complex metal shapes": "Operaciones de embutición profunda, doblado, corte y estampado para utensilios de cocina, fregaderos y formas metálicas complejas.",
  "Powder Metallurgy": "Metalurgia de polvos",
  "Compacting metal powders into precision parts for automotive, electronics, and industrial applications": "Compactación de polvos metálicos en piezas de precisión para aplicaciones automotrices, electrónicas e industriales.",
  "Plastics & Rubber Molding": "Moldeo de plásticos y caucho",
  "Compression molding of plastic and rubber products, gaskets, seals, and industrial components": "Moldeo por compresión de productos de plástico y caucho, juntas, sellos y componentes industriales.",
  "Appliance Manufacturing": "Fabricación de electrodomésticos",
  "Forming panels, doors, and structural components for refrigerators, washing machines, and home appliances": "Conformado de paneles, puertas y componentes estructurales para refrigeradores, lavadoras y electrodomésticos.",
  "Electronics Components": "Componentes electrónicos",
  "Precision stamping and forming of electronic enclosures, heat sinks, and metal shields for devices": "Estampado y conformado de precisión de carcasas electrónicas, disipadores de calor y protectores metálicos para dispositivos.",
  "Metal Forging": "Forja de metales",
  "Hot and cold forging of metal parts including tools, hardware, and industrial fasteners with high tonnage capacity": "Forjado en frío y en caliente de piezas metálicas, incluidas herramientas, ferretería y sujetadores industriales con capacidad de alto tonelaje.",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personalice su máquina con funciones estándar y actualizaciones opcionales para satisfacer sus requisitos específicos",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our four-column hydraulic presses": "Preguntas comunes sobre nuestras prensas hidráulicas de cuatro columnas",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece, eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing, metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also provides superior stability and precision for high-tonnage applications.": "Las prensas hidráulicas de cuatro columnas cuentan con cuatro postes guía que garantizan una distribución uniforme de la fuerza en toda la pieza de trabajo, eliminando la deflexión y la inclinación comunes en las prensas de una sola columna o con marco en C. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking, powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based on material type, thickness, and forming operation requirements.": "Nuestras prensas hidráulicas manejan una amplia gama de materiales, incluidos acero, acero inoxidable, aluminio, cobre, latón, plásticos, caucho y materiales compuestos. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings, checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper maintenance ensures reliable operation and extends machine lifespan for many years.": "El mantenimiento regular incluye: verificar los niveles y la calidad del aceite hidráulico (cambios periódicos de aceite), inspeccionar las mangueras y conexiones hidráulicas en busca de fugas, limpiar o reemplazar filtros, lubricar postes guía y cojinetes lineales, verificar manómetros y válvulas de control. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance, and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment, safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "Sí, brindamos soporte integral que incluye instalación en el sitio, puesta en marcha de la máquina, orientación sobre los requisitos de cimentación y capacitación del operador. ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle while consuming minimal energy during fast approach and return strokes.": "Los costos operativos incluyen electricidad para el motor de la bomba hidráulica (los requisitos de energía varían según el tonelaje), aceite hidráulico (reemplazos periódicos), reemplazos de filtros, lubricación y reemplazos ocasionales de sellos. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage machines or custom specifications may require additional time due to larger component manufacturing requirements. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Las máquinas de configuración estándar generalmente se envían dentro de un plazo razonable después de la confirmación del pedido. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Get detailed technical specifications, dimensions, tonnage charts, and performance data for our four-column hydraulic presses. Download our comprehensive product brochure in PDF format.": "Obtenga especificaciones técnicas detalladas, dimensiones, tablas de tonelaje y datos de rendimiento para nuestras prensas hidráulicas de cuatro columnas. "
}