{
  "Four-Column Hydraulic Press": "Viersäulen-Hydraulikpresse",
  "Featuring advanced four-column structure and precision hydraulic system, our hydraulic press delivers exceptional force distribution and stability with multiple tonnage capacity options. Complete metal forming, stamping, deep drawing, and forging operations with precision.": "Unsere hydraulische Presse verfügt über eine fortschrittliche Vier-Säulen-Struktur und ein Präzisionshydrauliksystem und bietet eine außergewöhnliche Kraftverteilung und Stabilität mit mehreren Tonnagekapazitätsoptionen. ",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "High-performance four-column hydraulic press with precision control for efficient metal forming operations": "Leistungsstarke Vier-Säulen-Hydraulikpresse mit Präzisionssteuerung für effiziente Metallumformvorgänge",
  "Press Capacity": "Drücken Sie Kapazität",
  "Nominal Pressure: Multiple tonnage options available": "Nenndruck: Mehrere Tonnageoptionen verfügbar",
  "Working Table: Customizable dimensions": "Arbeitstisch: Anpassbare Abmessungen",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Material: Stahl, Edelstahl, Aluminium, Kupfer, Messing",
  "Max Stroke: Adjustable stroke length": "Max. Hub: Einstellbare Hublänge",
  "Control System": "Kontrollsystem",
  "Control: PLC + Touch Screen (Siemens/Mitsubishi)": "Steuerung: SPS + Touchscreen (Siemens/Mitsubishi)",
  "Hydraulic System: Dual-pump design": "Hydrauliksystem: Doppelpumpendesign",
  "Positioning Accuracy: High precision": "Positionierungsgenauigkeit: Hohe Präzision",
  "Pressure Control: Proportional valve system": "Druckregelung: Proportionalventilsystem",
  "Key Features": "Hauptmerkmale",
  "Four-column guided structure": "Vier-Säulen-geführte Struktur",
  "Adjustable stroke length": "Einstellbare Hublänge",
  "Fast/slow dual-speed system": "Schnell/langsam-Dual-Speed-System",
  "Motor Power: Various power options available": "Motorleistung: Verschiedene Leistungsoptionen verfügbar",
  "Why Choose Our Four-Column Hydraulic Press?": "Warum sollten Sie sich für unsere Vier-Säulen-Hydraulikpresse entscheiden?",
  "Discover the key advantages that make our hydraulic press the preferred choice for precision metal forming, stamping, and deep drawing operations": "Entdecken Sie die wichtigsten Vorteile, die unsere hydraulische Presse zur bevorzugten Wahl für präzise Metallumform-, Stanz- und Tiefziehvorgänge machen",
  "Even Force Distribution": "Gleichmäßige Kraftverteilung",
  "Four-column structure ensures uniform pressure across the entire workpiece eliminating deflection common in single-column presses for superior quality": "Die Vier-Säulen-Struktur sorgt für einen gleichmäßigen Druck über das gesamte Werkstück und eliminiert die bei Ein-Säulen-Pressen übliche Durchbiegung für höchste Qualität",
  "Wide Tonnage Range": "Großer Tonnagebereich",
  "Available in multiple tonnage capacities to handle everything from precision electronics parts to heavy automotive components": "Erhältlich in mehreren Tonnagekapazitäten, um alles von Präzisionselektronikteilen bis hin zu schweren Automobilkomponenten zu handhaben",
  "Precision Control": "Präzise Kontrolle",
  "PLC control with touch screen interface and proportional valve system provides high positioning accuracy for critical applications": "Die SPS-Steuerung mit Touchscreen-Schnittstelle und Proportionalventilsystem bietet eine hohe Positionierungsgenauigkeit für kritische Anwendungen",
  "Adjustable Stroke": "Einstellbarer Hub",
  "Variable stroke length adjustment accommodates different workpiece heights and forming requirements for maximum versatility": "Die variable Hublängenverstellung passt sich unterschiedlichen Werkstückhöhen und Umformanforderungen an und sorgt so für maximale Vielseitigkeit",
  "Robust Construction": "Robuste Konstruktion",
  "Heavy-duty steel frame with stress-relief treatment ensures long-term stability and durability under extreme tonnage": "Der robuste Stahlrahmen mit Spannungsentlastungsbehandlung sorgt für langfristige Stabilität und Haltbarkeit unter extremer Belastung",
  "Energy Efficient": "Energieeffizient",
  "Dual-speed hydraulic system with fast approach and slow forming cycles reduces energy consumption and operating costs": "Das Dual-Speed-Hydrauliksystem mit schneller Annäherung und langsamen Umformzyklen reduziert den Energieverbrauch und die Betriebskosten",
  "Key Components": "Schlüsselkomponenten",
  "Understanding the core components that deliver precision hydraulic press performance and reliability": "Verständnis der Kernkomponenten, die die Leistung und Zuverlässigkeit präziser hydraulischer Pressen gewährleisten",
  "Hydraulic Power System": "Hydraulisches Energiesystem",
  "High-performance hydraulic system with dual-pump design featuring multiple tonnage capacity options and proportional valve control for precise pressure regulation. Offers exceptional force distribution, fast/slow dual-speed operation, and energy-efficient cycles with automatic pressure holding. Stable output ensures consistent forming quality.": "Hochleistungshydrauliksystem mit Doppelpumpendesign mit mehreren Tonnagekapazitätsoptionen und Proportionalventilsteuerung für präzise Druckregulierung. ",
  "PLC Control System": "SPS-Steuerungssystem",
  "Advanced PLC system (Siemens or Mitsubishi) with color touch screen interface for intuitive programming and operation. Supports multiple working modes, automatic/manual control, real-time pressure monitoring, and safety interlocks. Store up to 100 programs for different forming operations.": "Fortschrittliches SPS-System (Siemens oder Mitsubishi) mit farbiger Touchscreen-Oberfläche für intuitive Programmierung und Bedienung. ",
  "Four-Column Guided Structure": "Vierspaltige geführte Struktur",
  "Precision four-column design with hardened and ground guide posts ensures perfect alignment and even force distribution across the workpiece. Eliminates deflection and tilting during pressing operations. Built-in linear bearings provide smooth vertical movement with minimal friction and long service life.": "Das präzise Vier-Säulen-Design mit gehärteten und geschliffenen Führungspfosten gewährleistet eine perfekte Ausrichtung und gleichmäßige Kraftverteilung über das Werkstück. ",
  "Main Hydraulic Cylinder & Ram": "Haupthydraulikzylinder und Ram",
  "Heavy-duty main cylinder with precision-machined ram provides consistent tonnage throughout the stroke. Chrome-plated piston rod resists wear and corrosion. Multiple cylinder configurations available for different tonnage requirements. Fast approach and slow forming speeds optimize cycle time.": "Der Hochleistungs-Hauptzylinder mit präzisionsgefertigtem Stößel sorgt für eine gleichmäßige Kraftübertragung über den gesamten Hub. ",
  "Watch Our Machine in Action": "Sehen Sie unsere Maschine in Aktion",
  "See the precision and power of our four-column hydraulic press in real production": "Erleben Sie die Präzision und Kraft unserer Vier-Säulen-Hydraulikpresse in der realen Produktion",
  "Applications": "Anwendungen",
  "Our four-column hydraulic presses are widely used across various industries for precision metal forming, stamping, and deep drawing": "Unsere Viersäulen-Hydraulikpressen werden in verschiedenen Branchen für die präzise Metallumformung, das Stanzen und das Tiefziehen eingesetzt",
  "Automotive Industry": "Automobilindustrie",
  "Metal stamping of car body panels, brackets, transmission gears, axle components, and deep drawing of automotive parts under extreme tonnage": "Metallstanzen von Karosserieteilen, Halterungen, Getrieben, Achskomponenten und Tiefziehen von Automobilteilen unter extremer Belastung",
  "Aerospace Components": "Luft- und Raumfahrtkomponenten",
  "Composite layering with carbon fiber for aircraft wings, forming turbine blades and landing gear components with precision": "Verbundschichtung mit Kohlefaser für Flugzeugflügel, präzise Formung von Turbinenschaufeln und Fahrwerkskomponenten",
  "Metal Forming": "Metallumformung",
  "Deep drawing, bending, blanking, and embossing operations for cookware, sinks, and complex metal shapes": "Tiefzieh-, Biege-, Stanz- und Prägevorgänge für Kochgeschirr, Spülen und komplexe Metallformen",
  "Powder Metallurgy": "Pulvermetallurgie",
  "Compacting metal powders into precision parts for automotive, electronics, and industrial applications": "Verdichten von Metallpulvern zu Präzisionsteilen für Automobil-, Elektronik- und Industrieanwendungen",
  "Plastics & Rubber Molding": "Formen von Kunststoffen und Gummi",
  "Compression molding of plastic and rubber products, gaskets, seals, and industrial components": "Formpressen von Kunststoff- und Gummiprodukten, Dichtungen, Dichtungen und Industriekomponenten",
  "Appliance Manufacturing": "Geräteherstellung",
  "Forming panels, doors, and structural components for refrigerators, washing machines, and home appliances": "Formen von Paneelen, Türen und Strukturbauteilen für Kühlschränke, Waschmaschinen und Haushaltsgeräte",
  "Electronics Components": "Elektronische Komponenten",
  "Precision stamping and forming of electronic enclosures, heat sinks, and metal shields for devices": "Präzises Stanzen und Formen von Elektronikgehäusen, Kühlkörpern und Metallabschirmungen für Geräte",
  "Metal Forging": "Metallschmieden",
  "Hot and cold forging of metal parts including tools, hardware, and industrial fasteners with high tonnage capacity": "Warm- und Kaltschmieden von Metallteilen einschließlich Werkzeugen, Eisenwaren und industriellen Verbindungselementen mit hoher Tonnagekapazität",
  "Standard & Optional Configuration": "Standard- und optionale Konfiguration",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Passen Sie Ihre Maschine mit Standardfunktionen und optionalen Upgrades an Ihre spezifischen Anforderungen an",
  "Standard Configuration": "Standardkonfiguration",
  "Optional Upgrades": "Optionale Upgrades",
  "Need help choosing the right configuration?": "Benötigen Sie Hilfe bei der Auswahl der richtigen Konfiguration?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about our four-column hydraulic presses": "Häufige Fragen zu unseren Viersäulen-Hydraulikpressen",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece, eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing, metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also provides superior stability and precision for high-tonnage applications.": "Vier-Säulen-Hydraulikpressen verfügen über vier Führungspfosten, die eine gleichmäßige Kraftverteilung über das gesamte Werkstück gewährleisten und die bei Ein-Säulen- oder C-Rahmen-Pressen üblichen Durchbiegungen und Neigungen verhindern. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking, powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based on material type, thickness, and forming operation requirements.": "Unsere hydraulischen Pressen verarbeiten ein breites Spektrum an Materialien, darunter Stahl, Edelstahl, Aluminium, Kupfer, Messing, Kunststoffe, Gummi und Verbundwerkstoffe. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings, checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper maintenance ensures reliable operation and extends machine lifespan for many years.": "Zur regelmäßigen Wartung gehören: Überprüfung des Hydraulikölstands und der Qualität (regelmäßiger Ölwechsel), Überprüfung von Hydraulikschläuchen und -anschlüssen auf Lecks, Reinigung oder Austausch von Filtern, Schmierung von Führungspfosten und Linearlagern, Überprüfung von Manometern und Steuerventilen. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance, and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment, safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "Ja, wir bieten umfassenden Support, einschließlich Installation vor Ort, Maschineninbetriebnahme, Beratung zu Fundamentanforderungen und Bedienerschulung. ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle while consuming minimal energy during fast approach and return strokes.": "Zu den Betriebskosten gehören Strom für den Hydraulikpumpenmotor (der Leistungsbedarf variiert je nach Tonnage), Hydrauliköl (regelmäßiger Austausch), Filterwechsel, Schmierung und gelegentlicher Dichtungswechsel. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage machines or custom specifications may require additional time due to larger component manufacturing requirements. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Standardkonfigurationsmaschinen werden in der Regel innerhalb eines angemessenen Zeitrahmens nach Auftragsbestätigung versendet. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Download Technical Brochure": "Laden Sie die technische Broschüre herunter",
  "Get detailed technical specifications, dimensions, tonnage charts, and performance data for our four-column hydraulic presses. Download our comprehensive product brochure in PDF format.": "Erhalten Sie detaillierte technische Spezifikationen, Abmessungen, Tonnagetabellen und Leistungsdaten für unsere Viersäulen-Hydraulikpressen. "
}