{
  "Four-Column Hydraulic Press": "Четырехколонный гидравлический пресс",
  "Featuring advanced four-column structure and precision hydraulic system, our hydraulic press delivers exceptional force distribution and stability with multiple tonnage capacity options. Complete metal forming, stamping, deep drawing, and forging operations with precision.": "Благодаря усовершенствованной четырехколонной конструкции и прецизионной гидравлической системе наш гидравлический пресс обеспечивает исключительное распределение силы и стабильность при различных вариантах грузоподъемности. ",
  "Request Quote": "Запросить цену",
  "Watch Video": "Посмотреть видео",
  "Technical Specifications": "Технические характеристики",
  "High-performance four-column hydraulic press with precision control for efficient metal forming operations": "Высокопроизводительный четырехколонный гидравлический пресс с прецизионным управлением для эффективных операций обработки металлов давлением.",
  "Press Capacity": "Мощность пресса",
  "Nominal Pressure: Multiple tonnage options available": "Номинальное давление: доступны различные варианты тоннажа.",
  "Working Table: Customizable dimensions": "Рабочий стол: настраиваемые размеры",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Материал: сталь, нержавеющая сталь, алюминий, медь, латунь.",
  "Max Stroke: Adjustable stroke length": "Максимальный ход: регулируемая длина хода",
  "Control System": "Система управления",
  "Control: PLC + Touch Screen (Siemens/Mitsubishi)": "Управление: ПЛК + сенсорный экран (Siemens/Mitsubishi)",
  "Hydraulic System: Dual-pump design": "Гидравлическая система: конструкция с двумя насосами.",
  "Positioning Accuracy: High precision": "Точность позиционирования: Высокая точность",
  "Pressure Control: Proportional valve system": "Контроль давления: Система пропорциональных клапанов",
  "Key Features": "Ключевые особенности",
  "Four-column guided structure": "Четырехколонная направляющая конструкция",
  "Adjustable stroke length": "Регулируемая длина хода",
  "Fast/slow dual-speed system": "Быстрая/медленная двухскоростная система",
  "Motor Power: Various power options available": "Мощность двигателя: доступны различные варианты мощности.",
  "Why Choose Our Four-Column Hydraulic Press?": "Почему стоит выбрать наш четырехколонный гидравлический пресс?",
  "Discover the key advantages that make our hydraulic press the preferred choice for precision metal forming, stamping, and deep drawing operations": "Откройте для себя ключевые преимущества, которые делают наш гидравлический пресс предпочтительным выбором для операций точной обработки металлов давлением, штамповки и глубокой вытяжки.",
  "Even Force Distribution": "Равномерное распределение силы",
  "Four-column structure ensures uniform pressure across the entire workpiece eliminating deflection common in single-column presses for superior quality": "Четырехколонная конструкция обеспечивает равномерное давление по всей заготовке, устраняя прогибы, характерные для одноколонных прессов, и обеспечивая превосходное качество.",
  "Wide Tonnage Range": "Широкий диапазон тоннажа",
  "Available in multiple tonnage capacities to handle everything from precision electronics parts to heavy automotive components": "Доступен в различных тоннажных мощностях для обработки всего: от деталей прецизионной электроники до тяжелых автомобильных компонентов.",
  "Precision Control": "Прецизионный контроль",
  "PLC control with touch screen interface and proportional valve system provides high positioning accuracy for critical applications": "Управление ПЛК с интерфейсом сенсорного экрана и системой пропорциональных клапанов обеспечивает высокую точность позиционирования для критически важных приложений.",
  "Adjustable Stroke": "Регулируемый ход",
  "Variable stroke length adjustment accommodates different workpiece heights and forming requirements for maximum versatility": "Переменная регулировка длины хода позволяет адаптировать заготовку к разной высоте и требованиям к формованию, обеспечивая максимальную универсальность.",
  "Robust Construction": "Прочная конструкция",
  "Heavy-duty steel frame with stress-relief treatment ensures long-term stability and durability under extreme tonnage": "Прочная стальная рама с обработкой для снятия напряжений обеспечивает долговременную стабильность и долговечность при экстремальных нагрузках.",
  "Energy Efficient": "Энергоэффективный",
  "Dual-speed hydraulic system with fast approach and slow forming cycles reduces energy consumption and operating costs": "Двухскоростная гидравлическая система с быстрым подводом и медленными циклами формования снижает потребление энергии и эксплуатационные расходы.",
  "Key Components": "Ключевые компоненты",
  "Understanding the core components that deliver precision hydraulic press performance and reliability": "Понимание основных компонентов, обеспечивающих прецизионную производительность и надежность гидравлического пресса.",
  "Hydraulic Power System": "Гидравлическая силовая система",
  "High-performance hydraulic system with dual-pump design featuring multiple tonnage capacity options and proportional valve control for precise pressure regulation. Offers exceptional force distribution, fast/slow dual-speed operation, and energy-efficient cycles with automatic pressure holding. Stable output ensures consistent forming quality.": "Высокопроизводительная гидравлическая система с двумя насосами, различными вариантами грузоподъемности и пропорциональным управлением клапанами для точного регулирования давления. ",
  "PLC Control System": "Система управления ПЛК",
  "Advanced PLC system (Siemens or Mitsubishi) with color touch screen interface for intuitive programming and operation. Supports multiple working modes, automatic/manual control, real-time pressure monitoring, and safety interlocks. Store up to 100 programs for different forming operations.": "Усовершенствованная система ПЛК (Siemens или Mitsubishi) с интерфейсом цветного сенсорного экрана для интуитивного программирования и управления. ",
  "Four-Column Guided Structure": "Четырехколонная управляемая структура",
  "Precision four-column design with hardened and ground guide posts ensures perfect alignment and even force distribution across the workpiece. Eliminates deflection and tilting during pressing operations. Built-in linear bearings provide smooth vertical movement with minimal friction and long service life.": "Прецизионная четырехколонная конструкция с закаленными и шлифованными направляющими обеспечивает идеальное выравнивание и равномерное распределение усилия по заготовке. ",
  "Main Hydraulic Cylinder & Ram": "Главный гидравлический цилиндр и плунжер",
  "Heavy-duty main cylinder with precision-machined ram provides consistent tonnage throughout the stroke. Chrome-plated piston rod resists wear and corrosion. Multiple cylinder configurations available for different tonnage requirements. Fast approach and slow forming speeds optimize cycle time.": "Мощный главный цилиндр с прецизионно обработанным поршнем обеспечивает постоянную нагрузку на протяжении всего хода. ",
  "Watch Our Machine in Action": "Посмотрите нашу машину в действии",
  "See the precision and power of our four-column hydraulic press in real production": "Убедитесь в точности и мощности нашего четырехколонного гидравлического пресса в реальном производстве.",
  "Applications": "Приложения",
  "Our four-column hydraulic presses are widely used across various industries for precision metal forming, stamping, and deep drawing": "Наши четырехколонные гидравлические прессы широко используются в различных отраслях промышленности для точной обработки металлов давлением, штамповки и глубокой вытяжки.",
  "Automotive Industry": "Автомобильная промышленность",
  "Metal stamping of car body panels, brackets, transmission gears, axle components, and deep drawing of automotive parts under extreme tonnage": "Металлическая штамповка кузовных панелей, кронштейнов, шестерен трансмиссии, деталей мостов, а также глубокая вытяжка деталей автомобилей большой грузоподъемности.",
  "Aerospace Components": "Аэрокосмические компоненты",
  "Composite layering with carbon fiber for aircraft wings, forming turbine blades and landing gear components with precision": "Композитное наслоение углеродного волокна для крыльев самолетов, точное формирование лопаток турбины и компонентов шасси.",
  "Metal Forming": "Формовка металла",
  "Deep drawing, bending, blanking, and embossing operations for cookware, sinks, and complex metal shapes": "Глубокая вытяжка, гибка, вырубка и тиснение посуды, моек и изделий сложной металлической формы.",
  "Powder Metallurgy": "Порошковая металлургия",
  "Compacting metal powders into precision parts for automotive, electronics, and industrial applications": "Прессование металлических порошков в прецизионные детали для автомобильной, электронной и промышленной техники.",
  "Plastics & Rubber Molding": "Литье пластмасс и резины",
  "Compression molding of plastic and rubber products, gaskets, seals, and industrial components": "Прессование пластиковых и резиновых изделий, прокладок, уплотнений и промышленных комплектующих.",
  "Appliance Manufacturing": "Производство бытовой техники",
  "Forming panels, doors, and structural components for refrigerators, washing machines, and home appliances": "Формовка панелей, дверей и конструктивных элементов холодильников, стиральных машин и бытовой техники.",
  "Electronics Components": "Электронные компоненты",
  "Precision stamping and forming of electronic enclosures, heat sinks, and metal shields for devices": "Прецизионная штамповка и формовка электронных корпусов, радиаторов и металлических экранов для устройств.",
  "Metal Forging": "Ковка Металла",
  "Hot and cold forging of metal parts including tools, hardware, and industrial fasteners with high tonnage capacity": "Горячая и холодная ковка металлических деталей, включая инструменты, метизы и промышленные крепежи большой грузоподъемности.",
  "Standard & Optional Configuration": "Стандартная и дополнительная конфигурация",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Настройте свою машину с помощью стандартных функций и дополнительных обновлений в соответствии с вашими конкретными требованиями.",
  "Standard Configuration": "Стандартная конфигурация",
  "Optional Upgrades": "Дополнительные обновления",
  "Need help choosing the right configuration?": "Нужна помощь в выборе правильной конфигурации?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about our four-column hydraulic presses": "Общие вопросы о наших четырехколонных гидравлических прессах",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece, eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing, metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also provides superior stability and precision for high-tonnage applications.": "Четырехколонные гидравлические прессы оснащены четырьмя направляющими стойками, которые обеспечивают равномерное распределение усилия по всей заготовке, устраняя прогибы и наклоны, характерные для одноколонных прессов или прессов с С-образной рамой. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking, powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based on material type, thickness, and forming operation requirements.": "Наши гидравлические прессы обрабатывают широкий спектр материалов, включая сталь, нержавеющую сталь, алюминий, медь, латунь, пластик, резину и композитные материалы. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings, checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper maintenance ensures reliable operation and extends machine lifespan for many years.": "Регулярное техническое обслуживание включает: проверку уровня и качества гидравлического масла (периодическая замена масла), проверку гидравлических шлангов и соединений на предмет утечек, очистку или замену фильтров, смазку направляющих стоек и линейных подшипников, проверку манометров и регулирующих клапанов. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance, and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment, safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "Да, мы предоставляем комплексную поддержку, включая установку на месте, ввод в эксплуатацию машины, рекомендации по фундаментальным требованиям и обучение операторов. ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle while consuming minimal energy during fast approach and return strokes.": "Эксплуатационные расходы включают электроэнергию для двигателя гидравлического насоса (требования к мощности зависят от тоннажа), гидравлическое масло (периодическая замена), замену фильтров, смазку и периодическую замену уплотнений. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage machines or custom specifications may require additional time due to larger component manufacturing requirements. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Машины стандартной конфигурации обычно поставляются в течение разумного периода времени после подтверждения заказа. ",
  "Still have questions?": "Остались вопросы?",
  "Download Technical Brochure": "Загрузить техническую брошюру",
  "Get detailed technical specifications, dimensions, tonnage charts, and performance data for our four-column hydraulic presses. Download our comprehensive product brochure in PDF format.": "Получите подробные технические характеристики, размеры, диаграммы тоннажа и данные о производительности наших четырехколонных гидравлических прессов. "
}