{
  "Four-Column Hydraulic Press": "4列油圧プレス",
  "Featuring advanced four-column structure and precision hydraulic system, our hydraulic press delivers exceptional force distribution and stability with multiple tonnage capacity options. Complete metal forming, stamping, deep drawing, and forging operations with precision.": "高度な 4 コラム構造と精密油圧システムを備えた当社の油圧プレスは、複数のトン数オプションで優れた力の分散と安定性を実現します。",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "High-performance four-column hydraulic press with precision control for efficient metal forming operations": "効率的な金属成形作業を実現する精密制御を備えた高性能 4 コラム油圧プレス",
  "Press Capacity": "プレス能力",
  "Nominal Pressure: Multiple tonnage options available": "公称圧力: 複数のトン数オプションが利用可能",
  "Working Table: Customizable dimensions": "作業テーブル: カスタマイズ可能な寸法",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "材質：スチール、ステンレス、アルミニウム、銅、真鍮",
  "Max Stroke: Adjustable stroke length": "最大ストローク: 調整可能なストローク長",
  "Control System": "制御システム",
  "Control: PLC + Touch Screen (Siemens/Mitsubishi)": "制御: PLC + タッチスクリーン (シーメンス/三菱)",
  "Hydraulic System: Dual-pump design": "油圧システム: デュアルポンプ設計",
  "Positioning Accuracy: High precision": "位置決め精度：高精度",
  "Pressure Control: Proportional valve system": "圧力制御：比例弁方式",
  "Key Features": "主な特長",
  "Four-column guided structure": "4 列のガイド付き構造",
  "Adjustable stroke length": "ストローク長調整可能",
  "Fast/slow dual-speed system": "高速/低速デュアルスピードシステム",
  "Motor Power: Various power options available": "モーター電源: さまざまな電源オプションが利用可能",
  "Why Choose Our Four-Column Hydraulic Press?": "当社の 4 コラム油圧プレスを選ぶ理由",
  "Discover the key advantages that make our hydraulic press the preferred choice for precision metal forming, stamping, and deep drawing operations": "当社の油圧プレスが精密金属成形、スタンピング、深絞り加工に最適な選択肢となる主な利点をご覧ください。",
  "Even Force Distribution": "均等な力の配分",
  "Four-column structure ensures uniform pressure across the entire workpiece eliminating deflection common in single-column presses for superior quality": "4柱構造により、ワーク全体に均一な圧力がかかるため、単柱プレスにありがちなたわみがなく、高品質を実現します。",
  "Wide Tonnage Range": "広いトン数範囲",
  "Available in multiple tonnage capacities to handle everything from precision electronics parts to heavy automotive components": "精密電子部品から重量のある自動車部品まであらゆるものを取り扱うために、複数のトン数を用意しています。",
  "Precision Control": "精密制御",
  "PLC control with touch screen interface and proportional valve system provides high positioning accuracy for critical applications": "タッチスクリーンインターフェースと比例バルブシステムを備えた PLC 制御により、重要なアプリケーションに高い位置決め精度を提供します",
  "Adjustable Stroke": "ストローク調整可能",
  "Variable stroke length adjustment accommodates different workpiece heights and forming requirements for maximum versatility": "可変ストローク長調整により、さまざまなワークピースの高さや成形要件に対応し、最大限の汎用性を実現",
  "Robust Construction": "堅牢な構造",
  "Heavy-duty steel frame with stress-relief treatment ensures long-term stability and durability under extreme tonnage": "応力緩和処理を施した頑丈なスチールフレームにより、極端なトン数でも長期の安定性と耐久性を確保",
  "Energy Efficient": "エネルギー効率が高い",
  "Dual-speed hydraulic system with fast approach and slow forming cycles reduces energy consumption and operating costs": "高速アプローチと低速成形サイクルを備えたデュアルスピード油圧システムにより、エネルギー消費と運用コストが削減されます。",
  "Key Components": "主要コンポーネント",
  "Understanding the core components that deliver precision hydraulic press performance and reliability": "精密油圧プレスの性能と信頼性を実現するコアコンポーネントを理解する",
  "Hydraulic Power System": "油圧システム",
  "High-performance hydraulic system with dual-pump design featuring multiple tonnage capacity options and proportional valve control for precise pressure regulation. Offers exceptional force distribution, fast/slow dual-speed operation, and energy-efficient cycles with automatic pressure holding. Stable output ensures consistent forming quality.": "複数のトン数オプションと正確な圧力調整のための比例バルブ制御を備えたデュアルポンプ設計の高性能油圧システム。",
  "PLC Control System": "PLC制御システム",
  "Advanced PLC system (Siemens or Mitsubishi) with color touch screen interface for intuitive programming and operation. Supports multiple working modes, automatic/manual control, real-time pressure monitoring, and safety interlocks. Store up to 100 programs for different forming operations.": "直感的なプログラミングと操作のためのカラータッチスクリーンインターフェイスを備えた高度な PLC システム (Siemens または三菱)。",
  "Four-Column Guided Structure": "4 列ガイド構造",
  "Precision four-column design with hardened and ground guide posts ensures perfect alignment and even force distribution across the workpiece. Eliminates deflection and tilting during pressing operations. Built-in linear bearings provide smooth vertical movement with minimal friction and long service life.": "硬化および研磨されたガイドポストを備えた高精度の 4 コラム設計により、完璧な位置合わせとワークピース全体への均一な力の分散が保証されます。",
  "Main Hydraulic Cylinder & Ram": "メイン油圧シリンダーとラム",
  "Heavy-duty main cylinder with precision-machined ram provides consistent tonnage throughout the stroke. Chrome-plated piston rod resists wear and corrosion. Multiple cylinder configurations available for different tonnage requirements. Fast approach and slow forming speeds optimize cycle time.": "精密機械加工されたラムを備えた頑丈なメインシリンダーは、ストローク全体にわたって一貫したトン数を提供します。",
  "Watch Our Machine in Action": "機械の動作をご覧ください",
  "See the precision and power of our four-column hydraulic press in real production": "実際の生産における当社の 4 コラム油圧プレスの精度とパワーをご覧ください。",
  "Applications": "アプリケーション",
  "Our four-column hydraulic presses are widely used across various industries for precision metal forming, stamping, and deep drawing": "当社の 4 コラム油圧プレスは、精密金属成形、プレス加工、深絞り加工など、さまざまな業界で広く使用されています。",
  "Automotive Industry": "自動車産業",
  "Metal stamping of car body panels, brackets, transmission gears, axle components, and deep drawing of automotive parts under extreme tonnage": "車体パネル、ブラケット、トランスミッションギア、アクスルコンポーネントの金属プレス加工、および極度のトン数での自動車部品の深絞り加工",
  "Aerospace Components": "航空宇宙部品",
  "Composite layering with carbon fiber for aircraft wings, forming turbine blades and landing gear components with precision": "航空機の翼にカーボンファイバーを複合積層し、タービンブレードと着陸装置コンポーネントを精密に形成",
  "Metal Forming": "金属成形",
  "Deep drawing, bending, blanking, and embossing operations for cookware, sinks, and complex metal shapes": "調理器具、シンク、複雑な金属形状の深絞り、曲げ、打ち抜き、エンボス加工",
  "Powder Metallurgy": "粉末冶金",
  "Compacting metal powders into precision parts for automotive, electronics, and industrial applications": "金属粉末を圧縮して自動車、エレクトロニクス、産業用途向けの精密部品を製造",
  "Plastics & Rubber Molding": "プラスチックおよびゴム成形品",
  "Compression molding of plastic and rubber products, gaskets, seals, and industrial components": "プラスチック、ゴム製品、ガスケット、シール、工業用部品などの圧縮成形",
  "Appliance Manufacturing": "家電製品の製造",
  "Forming panels, doors, and structural components for refrigerators, washing machines, and home appliances": "冷蔵庫、洗濯機、家電製品のパネル、ドア、構造部品の成形",
  "Electronics Components": "電子部品",
  "Precision stamping and forming of electronic enclosures, heat sinks, and metal shields for devices": "電子機器の筐体、ヒートシンク、およびデバイスの金属シールドの精密スタンピングおよび成形",
  "Metal Forging": "金属鍛造品",
  "Hot and cold forging of metal parts including tools, hardware, and industrial fasteners with high tonnage capacity": "高トン数の工具、ハードウェア、工業用ファスナーなどの金属部品の熱間および冷間鍛造",
  "Standard & Optional Configuration": "標準およびオプションの構成",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "標準機能とオプションのアップグレードを使用してマシンをカスタマイズし、特定の要件を満たすことができます",
  "Standard Configuration": "標準構成",
  "Optional Upgrades": "オプションのアップグレード",
  "Need help choosing the right configuration?": "適切な構成を選択するのにサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about our four-column hydraulic presses": "4列油圧プレスに関するよくある質問",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece, eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing, metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also provides superior stability and precision for high-tonnage applications.": "4 コラム油圧プレスには 4 つのガイド ポストが備わっており、ワークピース全体に均一な力の分散を保証し、シングルコラム プレスや C フレーム プレスによく見られるたわみや傾きを排除します。",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking, powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based on material type, thickness, and forming operation requirements.": "当社の油圧プレスは、鉄鋼、ステンレス鋼、アルミニウム、銅、真鍮、プラスチック、ゴム、複合材料など幅広い材料に対応します。",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings, checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper maintenance ensures reliable operation and extends machine lifespan for many years.": "定期的なメンテナンスには、作動油のレベルと品質のチェック (定期的なオイル交換)、油圧ホースと接続部の漏れの検査、フィルターの洗浄または交換、ガイド ポストとリニア ベアリングの潤滑、圧力計と制御バルブのチェックが含まれます。",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance, and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment, safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "はい、当社はオンサイト設置、機械の試運転、基礎要件のガイダンス、オペレーターのトレーニングを含む包括的なサポートを提供します。",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle while consuming minimal energy during fast approach and return strokes.": "運転コストには、油圧ポンプ モーターの電気代 (必要な電力はトン数によって異なります)、作動油 (定期交換)、フィルターの交換、潤滑、および時々のシールの交換が含まれます。",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage machines or custom specifications may require additional time due to larger component manufacturing requirements. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "標準構成のマシンは通常、注文確認後、妥当な期間内に出荷されます。",
  "Still have questions?": "まだ質問がありますか?",
  "Download Technical Brochure": "技術パンフレットをダウンロード",
  "Get detailed technical specifications, dimensions, tonnage charts, and performance data for our four-column hydraulic presses. Download our comprehensive product brochure in PDF format.": "当社の 4 コラム油圧プレスの詳細な技術仕様、寸法、トン数チャート、および性能データを入手してください。"
}