{
  "Wood Chipper Blades": "Holzhackerklingen",
  "Premium chipper blades manufactured from high-grade chromium steel for industrial wood processing equipment. Precision ground with hardness ratings of HRC 54-57, delivering exceptional cutting performance and extended service life for forestry, landscaping, and biomass energy applications.": "Premium-Häckslermesser aus hochwertigem Chromstahl für industrielle Holzverarbeitungsgeräte. ",
  "Request Quote": "Angebot anfordern",
  "View Specs": "Technische Daten anzeigen",
  "Technical Specifications": "Technische Spezifikationen",
  "Industrial-grade chipper blades engineered for demanding wood processing applications": "Hackmesser in Industriequalität, entwickelt für anspruchsvolle Holzverarbeitungsanwendungen",
  "Blade Dimensions": "Klingenabmessungen",
  "Width: 40mm - 100mm (1.5\" - 4\")": "Breite: 40 mm - 100 mm (1,5\" - 4\")",
  "Length: 150mm - 800mm (6\" - 32\")": "Länge: 150 mm - 800 mm (6\" - 32\")",
  "Thickness: 6mm - 25mm": "Dicke: 6 mm – 25 mm",
  "Custom sizes available": "Sondergrößen verfügbar",
  "Material Options": "Materialoptionen",
  "Carbon Steel (cost-effective)": "Kohlenstoffstahl (kostengünstig)",
  "Chromium Steel (8%+ Cr, standard)": "Chromstahl (8 %+ Cr, Standard)",
  "Tool Steel (premium performance)": "Werkzeugstahl (Premium-Leistung)",
  "Carbide Inlay (maximum durability)": "Hartmetalleinlage (maximale Haltbarkeit)",
  "Performance Features": "Leistungsmerkmale",
  "Hardness: HRC 54-57 (standard)": "Härte: HRC 54-57 (Standard)",
  "Material capacity: 6\" - 24\" diameter": "Materialkapazität: 6\" - 24\" Durchmesser",
  "Compatible with disk & drum chippers": "Kompatibel mit Scheiben- und Trommelhäckslern",
  "Double-edge design available": "Doppelkantenausführung verfügbar",
  "Why Choose Our Chipper Blades?": "Warum sollten Sie sich für unsere Hackmesser entscheiden?",
  "Discover the key advantages that make our chipper blades the preferred choice for wood processing": "Entdecken Sie die entscheidenden Vorteile, die unsere Hackmesser zur bevorzugten Wahl für die Holzverarbeitung machen",
  "Premium Chromium Steel": "Premium-Chromstahl",
  "Minimum 8% chromium content provides exceptional hardness and corrosion resistance for extended service life": "Der Chromgehalt von mindestens 8 % sorgt für außergewöhnliche Härte und Korrosionsbeständigkeit für eine längere Lebensdauer",
  "Precision Heat Treatment": "Präzise Wärmebehandlung",
  "Controlled heat treatment achieves optimal HRC 54-57 hardness while maintaining toughness to resist impact": "Durch kontrollierte Wärmebehandlung wird eine optimale Härte von HRC 54–57 erreicht und gleichzeitig die Schlagzähigkeit beibehalten",
  "Clean Chip Production": "Saubere Chipproduktion",
  "Sharp, precision-ground edges produce uniform wood chips ideal for pulp, biomass, and mulch applications": "Scharfe, präzisionsgeschliffene Kanten erzeugen gleichmäßige Holzspäne, die sich ideal für Zellstoff-, Biomasse- und Mulchanwendungen eignen",
  "Re-sharpenable Design": "Nachschärfbares Design",
  "Blades can be professionally re-sharpened multiple times, reducing long-term operational costs": "Die Klingen können mehrmals professionell nachgeschärft werden, was die langfristigen Betriebskosten senkt",
  "Universal Compatibility": "Universelle Kompatibilität",
  "Compatible with major chipper brands including Vermeer, Bandit, Morbark, Woodsman, and more": "Kompatibel mit großen Häckslermarken wie Vermeer, Bandit, Morbark, Woodsman und mehr",
  "Impact Resistance": "Schlagfestigkeit",
  "Designed to withstand high-impact chipping forces and occasional metal contaminants in wood material": "Entwickelt, um hohen Schlagkräften und gelegentlichen Metallverunreinigungen im Holzmaterial standzuhalten",
  "Applications": "Anwendungen",
  "Our chipper blades are widely used across forestry, landscaping, and biomass energy industries": "Unsere Häckslermesser werden häufig in der Forstwirtschaft, im Landschaftsbau und in der Biomasseenergiebranche eingesetzt",
  "Forestry Operations": "Forstbetriebe",
  "Processing logs, branches, and forest residue into uniform wood chips for pulp and paper production": "Verarbeitung von Baumstämmen, Ästen und Waldresten zu einheitlichen Hackschnitzeln für die Zellstoff- und Papierproduktion",
  "Landscaping Services": "Landschaftsbau-Dienstleistungen",
  "Chipping tree trimming debris, brush, and yard waste into mulch and landscaping materials": "Zerkleinern von Baumabfällen, Gestrüpp und Gartenabfällen zu Mulch und Landschaftsbaumaterialien",
  "Biomass Energy": "Biomasseenergie",
  "Creating uniform wood chips for biomass power plants and renewable energy production": "Erzeugung einheitlicher Hackschnitzel für Biomassekraftwerke und die Erzeugung erneuerbarer Energien",
  "Pulp & Paper Industry": "Zellstoff- und Papierindustrie",
  "Producing consistent wood chips meeting specific size requirements for pulp manufacturing": "Herstellung gleichbleibender Holzhackschnitzel, die spezifische Größenanforderungen für die Zellstoffherstellung erfüllen",
  "Recycling Centers": "Recyclingzentren",
  "Processing construction lumber, pallets, and wood waste into recyclable wood products": "Verarbeitung von Bauholz, Paletten und Holzabfällen zu recycelbaren Holzprodukten",
  "Lumber Mills": "Holzmühlen",
  "Converting bark, slabs, edgings, and mill residue into valuable wood chips and mulch": "Verwandelt Rinde, Platten, Kanten und Mühlenreste in wertvolle Hackschnitzel und Mulch",
  "Blade Manufacturing & Quality": "Klingenherstellung und Qualität",
  "Understand the precision manufacturing processes that ensure superior chipper blade performance": "Verstehen Sie die Präzisionsfertigungsprozesse, die eine hervorragende Leistung der Hackmesser gewährleisten",
  "High-Grade Steel Selection": "Auswahl hochwertiger Stähle",
  "Our chipper blades are manufactured from premium chromium steel containing a minimum of 8% chromium for exceptional hardness and wear resistance. Material options include cost-effective carbon steel, standard chromium steel, premium tool steels (WNr.1.2235, K306, K329), and carbide-inlay designs for maximum durability. Each material is certified and traceable for quality assurance.": "Unsere Häckslermesser werden aus hochwertigem Chromstahl mit einem Chromgehalt von mindestens 8 % für außergewöhnliche Härte und Verschleißfestigkeit hergestellt. ",
  "Precision Machining Process": "Präzisionsbearbeitungsprozess",
  "Blades are cut to precise dimensions using advanced sawing and milling equipment. Bolt holes and mounting features are drilled with precision positioning for proper fitment. The rectangular blade shape (typically 40-100mm width x 150-800mm length) is machined to tight tolerances ensuring proper installation and balanced cutting forces across the chipper drum or disk.": "Mit modernen Säge- und Fräsgeräten werden die Klingen auf präzise Abmessungen zugeschnitten. ",
  "Controlled Heat Treatment": "Kontrollierte Wärmebehandlung",
  "Blades undergo precision heat treatment in vacuum furnaces to achieve optimal hardness of HRC 54-57. The controlled heating, quenching, and tempering process ensures uniform hardness throughout the blade while maintaining core toughness to resist impact from rocks and metal contaminants. This process is critical for achieving the balance of edge retention and durability required for industrial chipping operations.": "Die Klingen werden in Vakuumöfen einer präzisen Wärmebehandlung unterzogen, um eine optimale Härte von HRC 54–57 zu erreichen. ",
  "Precision Grinding & Quality Control": "Präzisionsschleifen und Qualitätskontrolle",
  "Final grinding creates the cutting edge with proper bevel angle and sharpness for optimal chipping performance. Each blade undergoes comprehensive inspection including dimensional verification, hardness testing, edge straightness measurement, and visual inspection for defects. Quality certifications and material traceability documentation are provided with each order to ensure consistent performance.": "Durch das abschließende Schleifen erhält die Schneidkante den richtigen Fasenwinkel und die richtige Schärfe für eine optimale Zerspanungsleistung. ",
  "Standard & Custom Options": "Standard- und benutzerdefinierte Optionen",
  "Choose from standard chipper blades or custom-engineered solutions for your specific equipment": "Wählen Sie zwischen Standard-Häckslermessern oder maßgeschneiderten Lösungen für Ihre spezifische Ausrüstung",
  "Standard Features": "Standardfunktionen",
  "Custom Options": "Benutzerdefinierte Optionen",
  "Need help selecting the right chipper blades?": "Benötigen Sie Hilfe bei der Auswahl der richtigen Hackmesser?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about wood chipper blades": "Häufige Fragen zu Holzhackermessern",
  "Blade life varies significantly based on wood type, material diameter, presence of dirt/rocks, and maintenance practices. In clean wood applications, chromium steel blades typically last 150-300 hours of continuous operation. Carbide-inlay blades can last 800-1200 hours when avoiding metal contaminants. Proper blade maintenance, rotation, and avoiding dirt-contaminated wood maximize blade life.": "Die Lebensdauer der Klinge variiert erheblich je nach Holzart, Materialdurchmesser, Vorhandensein von Schmutz/Steinen und Wartungspraktiken. ",
  "Yes, chipper blades can be professionally sharpened multiple times before replacement. Most blades can be resharpened 3-6 times depending on wear severity and original blade thickness. Professional sharpening services restore proper bevel angle and edge geometry. Regular sharpening before severe dulling occurs maximizes total blade life and maintains optimal chip quality. We offer sharpening services with quick turnaround.": "Ja, Hackmesser können vor dem Austausch mehrmals professionell geschärft werden. ",
  "Signs include larger chip sizes, increased power consumption, excessive fines or dust, visible edge rounding or nicks, and increased feeding force required. Inspect blades every 50-100 operating hours for wear. Replace or sharpen when cutting edge shows significant rounding or if nicks exceed 3mm depth. Rotating blade positions during inspection helps ensure even wear across all cutting edges.": "Zu den Anzeichen gehören größere Chipgrößen, erhöhter Stromverbrauch, übermäßiger Feinanteil oder Staub, sichtbare Kantenrundungen oder Kerben sowie eine erhöhte erforderliche Vorschubkraft. ",
  "For occasional use with clean wood, carbon steel offers good value. For professional/commercial operations, chromium steel (8%+ Cr) provides the best balance of performance and cost. For high-volume production or abrasive applications, consider premium tool steels. Carbide-inlay blades are recommended for maximum productivity in continuous operations despite higher initial cost. Our team can recommend optimal materials based on your specific usage patterns.": "Für den gelegentlichen Einsatz mit sauberem Holz bietet Kohlenstoffstahl ein gutes Preis-Leistungs-Verhältnis. ",
  "Check your chipper's operator manual for blade specifications including length, width, thickness, and bolt hole pattern. Measure existing blades if manual is unavailable. Provide chipper brand and model number - we maintain specifications for most major brands (Vermeer, Bandit, Morbark, etc.). Send us photos or measurements of existing blades for confirmation. We can cross-reference and provide exact replacement blades.": "Sehen Sie in der Bedienungsanleitung Ihres Häckslers nach, welche Klingenspezifikationen sie haben, einschließlich Länge, Breite, Dicke und Muster der Bolzenlöcher. ",
  "Yes, comprehensive installation instructions, torque specifications, and maintenance guidelines are provided with blade orders. We offer technical support for proper blade installation, adjustment, and troubleshooting. Safety information and best practices documentation are included. Our technical team is available to answer questions about blade installation, sharpening schedules, and performance optimization for your specific application.": "Ja, umfassende Installationsanweisungen, Drehmomentspezifikationen und Wartungsrichtlinien werden mit der Klingenbestellung geliefert. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Download Chipper Blade Catalog": "Laden Sie den Katalog für Hackmesser herunter",
  "Get detailed specifications, dimensional charts, material grades, and compatibility information for our complete range of wood chipper blades. Includes maintenance guidelines and troubleshooting tips.": "Erhalten Sie detaillierte Spezifikationen, Maßtabellen, Materialqualitäten und Kompatibilitätsinformationen für unser komplettes Sortiment an Holzhackermessern. "
}