{
  "Wood Chipper Blades": "Cuchillas para trituradora de madera",
  "Premium chipper blades manufactured from high-grade chromium steel for industrial wood processing equipment. Precision ground with hardness ratings of HRC 54-57, delivering exceptional cutting performance and extended service life for forestry, landscaping, and biomass energy applications.": "Cuchillas trituradoras de primera calidad fabricadas con acero al cromo de alta calidad para equipos industriales de procesamiento de madera. ",
  "Request Quote": "Solicitar Cotización",
  "View Specs": "Ver especificaciones",
  "Technical Specifications": "Especificaciones técnicas",
  "Industrial-grade chipper blades engineered for demanding wood processing applications": "Cuchillas trituradoras de calidad industrial diseñadas para aplicaciones exigentes de procesamiento de madera",
  "Blade Dimensions": "Dimensiones de la hoja",
  "Width: 40mm - 100mm (1.5\" - 4\")": "Ancho: 40 mm - 100 mm (1,5\" - 4\")",
  "Length: 150mm - 800mm (6\" - 32\")": "Longitud: 150 mm - 800 mm (6\" - 32\")",
  "Thickness: 6mm - 25mm": "Espesor: 6 mm - 25 mm",
  "Custom sizes available": "Tamaños personalizados disponibles",
  "Material Options": "Opciones de materiales",
  "Carbon Steel (cost-effective)": "Acero al carbono (rentable)",
  "Chromium Steel (8%+ Cr, standard)": "Acero al cromo (8%+ Cr, estándar)",
  "Tool Steel (premium performance)": "Acero para herramientas (rendimiento superior)",
  "Carbide Inlay (maximum durability)": "Incrustación de carburo (máxima durabilidad)",
  "Performance Features": "Características de rendimiento",
  "Hardness: HRC 54-57 (standard)": "Dureza: HRC 54-57 (estándar)",
  "Material capacity: 6\" - 24\" diameter": "Capacidad de material: 6\" - 24\" de diámetro",
  "Compatible with disk & drum chippers": "Compatible con astilladoras de disco y tambor",
  "Double-edge design available": "Diseño de doble filo disponible",
  "Why Choose Our Chipper Blades?": "¿Por qué elegir nuestras cuchillas astilladoras?",
  "Discover the key advantages that make our chipper blades the preferred choice for wood processing": "Descubra las ventajas clave que hacen de nuestras cuchillas chipeadoras la opción preferida para el procesamiento de madera.",
  "Premium Chromium Steel": "Acero al cromo de primera calidad.",
  "Minimum 8% chromium content provides exceptional hardness and corrosion resistance for extended service life": "Un contenido mínimo de cromo del 8 % proporciona una dureza y resistencia a la corrosión excepcionales para una vida útil prolongada",
  "Precision Heat Treatment": "Tratamiento térmico de precisión",
  "Controlled heat treatment achieves optimal HRC 54-57 hardness while maintaining toughness to resist impact": "El tratamiento térmico controlado logra una dureza HRC 54-57 óptima mientras mantiene la dureza para resistir el impacto.",
  "Clean Chip Production": "Producción limpia de virutas",
  "Sharp, precision-ground edges produce uniform wood chips ideal for pulp, biomass, and mulch applications": "Los bordes afilados y rectificados con precisión producen astillas de madera uniformes, ideales para aplicaciones de pulpa, biomasa y mantillo.",
  "Re-sharpenable Design": "Diseño reafilable",
  "Blades can be professionally re-sharpened multiple times, reducing long-term operational costs": "Las hojas se pueden reafilar profesionalmente varias veces, lo que reduce los costos operativos a largo plazo.",
  "Universal Compatibility": "Compatibilidad universal",
  "Compatible with major chipper brands including Vermeer, Bandit, Morbark, Woodsman, and more": "Compatible con las principales marcas de astilladoras, incluidas Vermeer, Bandit, Morbark, Woodsman y más.",
  "Impact Resistance": "Resistencia al impacto",
  "Designed to withstand high-impact chipping forces and occasional metal contaminants in wood material": "Diseñado para soportar fuerzas de corte de alto impacto y contaminantes metálicos ocasionales en material de madera.",
  "Applications": "Aplicaciones",
  "Our chipper blades are widely used across forestry, landscaping, and biomass energy industries": "Nuestras cuchillas trituradoras se utilizan ampliamente en las industrias de silvicultura, paisajismo y energía de biomasa.",
  "Forestry Operations": "Operaciones Forestales",
  "Processing logs, branches, and forest residue into uniform wood chips for pulp and paper production": "Procesamiento de troncos, ramas y residuos forestales para obtener astillas de madera uniformes para la producción de pulpa y papel.",
  "Landscaping Services": "Servicios de paisajismo",
  "Chipping tree trimming debris, brush, and yard waste into mulch and landscaping materials": "Cortar restos de poda de árboles, maleza y desechos del jardín para convertirlos en mantillo y materiales de jardinería.",
  "Biomass Energy": "Energía de biomasa",
  "Creating uniform wood chips for biomass power plants and renewable energy production": "Creación de astillas de madera uniformes para centrales eléctricas de biomasa y producción de energía renovable",
  "Pulp & Paper Industry": "Industria de pulpa y papel",
  "Producing consistent wood chips meeting specific size requirements for pulp manufacturing": "Producir astillas de madera consistentes que cumplan con los requisitos de tamaño específicos para la fabricación de pulpa.",
  "Recycling Centers": "Centros de reciclaje",
  "Processing construction lumber, pallets, and wood waste into recyclable wood products": "Procesamiento de madera de construcción, paletas y desechos de madera para convertirlos en productos de madera reciclables.",
  "Lumber Mills": "Aserraderos",
  "Converting bark, slabs, edgings, and mill residue into valuable wood chips and mulch": "Convertir cortezas, losas, bordes y residuos de aserrado en valiosas astillas de madera y mantillo",
  "Blade Manufacturing & Quality": "Fabricación y calidad de cuchillas",
  "Understand the precision manufacturing processes that ensure superior chipper blade performance": "Comprender los procesos de fabricación de precisión que garantizan un rendimiento superior de las cuchillas de la trituradora.",
  "High-Grade Steel Selection": "Selección de acero de alta calidad",
  "Our chipper blades are manufactured from premium chromium steel containing a minimum of 8% chromium for exceptional hardness and wear resistance. Material options include cost-effective carbon steel, standard chromium steel, premium tool steels (WNr.1.2235, K306, K329), and carbide-inlay designs for maximum durability. Each material is certified and traceable for quality assurance.": "Nuestras cuchillas para trituradoras están fabricadas con acero al cromo de primera calidad que contiene un mínimo de 8 % de cromo para una dureza y resistencia al desgaste excepcionales. ",
  "Precision Machining Process": "Proceso de mecanizado de precisión",
  "Blades are cut to precise dimensions using advanced sawing and milling equipment. Bolt holes and mounting features are drilled with precision positioning for proper fitment. The rectangular blade shape (typically 40-100mm width x 150-800mm length) is machined to tight tolerances ensuring proper installation and balanced cutting forces across the chipper drum or disk.": "Las hojas se cortan a dimensiones precisas utilizando equipos avanzados de aserrado y fresado. ",
  "Controlled Heat Treatment": "Tratamiento térmico controlado",
  "Blades undergo precision heat treatment in vacuum furnaces to achieve optimal hardness of HRC 54-57. The controlled heating, quenching, and tempering process ensures uniform hardness throughout the blade while maintaining core toughness to resist impact from rocks and metal contaminants. This process is critical for achieving the balance of edge retention and durability required for industrial chipping operations.": "Las hojas se someten a un tratamiento térmico de precisión en hornos de vacío para lograr una dureza óptima de HRC 54-57. ",
  "Precision Grinding & Quality Control": "Rectificado de precisión y control de calidad",
  "Final grinding creates the cutting edge with proper bevel angle and sharpness for optimal chipping performance. Each blade undergoes comprehensive inspection including dimensional verification, hardness testing, edge straightness measurement, and visual inspection for defects. Quality certifications and material traceability documentation are provided with each order to ensure consistent performance.": "El rectificado final crea el filo con el ángulo de bisel y el filo adecuados para un rendimiento de astillado óptimo. ",
  "Standard & Custom Options": "Opciones estándar y personalizadas",
  "Choose from standard chipper blades or custom-engineered solutions for your specific equipment": "Elija entre cuchillas chipeadoras estándar o soluciones diseñadas a medida para su equipo específico",
  "Standard Features": "Características estándar",
  "Custom Options": "Opciones personalizadas",
  "Need help selecting the right chipper blades?": "¿Necesita ayuda para seleccionar las cuchillas trituradoras adecuadas?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about wood chipper blades": "Preguntas comunes sobre las cuchillas de la trituradora de madera",
  "Blade life varies significantly based on wood type, material diameter, presence of dirt/rocks, and maintenance practices. In clean wood applications, chromium steel blades typically last 150-300 hours of continuous operation. Carbide-inlay blades can last 800-1200 hours when avoiding metal contaminants. Proper blade maintenance, rotation, and avoiding dirt-contaminated wood maximize blade life.": "La vida útil de la hoja varía significativamente según el tipo de madera, el diámetro del material, la presencia de tierra/rocas y las prácticas de mantenimiento. ",
  "Yes, chipper blades can be professionally sharpened multiple times before replacement. Most blades can be resharpened 3-6 times depending on wear severity and original blade thickness. Professional sharpening services restore proper bevel angle and edge geometry. Regular sharpening before severe dulling occurs maximizes total blade life and maintains optimal chip quality. We offer sharpening services with quick turnaround.": "Sí, las cuchillas de la trituradora se pueden afilar profesionalmente varias veces antes de reemplazarlas. ",
  "Signs include larger chip sizes, increased power consumption, excessive fines or dust, visible edge rounding or nicks, and increased feeding force required. Inspect blades every 50-100 operating hours for wear. Replace or sharpen when cutting edge shows significant rounding or if nicks exceed 3mm depth. Rotating blade positions during inspection helps ensure even wear across all cutting edges.": "Los signos incluyen chips de mayor tamaño, mayor consumo de energía, exceso de finos o polvo, bordes redondeados o melladuras visibles y mayor fuerza de alimentación requerida. ",
  "For occasional use with clean wood, carbon steel offers good value. For professional/commercial operations, chromium steel (8%+ Cr) provides the best balance of performance and cost. For high-volume production or abrasive applications, consider premium tool steels. Carbide-inlay blades are recommended for maximum productivity in continuous operations despite higher initial cost. Our team can recommend optimal materials based on your specific usage patterns.": "Para uso ocasional con madera limpia, el acero al carbono ofrece una buena relación calidad-precio. ",
  "Check your chipper's operator manual for blade specifications including length, width, thickness, and bolt hole pattern. Measure existing blades if manual is unavailable. Provide chipper brand and model number - we maintain specifications for most major brands (Vermeer, Bandit, Morbark, etc.). Send us photos or measurements of existing blades for confirmation. We can cross-reference and provide exact replacement blades.": "Consulte el manual del operador de su astilladora para conocer las especificaciones de la hoja, incluidos el largo, el ancho, el grosor y el patrón de orificios para los pernos. ",
  "Yes, comprehensive installation instructions, torque specifications, and maintenance guidelines are provided with blade orders. We offer technical support for proper blade installation, adjustment, and troubleshooting. Safety information and best practices documentation are included. Our technical team is available to answer questions about blade installation, sharpening schedules, and performance optimization for your specific application.": "Sí, con los pedidos de hojas se proporcionan instrucciones completas de instalación, especificaciones de torsión y pautas de mantenimiento. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Chipper Blade Catalog": "Descargar Catálogo de Cuchillas Chipeadoras",
  "Get detailed specifications, dimensional charts, material grades, and compatibility information for our complete range of wood chipper blades. Includes maintenance guidelines and troubleshooting tips.": "Obtenga especificaciones detalladas, tablas dimensionales, grados de materiales e información de compatibilidad para nuestra gama completa de hojas para trituradoras de madera. "
}