{
  "Wood Chipper Blades": "شفرات تقطيع الخشب",
  "Premium chipper blades manufactured from high-grade chromium steel for industrial wood processing equipment. Precision ground with hardness ratings of HRC 54-57, delivering exceptional cutting performance and extended service life for forestry, landscaping, and biomass energy applications.": "شفرات تقطيع ممتازة مصنوعة من فولاذ الكروم عالي الجودة لمعدات معالجة الأخشاب الصناعية. ",
  "Request Quote": "طلب اقتباس",
  "View Specs": "عرض المواصفات",
  "Technical Specifications": "المواصفات الفنية",
  "Industrial-grade chipper blades engineered for demanding wood processing applications": "شفرات تقطيع من الدرجة الصناعية مصممة لتطبيقات معالجة الأخشاب الصعبة",
  "Blade Dimensions": "أبعاد الشفرة",
  "Width: 40mm - 100mm (1.5\" - 4\")": "العرض: 40 ملم - 100 ملم (1.5 بوصة - 4 بوصات)",
  "Length: 150mm - 800mm (6\" - 32\")": "الطول: 150 مم - 800 مم (6 بوصة - 32 بوصة)",
  "Thickness: 6mm - 25mm": "السُمك: 6 مم - 25 مم",
  "Custom sizes available": "الأحجام المخصصة المتاحة",
  "Material Options": "خيارات المواد",
  "Carbon Steel (cost-effective)": "الصلب الكربوني (فعال من حيث التكلفة)",
  "Chromium Steel (8%+ Cr, standard)": "فولاذ الكروم (8% + كروم، قياسي)",
  "Tool Steel (premium performance)": "أداة الصلب (الأداء المتميز)",
  "Carbide Inlay (maximum durability)": "كربيد البطانة (أقصى قدر من المتانة)",
  "Performance Features": "ميزات الأداء",
  "Hardness: HRC 54-57 (standard)": "الصلابة: HRC 54-57 (قياسي)",
  "Material capacity: 6\" - 24\" diameter": "سعة المواد: قطر 6 بوصة - 24 بوصة",
  "Compatible with disk & drum chippers": "متوافق مع آلات تقطيع الأقراص والطبل",
  "Double-edge design available": "تصميم ذو حافة مزدوجة متاح",
  "Why Choose Our Chipper Blades?": "لماذا تختار شفرات التقطيع الخاصة بنا؟",
  "Discover the key advantages that make our chipper blades the preferred choice for wood processing": "اكتشف المزايا الرئيسية التي تجعل شفرات التقطيع لدينا هي الخيار المفضل لمعالجة الأخشاب",
  "Premium Chromium Steel": "فولاذ الكروم الفاخر",
  "Minimum 8% chromium content provides exceptional hardness and corrosion resistance for extended service life": "يوفر محتوى الكروم بنسبة 8% على الأقل صلابة استثنائية ومقاومة للتآكل لإطالة عمر الخدمة",
  "Precision Heat Treatment": "المعالجة الحرارية الدقيقة",
  "Controlled heat treatment achieves optimal HRC 54-57 hardness while maintaining toughness to resist impact": "تحقق المعالجة الحرارية التي يتم التحكم فيها صلابة HRC 54-57 المثالية مع الحفاظ على المتانة لمقاومة الصدمات",
  "Clean Chip Production": "إنتاج الرقائق النظيفة",
  "Sharp, precision-ground edges produce uniform wood chips ideal for pulp, biomass, and mulch applications": "تنتج الحواف الحادة والدقيقة الأرض رقائق خشبية موحدة مثالية لتطبيقات اللب والكتلة الحيوية والمهاد",
  "Re-sharpenable Design": "تصميم قابل لإعادة الشحذ",
  "Blades can be professionally re-sharpened multiple times, reducing long-term operational costs": "يمكن إعادة شحذ الشفرات بشكل احترافي عدة مرات، مما يقلل من تكاليف التشغيل على المدى الطويل",
  "Universal Compatibility": "التوافق العالمي",
  "Compatible with major chipper brands including Vermeer, Bandit, Morbark, Woodsman, and more": "متوافق مع العلامات التجارية الكبرى للتقطيع بما في ذلك Vermeer وBandit وMorbark وWoodsman والمزيد",
  "Impact Resistance": "مقاومة التأثير",
  "Designed to withstand high-impact chipping forces and occasional metal contaminants in wood material": "مصممة لتحمل قوى التقطيع عالية التأثير والملوثات المعدنية العرضية في المواد الخشبية",
  "Applications": "التطبيقات",
  "Our chipper blades are widely used across forestry, landscaping, and biomass energy industries": "تُستخدم شفرات التقطيع الخاصة بنا على نطاق واسع في صناعات الغابات والمناظر الطبيعية وطاقة الكتلة الحيوية",
  "Forestry Operations": "عمليات الغابات",
  "Processing logs, branches, and forest residue into uniform wood chips for pulp and paper production": "معالجة جذوع الأشجار والفروع وبقايا الغابات وتحويلها إلى رقائق خشبية موحدة لإنتاج اللب والورق",
  "Landscaping Services": "خدمات تنسيق الحدائق",
  "Chipping tree trimming debris, brush, and yard waste into mulch and landscaping materials": "تقطيع حطام تشذيب الأشجار والفرشاة ونفايات الفناء إلى مواد نشارة وتنسيق الحدائق",
  "Biomass Energy": "طاقة الكتلة الحيوية",
  "Creating uniform wood chips for biomass power plants and renewable energy production": "إنشاء رقائق خشبية موحدة لمحطات طاقة الكتلة الحيوية وإنتاج الطاقة المتجددة",
  "Pulp & Paper Industry": "صناعة اللب والورق",
  "Producing consistent wood chips meeting specific size requirements for pulp manufacturing": "إنتاج رقائق خشبية متسقة تلبي متطلبات الحجم المحددة لتصنيع اللب",
  "Recycling Centers": "مراكز إعادة التدوير",
  "Processing construction lumber, pallets, and wood waste into recyclable wood products": "معالجة خشب البناء والمنصات ونفايات الخشب إلى منتجات خشبية قابلة لإعادة التدوير",
  "Lumber Mills": "مصانع الأخشاب",
  "Converting bark, slabs, edgings, and mill residue into valuable wood chips and mulch": "تحويل اللحاء والألواح والحواف وبقايا المطاحن إلى رقائق خشبية ثمينة ونشارة",
  "Blade Manufacturing & Quality": "تصنيع الشفرة وجودتها",
  "Understand the precision manufacturing processes that ensure superior chipper blade performance": "فهم عمليات التصنيع الدقيقة التي تضمن الأداء الفائق لشفرات التقطيع",
  "High-Grade Steel Selection": "اختيار الصلب عالي الجودة",
  "Our chipper blades are manufactured from premium chromium steel containing a minimum of 8% chromium for exceptional hardness and wear resistance. Material options include cost-effective carbon steel, standard chromium steel, premium tool steels (WNr.1.2235, K306, K329), and carbide-inlay designs for maximum durability. Each material is certified and traceable for quality assurance.": "يتم تصنيع شفرات التقطيع الخاصة بنا من فولاذ الكروم الفاخر الذي يحتوي على ما لا يقل عن 8% من الكروم للحصول على صلابة استثنائية ومقاومة للتآكل. ",
  "Precision Machining Process": "عملية التصنيع الدقيقة",
  "Blades are cut to precise dimensions using advanced sawing and milling equipment. Bolt holes and mounting features are drilled with precision positioning for proper fitment. The rectangular blade shape (typically 40-100mm width x 150-800mm length) is machined to tight tolerances ensuring proper installation and balanced cutting forces across the chipper drum or disk.": "يتم قطع الشفرات بأبعاد دقيقة باستخدام معدات النشر والطحن المتقدمة. ",
  "Controlled Heat Treatment": "المعالجة الحرارية التي تسيطر عليها",
  "Blades undergo precision heat treatment in vacuum furnaces to achieve optimal hardness of HRC 54-57. The controlled heating, quenching, and tempering process ensures uniform hardness throughout the blade while maintaining core toughness to resist impact from rocks and metal contaminants. This process is critical for achieving the balance of edge retention and durability required for industrial chipping operations.": "تخضع الشفرات للمعالجة الحرارية الدقيقة في أفران التفريغ لتحقيق الصلابة المثلى لـ HRC 54-57. ",
  "Precision Grinding & Quality Control": "الطحن الدقيق ومراقبة الجودة",
  "Final grinding creates the cutting edge with proper bevel angle and sharpness for optimal chipping performance. Each blade undergoes comprehensive inspection including dimensional verification, hardness testing, edge straightness measurement, and visual inspection for defects. Quality certifications and material traceability documentation are provided with each order to ensure consistent performance.": "يؤدي الطحن النهائي إلى إنشاء حافة القطع بزاوية مشطوفة وحدة مناسبة لأداء التقطيع الأمثل. ",
  "Standard & Custom Options": "الخيارات القياسية والمخصصة",
  "Choose from standard chipper blades or custom-engineered solutions for your specific equipment": "اختر من بين شفرات التقطيع القياسية أو الحلول المصممة خصيصًا لمعداتك المحددة",
  "Standard Features": "الميزات القياسية",
  "Custom Options": "خيارات مخصصة",
  "Need help selecting the right chipper blades?": "هل تحتاج إلى مساعدة في اختيار شفرات التقطيع المناسبة؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about wood chipper blades": "الأسئلة الشائعة حول شفرات تقطيع الخشب",
  "Blade life varies significantly based on wood type, material diameter, presence of dirt/rocks, and maintenance practices. In clean wood applications, chromium steel blades typically last 150-300 hours of continuous operation. Carbide-inlay blades can last 800-1200 hours when avoiding metal contaminants. Proper blade maintenance, rotation, and avoiding dirt-contaminated wood maximize blade life.": "يختلف عمر الشفرة بشكل كبير بناءً على نوع الخشب وقطر المادة ووجود الأوساخ/الصخور وممارسات الصيانة. ",
  "Yes, chipper blades can be professionally sharpened multiple times before replacement. Most blades can be resharpened 3-6 times depending on wear severity and original blade thickness. Professional sharpening services restore proper bevel angle and edge geometry. Regular sharpening before severe dulling occurs maximizes total blade life and maintains optimal chip quality. We offer sharpening services with quick turnaround.": "نعم، يمكن شحذ شفرات التقطيع بطريقة احترافية عدة مرات قبل الاستبدال. ",
  "Signs include larger chip sizes, increased power consumption, excessive fines or dust, visible edge rounding or nicks, and increased feeding force required. Inspect blades every 50-100 operating hours for wear. Replace or sharpen when cutting edge shows significant rounding or if nicks exceed 3mm depth. Rotating blade positions during inspection helps ensure even wear across all cutting edges.": "تتضمن العلامات أحجامًا أكبر للرقائق، وزيادة استهلاك الطاقة، والغرامات أو الغبار المفرط، وتقريب الحواف أو الشقوق المرئية، وزيادة قوة التغذية المطلوبة. ",
  "For occasional use with clean wood, carbon steel offers good value. For professional/commercial operations, chromium steel (8%+ Cr) provides the best balance of performance and cost. For high-volume production or abrasive applications, consider premium tool steels. Carbide-inlay blades are recommended for maximum productivity in continuous operations despite higher initial cost. Our team can recommend optimal materials based on your specific usage patterns.": "للاستخدام العرضي مع الخشب النظيف، يوفر الفولاذ الكربوني قيمة جيدة. ",
  "Check your chipper's operator manual for blade specifications including length, width, thickness, and bolt hole pattern. Measure existing blades if manual is unavailable. Provide chipper brand and model number - we maintain specifications for most major brands (Vermeer, Bandit, Morbark, etc.). Send us photos or measurements of existing blades for confirmation. We can cross-reference and provide exact replacement blades.": "تحقق من دليل مشغل ماكينة التقطيع الخاصة بك لمعرفة مواصفات الشفرة بما في ذلك الطول والعرض والسمك ونمط فتحة الترباس. ",
  "Yes, comprehensive installation instructions, torque specifications, and maintenance guidelines are provided with blade orders. We offer technical support for proper blade installation, adjustment, and troubleshooting. Safety information and best practices documentation are included. Our technical team is available to answer questions about blade installation, sharpening schedules, and performance optimization for your specific application.": "نعم، يتم توفير تعليمات التثبيت الشاملة ومواصفات عزم الدوران وإرشادات الصيانة مع طلبات الشفرات. ",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "Download Chipper Blade Catalog": "قم بتنزيل كتالوج Chipper Blade",
  "Get detailed specifications, dimensional charts, material grades, and compatibility information for our complete range of wood chipper blades. Includes maintenance guidelines and troubleshooting tips.": "احصل على المواصفات التفصيلية ومخططات الأبعاد ودرجات المواد ومعلومات التوافق لمجموعتنا الكاملة من شفرات تقطيع الأخشاب. "
}