{
  "Crusher Blade": "Lame de broyeur",
  "Premium crusher blades for plastic granulators, shredders, and recycling equipment. Manufactured from high-quality alloy steel (D2, SKD11, 9CrSi) with hardness ratings of HRC 56-60, delivering exceptional wear resistance and extended service life for processing plastic, rubber, and industrial waste materials.": "Lames de broyeur haut de gamme pour granulateurs de plastique, broyeurs et équipements de recyclage. ",
  "Request Quote": "Demander un devis",
  "View Specs": "Voir les spécifications",
  "Technical Specifications": "Spécifications techniques",
  "Industrial-grade crusher blades engineered for high-performance plastic recycling": "Lames de broyeur de qualité industrielle conçues pour un recyclage du plastique haute performance",
  "Material Options": "Options matérielles",
  "High Carbon Steel (high hardness)": "Acier à haute teneur en carbone (haute dureté)",
  "D2 Tool Steel (premium grade)": "Acier à outils D2 (qualité supérieure)",
  "SKD11 (superior wear resistance)": "SKD11 (résistance à l'usure supérieure)",
  "Hard Alloy (HSS, carbide tipped)": "Alliage dur (HSS, pointe en carbure)",
  "Blade Types": "Types de lames",
  "Claw Type (aggressive cutting)": "Type de griffe (coupe agressive)",
  "Flat Type (thin-walled products)": "Type plat (produits à parois minces)",
  "Flake Type (general purpose)": "Type de flocon (usage général)",
  "V Type (precision cutting)": "Type V (coupe de précision)",
  "Performance Features": "Caractéristiques de performances",
  "Hardness: HRC 56-60": "Dureté : HRC 56-60",
  "Service life: 150-1200 hours": "Durée de vie : 150-1200 heures",
  "Materials: Plastic, rubber, film": "Matériaux : plastique, caoutchouc, film",
  "Custom dimensions available": "Dimensions personnalisées disponibles",
  "Why Choose Our Crusher Blades?": "Pourquoi choisir nos lames de broyeur ?",
  "Discover the key advantages that make our crusher blades the preferred choice for plastic recycling": "Découvrez les principaux avantages qui font de nos lames de broyeur le choix privilégié pour le recyclage du plastique",
  "Premium Alloy Steel": "Acier allié de qualité supérieure",
  "High-quality D2, SKD11, and 9CrSi alloy steels provide exceptional hardness and impact strength": "Les aciers alliés D2, SKD11 et 9CrSi de haute qualité offrent une dureté et une résistance aux chocs exceptionnelles",
  "Extended Service Life": "Durée de vie prolongée",
  "HSS blades: 150-300 hours, hard alloy blades: 800-1200 hours continuous operation": "Lames HSS : 150-300 heures, lames en alliage dur : 800-1200 heures de fonctionnement continu",
  "Multiple Blade Types": "Plusieurs types de lames",
  "Claw, flat, flake, and V-type designs optimize performance for different material types": "Les conceptions à griffes, plates, en flocons et en V optimisent les performances pour différents types de matériaux",
  "Precision Manufacturing": "Fabrication de précision",
  "Advanced CNC machining and precision grinding ensure consistent cutting performance": "L'usinage CNC avancé et le meulage de précision garantissent des performances de coupe constantes.",
  "Versatile Applications": "Applications polyvalentes",
  "Process bottles, films, pipes, barrels, and various plastic waste materials efficiently": "Traitez efficacement les bouteilles, les films, les tuyaux, les barils et divers déchets plastiques",
  "Impact Resistance": "Résistance aux chocs",
  "Superior toughness resists chipping and cracking from hard contaminants and metal fasteners": "Résistance supérieure à l'écaillage et aux fissures causées par les contaminants durs et les attaches métalliques",
  "Applications": "Applications",
  "Our crusher blades are widely used in plastic recycling and waste processing industries": "Nos lames de broyeur sont largement utilisées dans les industries de recyclage du plastique et de traitement des déchets.",
  "Plastic Bottle Recycling": "Recyclage des bouteilles en plastique",
  "Crushing PET bottles, containers, and hollow plastic products for recycling and reprocessing": "Broyage de bouteilles, conteneurs et produits en plastique creux en PET pour recyclage et retraitement",
  "Film & Packaging": "Films et emballages",
  "Granulating plastic films, blown plastic, and packaging materials into recyclable flakes": "Granulation de films plastiques, de plastique soufflé et de matériaux d'emballage en flocons recyclables",
  "Pipe & Tube Processing": "Traitement des tuyaux et tubes",
  "Crushing plastic pipes, tubing, and profiles into uniform granules for reuse": "Broyage de tuyaux, tubes et profilés en plastique en granulés uniformes pour réutilisation",
  "Industrial Waste": "Déchets industriels",
  "Processing injection molding runners, sprues, and manufacturing waste plastics": "Traitement des canaux de moulage par injection, des carottes de coulée et des déchets plastiques de fabrication",
  "Rubber Recycling": "Recyclage du caoutchouc",
  "Granulating rubber materials, seals, and automotive rubber components": "Granulation de matériaux en caoutchouc, de joints et de composants en caoutchouc pour automobiles",
  "Electronics Waste": "Déchets électroniques",
  "Crushing plastic housings, computer cases, and electronic component packaging": "Broyage de boîtiers en plastique, de boîtiers d'ordinateurs et d'emballages de composants électroniques",
  "Blade Design & Manufacturing": "Conception et fabrication de lames",
  "Understand the advanced engineering behind our high-performance crusher blades": "Comprendre l'ingénierie avancée derrière nos lames de concasseur haute performance",
  "High-Grade Alloy Steel": "Acier allié de haute qualité",
  "Our crusher blades are manufactured from premium alloy steels including D2, SKD11, HSS, 9CrSi, and T10. Each material is selected for optimal balance of hardness, wear resistance, and impact strength. High carbon steel provides excellent hardness, while alloy steel offers superior wear resistance and toughness. Material certification ensures consistent quality and performance.": "Nos lames de broyeur sont fabriquées à partir d'aciers alliés de première qualité, notamment D2, SKD11, HSS, 9CrSi et T10. ",
  "Four Blade Type Options": "Quatre options de types de lames",
  "We offer four specialized blade types: Claw type for aggressive cutting of thick materials, Flat type optimized for thin-walled products under 3mm, Flake type for general-purpose applications, and V type for precision cutting. Each design is engineered for specific material characteristics and processing requirements, ensuring optimal particle size and production efficiency.": "Nous proposons quatre types de lames spécialisées : le type à griffes pour la coupe agressive de matériaux épais, le type plat optimisé pour les produits à paroi mince de moins de 3 mm, le type à flocons pour les applications générales et le type en V pour une coupe de précision. ",
  "Precision Manufacturing Process": "Processus de fabrication de précision",
  "Our manufacturing process includes cutting by sawing machine, rough grinding by milling machine for dimensional accuracy, drilling by precision drilling machine for mounting holes, vacuum heat treatment in controlled furnaces to achieve HRC 56-60 hardness, and final precision grinding to create sharp, consistent cutting edges. This multi-step process ensures superior blade quality and performance.": "Notre processus de fabrication comprend la découpe par scie, le meulage grossier par fraiseuse pour une précision dimensionnelle, le perçage par perceuse de précision pour les trous de montage, le traitement thermique sous vide dans des fours contrôlés pour atteindre une dureté HRC 56-60 et le meulage final de précision pour créer des arêtes de coupe nettes et cohérentes. ",
  "Rigorous Quality Control": "Contrôle qualité rigoureux",
  "Every crusher blade undergoes comprehensive quality inspection including dimensional verification, hardness testing (HRC 56-60 according to customer requirements), edge sharpness evaluation, and visual inspection for defects. Dynamic testing simulates actual operating conditions to verify cutting performance. Complete quality documentation and material traceability are provided with each order.": "Chaque lame de concasseur est soumise à une inspection de qualité complète comprenant une vérification dimensionnelle, des tests de dureté (HRC 56-60 selon les exigences du client), une évaluation de la netteté des bords et une inspection visuelle des défauts. ",
  "Standard & Custom Options": "Options standard et personnalisées",
  "Choose from standard crusher blades or custom-engineered solutions for your equipment": "Choisissez parmi des lames de concasseur standard ou des solutions conçues sur mesure pour votre équipement",
  "Standard Features": "Fonctionnalités standards",
  "Custom Options": "Options personnalisées",
  "Need help selecting the right crusher blades?": "Besoin d'aide pour sélectionner les bonnes lames de concasseur ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about crusher blades": "Questions courantes sur les lames de concasseur",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "La durée de vie de la lame dépend du type de matériau, de la vitesse du concasseur et du matériau de la lame. ",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "Les lames plates fonctionnent mieux pour les produits à paroi mince (moins de 3 mm) comme les bouteilles et les films, offrant un rendement plus élevé. ",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "Oui, la plupart des lames de concasseur peuvent être réaffûtées professionnellement 2 à 4 fois en fonction de la gravité de l'usure et de la conception de la lame. ",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "Les signes incluent une taille de particule accrue, une granulation inégale, une consommation d'énergie plus élevée, un bruit excessif, des dommages ou des arrondis visibles des lames et un débit réduit. ",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "Pour un usage occasionnel ou des plastiques souples, l’acier à haute teneur en carbone offre un bon rapport qualité-prix. ",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "Oui, des instructions d'installation complètes sont fournies avec toutes les commandes de lames, y compris l'alignement correct de la lame, le réglage de l'écart et les spécifications de couple. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Crusher Blade Guide": "Télécharger le guide des lames de concasseur",
  "Get comprehensive specifications, blade type selection guide, material recommendations, and maintenance best practices for our complete range of crusher blades. Includes compatibility charts and troubleshooting tips.": "Obtenez des spécifications complètes, un guide de sélection du type de lame, des recommandations de matériaux et les meilleures pratiques de maintenance pour notre gamme complète de lames de concasseur. "
}