{
  "Crusher Blade": "Cuchilla trituradora",
  "Premium crusher blades for plastic granulators, shredders, and recycling equipment. Manufactured from high-quality alloy steel (D2, SKD11, 9CrSi) with hardness ratings of HRC 56-60, delivering exceptional wear resistance and extended service life for processing plastic, rubber, and industrial waste materials.": "Cuchillas trituradoras de primera calidad para granuladores, trituradoras y equipos de reciclaje de plástico. ",
  "Request Quote": "Solicitar Cotización",
  "View Specs": "Ver especificaciones",
  "Technical Specifications": "Especificaciones técnicas",
  "Industrial-grade crusher blades engineered for high-performance plastic recycling": "Cuchillas trituradoras de calidad industrial diseñadas para el reciclaje de plástico de alto rendimiento",
  "Material Options": "Opciones de materiales",
  "High Carbon Steel (high hardness)": "Acero con alto contenido de carbono (alta dureza)",
  "D2 Tool Steel (premium grade)": "Acero para herramientas D2 (grado premium)",
  "SKD11 (superior wear resistance)": "SKD11 (resistencia superior al desgaste)",
  "Hard Alloy (HSS, carbide tipped)": "Aleación dura (HSS, con punta de carburo)",
  "Blade Types": "Tipos de cuchillas",
  "Claw Type (aggressive cutting)": "Tipo de garra (corte agresivo)",
  "Flat Type (thin-walled products)": "Tipo plano (productos de paredes delgadas)",
  "Flake Type (general purpose)": "Tipo de escamas (propósito general)",
  "V Type (precision cutting)": "Tipo V (corte de precisión)",
  "Performance Features": "Características de rendimiento",
  "Hardness: HRC 56-60": "Dureza: HRC 56-60",
  "Service life: 150-1200 hours": "Vida útil: 150-1200 horas",
  "Materials: Plastic, rubber, film": "Materiales: Plástico, caucho, película.",
  "Custom dimensions available": "Dimensiones personalizadas disponibles",
  "Why Choose Our Crusher Blades?": "¿Por qué elegir nuestras cuchillas trituradoras?",
  "Discover the key advantages that make our crusher blades the preferred choice for plastic recycling": "Descubra las ventajas clave que hacen de nuestras cuchillas trituradoras la opción preferida para el reciclaje de plástico.",
  "Premium Alloy Steel": "Acero de aleación de primera calidad",
  "High-quality D2, SKD11, and 9CrSi alloy steels provide exceptional hardness and impact strength": "Los aceros de aleación D2, SKD11 y 9CrSi de alta calidad proporcionan una dureza y resistencia al impacto excepcionales.",
  "Extended Service Life": "Vida útil extendida",
  "HSS blades: 150-300 hours, hard alloy blades: 800-1200 hours continuous operation": "Cuchillas HSS: 150-300 horas, cuchillas de aleación dura: 800-1200 horas de funcionamiento continuo",
  "Multiple Blade Types": "Múltiples tipos de cuchillas",
  "Claw, flat, flake, and V-type designs optimize performance for different material types": "Los diseños de garra, plano, en escamas y en V optimizan el rendimiento para diferentes tipos de materiales",
  "Precision Manufacturing": "Fabricación de precisión",
  "Advanced CNC machining and precision grinding ensure consistent cutting performance": "El mecanizado CNC avanzado y el rectificado de precisión garantizan un rendimiento de corte constante",
  "Versatile Applications": "Aplicaciones versátiles",
  "Process bottles, films, pipes, barrels, and various plastic waste materials efficiently": "Procese botellas, películas, tuberías, barriles y diversos materiales de desecho plástico de manera eficiente",
  "Impact Resistance": "Resistencia al impacto",
  "Superior toughness resists chipping and cracking from hard contaminants and metal fasteners": "La dureza superior resiste astillas y grietas causadas por contaminantes duros y sujetadores metálicos.",
  "Applications": "Aplicaciones",
  "Our crusher blades are widely used in plastic recycling and waste processing industries": "Nuestras cuchillas trituradoras se utilizan ampliamente en las industrias de reciclaje de plástico y procesamiento de residuos.",
  "Plastic Bottle Recycling": "Reciclaje de botellas de plástico",
  "Crushing PET bottles, containers, and hollow plastic products for recycling and reprocessing": "Trituración de botellas, envases y productos de plástico huecos de PET para su reciclaje y reprocesamiento",
  "Film & Packaging": "Película y embalaje",
  "Granulating plastic films, blown plastic, and packaging materials into recyclable flakes": "Granulación de películas plásticas, plástico soplado y materiales de embalaje en escamas reciclables.",
  "Pipe & Tube Processing": "Procesamiento de tuberías y tubos",
  "Crushing plastic pipes, tubing, and profiles into uniform granules for reuse": "Trituración de tuberías, tubos y perfiles de plástico hasta obtener gránulos uniformes para su reutilización",
  "Industrial Waste": "Desechos industriales",
  "Processing injection molding runners, sprues, and manufacturing waste plastics": "Procesamiento de canales de moldeo por inyección, bebederos y fabricación de plásticos de desecho.",
  "Rubber Recycling": "Reciclaje de caucho",
  "Granulating rubber materials, seals, and automotive rubber components": "Materiales de caucho granulado, sellos y componentes de caucho para automóviles",
  "Electronics Waste": "Residuos electrónicos",
  "Crushing plastic housings, computer cases, and electronic component packaging": "Trituración de carcasas de plástico, cajas de ordenadores y embalajes de componentes electrónicos.",
  "Blade Design & Manufacturing": "Diseño y fabricación de palas",
  "Understand the advanced engineering behind our high-performance crusher blades": "Comprenda la ingeniería avanzada detrás de nuestras cuchillas trituradoras de alto rendimiento",
  "High-Grade Alloy Steel": "Acero de aleación de alta calidad",
  "Our crusher blades are manufactured from premium alloy steels including D2, SKD11, HSS, 9CrSi, and T10. Each material is selected for optimal balance of hardness, wear resistance, and impact strength. High carbon steel provides excellent hardness, while alloy steel offers superior wear resistance and toughness. Material certification ensures consistent quality and performance.": "Nuestras cuchillas trituradoras se fabrican con aceros de aleación de primera calidad, incluidos D2, SKD11, HSS, 9CrSi y T10. ",
  "Four Blade Type Options": "Opciones de cuatro tipos de cuchillas",
  "We offer four specialized blade types: Claw type for aggressive cutting of thick materials, Flat type optimized for thin-walled products under 3mm, Flake type for general-purpose applications, and V type for precision cutting. Each design is engineered for specific material characteristics and processing requirements, ensuring optimal particle size and production efficiency.": "Ofrecemos cuatro tipos de hojas especializadas: tipo garra para cortes agresivos de materiales gruesos, tipo plano optimizado para productos de paredes delgadas de menos de 3 mm, tipo escama para aplicaciones de uso general y tipo V para cortes de precisión. ",
  "Precision Manufacturing Process": "Proceso de fabricación de precisión",
  "Our manufacturing process includes cutting by sawing machine, rough grinding by milling machine for dimensional accuracy, drilling by precision drilling machine for mounting holes, vacuum heat treatment in controlled furnaces to achieve HRC 56-60 hardness, and final precision grinding to create sharp, consistent cutting edges. This multi-step process ensures superior blade quality and performance.": "Nuestro proceso de fabricación incluye corte con sierra, desbaste con fresadora para obtener precisión dimensional, perforación con perforadora de precisión para orificios de montaje, tratamiento térmico al vacío en hornos controlados para lograr una dureza HRC 56-60 y rectificado final de precisión para crear bordes cortantes afilados y consistentes. ",
  "Rigorous Quality Control": "Control de calidad riguroso",
  "Every crusher blade undergoes comprehensive quality inspection including dimensional verification, hardness testing (HRC 56-60 according to customer requirements), edge sharpness evaluation, and visual inspection for defects. Dynamic testing simulates actual operating conditions to verify cutting performance. Complete quality documentation and material traceability are provided with each order.": "Cada hoja trituradora se somete a una inspección de calidad integral que incluye verificación dimensional, prueba de dureza (HRC 56-60 según los requisitos del cliente), evaluación del filo del borde e inspección visual para detectar defectos. ",
  "Standard & Custom Options": "Opciones estándar y personalizadas",
  "Choose from standard crusher blades or custom-engineered solutions for your equipment": "Elija entre cuchillas trituradoras estándar o soluciones diseñadas a medida para su equipo",
  "Standard Features": "Características estándar",
  "Custom Options": "Opciones personalizadas",
  "Need help selecting the right crusher blades?": "¿Necesita ayuda para seleccionar las cuchillas trituradoras adecuadas?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about crusher blades": "Preguntas comunes sobre las cuchillas de la trituradora",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "La vida útil de la hoja depende del tipo de material, la velocidad de la trituradora y el material de la hoja. ",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "Las hojas planas funcionan mejor para productos de paredes delgadas (menos de 3 mm), como botellas y películas, y ofrecen un mayor rendimiento. ",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "Sí, la mayoría de las cuchillas de las trituradoras se pueden reafilar profesionalmente de 2 a 4 veces, según la gravedad del desgaste y el diseño de la cuchilla. ",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "Los signos incluyen aumento del tamaño de las partículas, granulación desigual, mayor consumo de energía, ruido excesivo, daños o redondeos visibles en las cuchillas y rendimiento reducido. ",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "Para uso ocasional o plásticos blandos, el acero con alto contenido de carbono ofrece una buena relación calidad-precio. ",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "Sí, se proporcionan instrucciones de instalación completas con todos los pedidos de hojas, incluida la alineación adecuada de las hojas, el ajuste de la separación y las especificaciones de torsión. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Crusher Blade Guide": "Descargar la guía de cuchillas trituradoras",
  "Get comprehensive specifications, blade type selection guide, material recommendations, and maintenance best practices for our complete range of crusher blades. Includes compatibility charts and troubleshooting tips.": "Obtenga especificaciones completas, guía de selección de tipos de cuchillas, recomendaciones de materiales y mejores prácticas de mantenimiento para nuestra gama completa de cuchillas trituradoras. "
}