{
  "Crusher Blade": "クラッシャーブレード",
  "Premium crusher blades for plastic granulators, shredders, and recycling equipment. Manufactured from high-quality alloy steel (D2, SKD11, 9CrSi) with hardness ratings of HRC 56-60, delivering exceptional wear resistance and extended service life for processing plastic, rubber, and industrial waste materials.": "プラスチック造粒機、シュレッダー、リサイクル機器用のプレミアムクラッシャーブレード。 ",
  "Request Quote": "見積依頼",
  "View Specs": "仕様を見る",
  "Technical Specifications": "技術仕様",
  "Industrial-grade crusher blades engineered for high-performance plastic recycling": "高性能プラスチックのリサイクル用に設計された工業用グレードのクラッシャーブレード",
  "Material Options": "材質のオプション",
  "High Carbon Steel (high hardness)": "高炭素鋼（高硬度）",
  "D2 Tool Steel (premium grade)": "D2 工具鋼 (高級グレード)",
  "SKD11 (superior wear resistance)": "SKD11（耐摩耗性に優れています）",
  "Hard Alloy (HSS, carbide tipped)": "超硬合金 (ハイス、超硬チップ)",
  "Blade Types": "刃の種類",
  "Claw Type (aggressive cutting)": "爪タイプ（積極切削）",
  "Flat Type (thin-walled products)": "フラットタイプ（薄肉品）",
  "Flake Type (general purpose)": "フレークタイプ（汎用）",
  "V Type (precision cutting)": "Vタイプ（精密切削）",
  "Performance Features": "パフォーマンスの特徴",
  "Hardness: HRC 56-60": "硬度: HRC 56-60",
  "Service life: 150-1200 hours": "耐用年数: 150-1200時間",
  "Materials: Plastic, rubber, film": "材質：プラスチック、ゴム、フィルム",
  "Custom dimensions available": "カスタム寸法が利用可能",
  "Why Choose Our Crusher Blades?": "当社のクラッシャーブレードを選ぶ理由",
  "Discover the key advantages that make our crusher blades the preferred choice for plastic recycling": "当社のクラッシャーブレードがプラスチックリサイクルに最適な選択肢となる主な利点をご覧ください。",
  "Premium Alloy Steel": "プレミアム合金鋼",
  "High-quality D2, SKD11, and 9CrSi alloy steels provide exceptional hardness and impact strength": "高品質の D2、SKD11、および 9CrSi 合金鋼は、優れた硬度と衝撃強度を提供します。",
  "Extended Service Life": "耐用年数の延長",
  "HSS blades: 150-300 hours, hard alloy blades: 800-1200 hours continuous operation": "ハイスブレード：150～300時間、硬質合金ブレード：800～1200時間連続稼働",
  "Multiple Blade Types": "複数のブレードタイプ",
  "Claw, flat, flake, and V-type designs optimize performance for different material types": "クロー、フラット、フレーク、V タイプの設計により、さまざまな材料タイプのパフォーマンスを最適化します",
  "Precision Manufacturing": "精密製造",
  "Advanced CNC machining and precision grinding ensure consistent cutting performance": "高度な CNC 加工と精密研削により、安定した切断性能が保証されます。",
  "Versatile Applications": "多彩な用途",
  "Process bottles, films, pipes, barrels, and various plastic waste materials efficiently": "ボトル、フィルム、パイプ、樽、各種プラスチック廃材を効率的に処理します。",
  "Impact Resistance": "耐衝撃性",
  "Superior toughness resists chipping and cracking from hard contaminants and metal fasteners": "優れた靭性により、硬い異物や金属ファスナーによる欠けや亀裂に耐えます。",
  "Applications": "アプリケーション",
  "Our crusher blades are widely used in plastic recycling and waste processing industries": "当社のクラッシャーブレードは、プラスチックリサイクルおよび廃棄物処理業界で広く使用されています。",
  "Plastic Bottle Recycling": "ペットボトルのリサイクル",
  "Crushing PET bottles, containers, and hollow plastic products for recycling and reprocessing": "ペットボトル、容器、中空プラスチック製品を破砕し、リサイクル・再加工します。",
  "Film & Packaging": "フィルムとパッケージング",
  "Granulating plastic films, blown plastic, and packaging materials into recyclable flakes": "プラスチックフィルム、吹き込みプラスチック、包装材料をリサイクル可能なフレークに造粒します。",
  "Pipe & Tube Processing": "パイプ＆チューブ加工",
  "Crushing plastic pipes, tubing, and profiles into uniform granules for reuse": "プラスチックのパイプ、チューブ、異形材を再利用するために均一な顆粒に粉砕します。",
  "Industrial Waste": "産業廃棄物",
  "Processing injection molding runners, sprues, and manufacturing waste plastics": "射出成形ランナー、スプルーの加工、廃プラスチックの製造",
  "Rubber Recycling": "ゴムのリサイクル",
  "Granulating rubber materials, seals, and automotive rubber components": "ゴム材料、シール、自動車用ゴム部品の造粒",
  "Electronics Waste": "電子機器廃棄物",
  "Crushing plastic housings, computer cases, and electronic component packaging": "プラスチックハウジング、コンピュータケース、電子部品パッケージの粉砕",
  "Blade Design & Manufacturing": "ブレードの設計と製造",
  "Understand the advanced engineering behind our high-performance crusher blades": "当社の高性能クラッシャーブレードの背後にある高度なエンジニアリングを理解する",
  "High-Grade Alloy Steel": "高級合金鋼",
  "Our crusher blades are manufactured from premium alloy steels including D2, SKD11, HSS, 9CrSi, and T10. Each material is selected for optimal balance of hardness, wear resistance, and impact strength. High carbon steel provides excellent hardness, while alloy steel offers superior wear resistance and toughness. Material certification ensures consistent quality and performance.": "当社のクラッシャーブレードは、D2、SKD11、HSS、9CrSi、T10 などの高級合金鋼から製造されています。",
  "Four Blade Type Options": "4 つのブレードタイプのオプション",
  "We offer four specialized blade types: Claw type for aggressive cutting of thick materials, Flat type optimized for thin-walled products under 3mm, Flake type for general-purpose applications, and V type for precision cutting. Each design is engineered for specific material characteristics and processing requirements, ensuring optimal particle size and production efficiency.": "厚物を積極的に切断するクロータイプ、3mm以下の薄肉製品に最適なフラットタイプ、汎用用途に適したフレークタイプ、精密切断に適したVタイプの4種類の専用刃タイプを用意しています。",
  "Precision Manufacturing Process": "精密な製造工程",
  "Our manufacturing process includes cutting by sawing machine, rough grinding by milling machine for dimensional accuracy, drilling by precision drilling machine for mounting holes, vacuum heat treatment in controlled furnaces to achieve HRC 56-60 hardness, and final precision grinding to create sharp, consistent cutting edges. This multi-step process ensures superior blade quality and performance.": "当社の製造工程には、鋸盤による切断、寸法精度を高めるためのフライス盤による荒研削、取り付け穴のための精密ボール盤による穴あけ、HRC 56～60の硬度を実現するための管理された炉での真空熱処理、そしてシャープで安定した刃先を生み出すための最終精密研削が含まれます。",
  "Rigorous Quality Control": "厳格な品質管理",
  "Every crusher blade undergoes comprehensive quality inspection including dimensional verification, hardness testing (HRC 56-60 according to customer requirements), edge sharpness evaluation, and visual inspection for defects. Dynamic testing simulates actual operating conditions to verify cutting performance. Complete quality documentation and material traceability are provided with each order.": "すべてのクラッシャーブレードは、寸法検証、硬度試験 (顧客の要求に応じて HRC 56 ～ 60)、エッジの鋭さ評価、および欠陥の目視検査を含む包括的な品質検査を受けます。",
  "Standard & Custom Options": "標準およびカスタム オプション",
  "Choose from standard crusher blades or custom-engineered solutions for your equipment": "標準の破砕機ブレードまたは装置に合わせてカスタム設計されたソリューションからお選びください",
  "Standard Features": "標準機能",
  "Custom Options": "カスタムオプション",
  "Need help selecting the right crusher blades?": "適切なクラッシャーブレードの選択についてサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about crusher blades": "クラッシャーブレードに関するよくある質問",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "ブレードの寿命は、材料の種類、クラッシャー速度、ブレードの材質によって異なります。",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "フラットブレードはボトルやフィルムなどの薄肉製品 (3mm 未満) に最適で、より高い生産量を提供します。",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "はい、ほとんどのクラッシャーブレードは、摩耗の度合いとブレードの設計に応じて、専門的に2〜4回研ぎ直すことができます。",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "兆候としては、粒子サイズの増加、不均一な造粒、消費電力の増加、過度の騒音、目に見えるブレードの損傷や丸み、スループットの低下などが挙げられます。 ",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "時々使用する場合や柔らかいプラスチックの場合は、高炭素鋼が適しています。",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "はい、すべてのブレードの注文には、適切なブレードの位置合わせ、ギャップ調整、トルク仕様を含む包括的な取り付け手順が提供されます。",
  "Still have questions?": "まだ質問がありますか?",
  "Download Crusher Blade Guide": "クラッシャーブレードガイドをダウンロード",
  "Get comprehensive specifications, blade type selection guide, material recommendations, and maintenance best practices for our complete range of crusher blades. Includes compatibility charts and troubleshooting tips.": "当社の全クラッシャー ブレードの包括的な仕様、ブレード タイプの選択ガイド、推奨材料、メンテナンスのベスト プラクティスを入手してください。"
}