{
  "Crusher Blade": "شفرة كسارة",
  "Premium crusher blades for plastic granulators, shredders, and recycling equipment. Manufactured from high-quality alloy steel (D2, SKD11, 9CrSi) with hardness ratings of HRC 56-60, delivering exceptional wear resistance and extended service life for processing plastic, rubber, and industrial waste materials.": "شفرات كسارة ممتازة لحبيبات البلاستيك، وآلات تمزيق الورق، ومعدات إعادة التدوير. ",
  "Request Quote": "طلب اقتباس",
  "View Specs": "عرض المواصفات",
  "Technical Specifications": "المواصفات الفنية",
  "Industrial-grade crusher blades engineered for high-performance plastic recycling": "شفرات كسارة من الدرجة الصناعية مصممة لإعادة تدوير البلاستيك عالي الأداء",
  "Material Options": "خيارات المواد",
  "High Carbon Steel (high hardness)": "فولاذ عالي الكربون (صلابة عالية)",
  "D2 Tool Steel (premium grade)": "D2 Tool Steel (درجة ممتازة)",
  "SKD11 (superior wear resistance)": "SKD11 (مقاومة التآكل الفائقة)",
  "Hard Alloy (HSS, carbide tipped)": "سبائك صلبة (HSS، كربيد مائل)",
  "Blade Types": "أنواع الشفرة",
  "Claw Type (aggressive cutting)": "نوع المخلب (القطع العدواني)",
  "Flat Type (thin-walled products)": "النوع المسطح (المنتجات ذات الجدران الرقيقة)",
  "Flake Type (general purpose)": "نوع الرقاقة (للأغراض العامة)",
  "V Type (precision cutting)": "النوع V (القطع الدقيق)",
  "Performance Features": "ميزات الأداء",
  "Hardness: HRC 56-60": "الصلابة: HRC 56-60",
  "Service life: 150-1200 hours": "عمر الخدمة: 150-1200 ساعة",
  "Materials: Plastic, rubber, film": "المواد: البلاستيك، المطاط، الفيلم",
  "Custom dimensions available": "الأبعاد المخصصة متاحة",
  "Why Choose Our Crusher Blades?": "لماذا تختار شفرات الكسارة الخاصة بنا؟",
  "Discover the key advantages that make our crusher blades the preferred choice for plastic recycling": "اكتشف المزايا الرئيسية التي تجعل شفرات الكسارة لدينا هي الخيار المفضل لإعادة تدوير البلاستيك",
  "Premium Alloy Steel": "سبائك الصلب قسط",
  "High-quality D2, SKD11, and 9CrSi alloy steels provide exceptional hardness and impact strength": "توفر سبائك الفولاذ D2 وSKD11 و9CrSi عالية الجودة صلابة استثنائية وقوة تأثير",
  "Extended Service Life": "عمر خدمة ممتد",
  "HSS blades: 150-300 hours, hard alloy blades: 800-1200 hours continuous operation": "شفرات HSS: 150-300 ساعة، شفرات السبائك الصلبة: 800-1200 ساعة تشغيل متواصل",
  "Multiple Blade Types": "أنواع شفرات متعددة",
  "Claw, flat, flake, and V-type designs optimize performance for different material types": "تعمل التصميمات المخلبية والمسطحة والرقائقية والنوعية على تحسين الأداء لأنواع المواد المختلفة",
  "Precision Manufacturing": "التصنيع الدقيق",
  "Advanced CNC machining and precision grinding ensure consistent cutting performance": "تضمن الآلات CNC المتقدمة والطحن الدقيق أداء القطع المتسق",
  "Versatile Applications": "تطبيقات متعددة الاستخدامات",
  "Process bottles, films, pipes, barrels, and various plastic waste materials efficiently": "معالجة الزجاجات والأغشية والأنابيب والبراميل ومواد النفايات البلاستيكية المختلفة بكفاءة",
  "Impact Resistance": "مقاومة التأثير",
  "Superior toughness resists chipping and cracking from hard contaminants and metal fasteners": "صلابة فائقة تقاوم التقطيع والتشقق الناتج عن الملوثات الصلبة والمثبتات المعدنية",
  "Applications": "التطبيقات",
  "Our crusher blades are widely used in plastic recycling and waste processing industries": "تُستخدم شفرات الكسارة الخاصة بنا على نطاق واسع في صناعات إعادة تدوير البلاستيك ومعالجة النفايات",
  "Plastic Bottle Recycling": "إعادة تدوير الزجاجات البلاستيكية",
  "Crushing PET bottles, containers, and hollow plastic products for recycling and reprocessing": "سحق الزجاجات والحاويات والمنتجات البلاستيكية المجوفة لإعادة التدوير وإعادة المعالجة",
  "Film & Packaging": "الفيلم والتغليف",
  "Granulating plastic films, blown plastic, and packaging materials into recyclable flakes": "تحبيب الأفلام البلاستيكية والبلاستيك المنفوخ ومواد التعبئة والتغليف إلى رقائق قابلة لإعادة التدوير",
  "Pipe & Tube Processing": "معالجة الأنابيب والأنابيب",
  "Crushing plastic pipes, tubing, and profiles into uniform granules for reuse": "سحق الأنابيب والأنابيب والمقاطع البلاستيكية إلى حبيبات موحدة لإعادة استخدامها",
  "Industrial Waste": "النفايات الصناعية",
  "Processing injection molding runners, sprues, and manufacturing waste plastics": "معالجة مجاري القولبة بالحقن والسبائك وتصنيع مخلفات البلاستيك",
  "Rubber Recycling": "إعادة تدوير المطاط",
  "Granulating rubber materials, seals, and automotive rubber components": "تحبيب المواد المطاطية والأختام والمكونات المطاطية للسيارات",
  "Electronics Waste": "نفايات الإلكترونيات",
  "Crushing plastic housings, computer cases, and electronic component packaging": "سحق العلب البلاستيكية، وصناديق الكمبيوتر، وتغليف المكونات الإلكترونية",
  "Blade Design & Manufacturing": "تصميم وتصنيع الشفرة",
  "Understand the advanced engineering behind our high-performance crusher blades": "فهم الهندسة المتقدمة وراء شفرات الكسارة عالية الأداء لدينا",
  "High-Grade Alloy Steel": "سبائك الصلب عالية الجودة",
  "Our crusher blades are manufactured from premium alloy steels including D2, SKD11, HSS, 9CrSi, and T10. Each material is selected for optimal balance of hardness, wear resistance, and impact strength. High carbon steel provides excellent hardness, while alloy steel offers superior wear resistance and toughness. Material certification ensures consistent quality and performance.": "يتم تصنيع شفرات الكسارة الخاصة بنا من سبائك الفولاذ الممتازة بما في ذلك D2، وSKD11، وHSS، و9CrSi، وT10. ",
  "Four Blade Type Options": "أربعة خيارات لنوع الشفرة",
  "We offer four specialized blade types: Claw type for aggressive cutting of thick materials, Flat type optimized for thin-walled products under 3mm, Flake type for general-purpose applications, and V type for precision cutting. Each design is engineered for specific material characteristics and processing requirements, ensuring optimal particle size and production efficiency.": "نحن نقدم أربعة أنواع من الشفرات المتخصصة: النوع المخلبي للقطع القوي للمواد السميكة، والنوع المسطح المُحسّن للمنتجات ذات الجدران الرقيقة التي يقل سمكها عن 3 مم، والنوع المتقشر لتطبيقات الأغراض العامة، والنوع V للقطع الدقيق. ",
  "Precision Manufacturing Process": "عملية التصنيع الدقيقة",
  "Our manufacturing process includes cutting by sawing machine, rough grinding by milling machine for dimensional accuracy, drilling by precision drilling machine for mounting holes, vacuum heat treatment in controlled furnaces to achieve HRC 56-60 hardness, and final precision grinding to create sharp, consistent cutting edges. This multi-step process ensures superior blade quality and performance.": "تشتمل عملية التصنيع لدينا على القطع بواسطة آلة النشر، والطحن الخشن بواسطة آلة الطحن للحصول على دقة الأبعاد، والحفر بواسطة آلة الحفر الدقيقة لتركيب الثقوب، والمعالجة الحرارية الفراغية في أفران يتم التحكم فيها لتحقيق صلابة HRC 56-60، والطحن الدقيق النهائي لإنشاء حواف قطع حادة ومتسقة. ",
  "Rigorous Quality Control": "مراقبة الجودة الصارمة",
  "Every crusher blade undergoes comprehensive quality inspection including dimensional verification, hardness testing (HRC 56-60 according to customer requirements), edge sharpness evaluation, and visual inspection for defects. Dynamic testing simulates actual operating conditions to verify cutting performance. Complete quality documentation and material traceability are provided with each order.": "تخضع كل شفرة كسارة لفحص شامل للجودة بما في ذلك التحقق من الأبعاد، واختبار الصلابة (HRC 56-60 وفقًا لمتطلبات العميل)، وتقييم حدة الحافة، والفحص البصري للعيوب. ",
  "Standard & Custom Options": "الخيارات القياسية والمخصصة",
  "Choose from standard crusher blades or custom-engineered solutions for your equipment": "اختر من بين شفرات الكسارة القياسية أو الحلول المصممة خصيصًا لمعداتك",
  "Standard Features": "الميزات القياسية",
  "Custom Options": "خيارات مخصصة",
  "Need help selecting the right crusher blades?": "هل تحتاج إلى مساعدة في اختيار شفرات الكسارة المناسبة؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about crusher blades": "أسئلة شائعة حول شفرات الكسارة",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "يعتمد عمر الشفرة على نوع المادة وسرعة الكسارة ومادة الشفرة. ",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "تعمل الشفرات المسطحة بشكل أفضل مع المنتجات ذات الجدران الرقيقة (أقل من 3 مم) مثل الزجاجات والأفلام، مما يوفر إنتاجًا أعلى. ",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "نعم، يمكن إعادة شحذ معظم شفرات الكسارة بشكل احترافي من 2 إلى 4 مرات اعتمادًا على شدة التآكل وتصميم الشفرة. ",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "تشمل العلامات زيادة حجم الجسيمات، والتحبيب غير المتساوي، وارتفاع استهلاك الطاقة، والضوضاء المفرطة، وتلف الشفرة أو تقريبها بشكل واضح، وانخفاض الإنتاجية. ",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "للاستخدام العرضي أو البلاستيك الناعم، يوفر الفولاذ عالي الكربون قيمة جيدة. ",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "نعم، يتم توفير تعليمات التثبيت الشاملة مع جميع طلبات الشفرات، بما في ذلك المحاذاة الصحيحة للشفرة، وضبط الفجوة، ومواصفات عزم الدوران. ",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "Download Crusher Blade Guide": "تحميل دليل كسارة الشفرات",
  "Get comprehensive specifications, blade type selection guide, material recommendations, and maintenance best practices for our complete range of crusher blades. Includes compatibility charts and troubleshooting tips.": "احصل على المواصفات الشاملة ودليل اختيار نوع الشفرة وتوصيات المواد وأفضل ممارسات الصيانة لمجموعتنا الكاملة من شفرات الكسارة. "
}