{
  "Rolling Shear Slitting Blade": "Lame de refendage par cisaillement roulant",
  "Precision-engineered circular rotary cutting blades designed for high-speed slitting operations. Manufactured from premium high-speed steel with superior hardness and wear resistance for extended service life in continuous production environments.": "Lames de coupe rotatives circulaires conçues avec précision pour les opérations de refendage à grande vitesse. ",
  "Request Quote": "Demander un devis",
  "View Specs": "Voir les spécifications",
  "Technical Specifications": "Spécifications techniques",
  "High-performance rolling shear blades engineered for precision and durability": "Lames de cisaille à roulement haute performance conçues pour la précision et la durabilité",
  "Blade Dimensions": "Dimensions de la lame",
  "Outer Diameter: 50mm - 600mm": "Diamètre extérieur : 50 mm - 600 mm",
  "Inner Bore: Custom specifications": "Alésage intérieur : spécifications personnalisées",
  "Thickness: 0.5mm - 10mm": "Épaisseur : 0,5 mm - 10 mm",
  "Tolerance: ±0.01mm (precision ground)": "Tolérance : ±0,01 mm (rectifié avec précision)",
  "Material & Hardness": "Matériau et dureté",
  "Material: HSS (High-Speed Steel)": "Matériau : HSS (acier rapide)",
  "Hardness: HRC 60-65": "Dureté : HRC 60-65",
  "Heat Treatment: Vacuum hardening": "Traitement thermique : durcissement sous vide",
  "Surface: Precision ground & polished": "Surface : rectifiée et polie avec précision",
  "Cutting Performance": "Performances de coupe",
  "Materials: Steel, aluminum, copper, film": "Matériaux : Acier, aluminium, cuivre, film",
  "Speed: Up to 200m/min": "Vitesse : jusqu'à 200 m/min",
  "Edge Life: 5-10x standard blades": "Durée de vie des bords : 5 à 10 lames standard",
  "Re-sharpening: Multiple cycles supported": "Réaffûtage : plusieurs cycles pris en charge",
  "Why Choose Our Rolling Shear Blades?": "Pourquoi choisir nos lames de cisaillement roulantes ?",
  "Discover the key advantages that make our slitting blades the preferred choice for industrial cutting applications": "Découvrez les principaux avantages qui font de nos lames de refendage le choix privilégié pour les applications de coupe industrielle",
  "Superior Material Quality": "Qualité supérieure des matériaux",
  "Premium high-speed steel composition with precise heat treatment for maximum hardness and toughness": "Composition d'acier rapide de qualité supérieure avec traitement thermique précis pour une dureté et une ténacité maximales",
  "Extended Blade Life": "Durée de vie prolongée de la lame",
  "5-10 times longer service life compared to standard blades, reducing replacement frequency and downtime": "Durée de vie 5 à 10 fois plus longue que les lames standard, réduisant ainsi la fréquence de remplacement et les temps d'arrêt",
  "Precision Ground Edges": "Bords rectifiés avec précision",
  "Advanced CNC grinding ensures consistent edge geometry and superior cutting accuracy with minimal burring": "Le meulage CNC avancé garantit une géométrie de bord constante et une précision de coupe supérieure avec un minimum de bavures",
  "Re-sharpenable Design": "Conception réaffûtable",
  "Blades can be professionally re-sharpened multiple times, maximizing ROI and reducing operational costs": "Les lames peuvent être réaffûtées professionnellement plusieurs fois, maximisant le retour sur investissement et réduisant les coûts opérationnels",
  "Custom Configuration": "Configuration personnalisée",
  "Tailored dimensions, bore sizes, and edge profiles to match your specific slitting machine requirements": "Dimensions, tailles d'alésage et profils de bord sur mesure pour répondre aux exigences spécifiques de votre machine à refendre",
  "Heat Resistance": "Résistance à la chaleur",
  "Excellent thermal stability maintains cutting performance even at high-speed continuous operation": "L'excellente stabilité thermique maintient les performances de coupe même en fonctionnement continu à grande vitesse",
  "Applications": "Applications",
  "Our rolling shear slitting blades are widely used across various industries for precision material cutting": "Nos lames de refendage par cisaillement roulant sont largement utilisées dans diverses industries pour la coupe de matériaux de précision",
  "Metal Processing": "Traitement des métaux",
  "Slitting steel, stainless steel, aluminum, and copper coils into precise widths for various manufacturing applications": "Refendage de bobines d'acier, d'acier inoxydable, d'aluminium et de cuivre en largeurs précises pour diverses applications de fabrication",
  "Paper & Film Industry": "Industrie du papier et du film",
  "Precision cutting of paper, cardboard, plastic films, and flexible packaging materials": "Découpe de précision du papier, du carton, des films plastiques et des matériaux d'emballage flexibles",
  "Textile Manufacturing": "Fabrication textile",
  "Cutting woven and non-woven fabrics, synthetic materials, and industrial textiles": "Découpe de tissus tissés et non tissés, de matières synthétiques et de textiles industriels",
  "Rubber & Foam": "Caoutchouc et mousse",
  "Slitting rubber sheets, foam materials, and composite products with clean, precise edges": "Refendage de feuilles de caoutchouc, de matériaux en mousse et de produits composites avec des bords nets et précis",
  "Converting Industry": "Industrie de conversion",
  "Label stock, adhesive tapes, and specialty materials for packaging and industrial use": "Stock d'étiquettes, rubans adhésifs et matériaux spéciaux pour l'emballage et l'usage industriel",
  "Foil & Laminate": "Feuille et stratifié",
  "Processing aluminum foil, laminated materials, and multi-layer composite products": "Traitement du papier d'aluminium, des matériaux stratifiés et des produits composites multicouches",
  "Blade Features & Construction": "Caractéristiques et construction de la lame",
  "Better understand blade performance through detailed feature descriptions and technical characteristics": "Mieux comprendre les performances des lames grâce à des descriptions détaillées des fonctionnalités et des caractéristiques techniques",
  "High-Speed Steel (HSS) Material": "Matériau en acier rapide (HSS)",
  "Manufactured from premium grade high-speed steel with optimized alloy composition. The material undergoes vacuum heat treatment to achieve HRC 60-65 hardness, providing exceptional wear resistance and edge retention. This ensures consistent cutting performance over extended production runs with minimal degradation.": "Fabriqué à partir d'acier rapide de qualité supérieure avec une composition d'alliage optimisée. ",
  "CNC Precision Grinding": "Meulage de précision CNC",
  "Each blade is precision ground using advanced CNC grinding technology to ensure perfect concentricity and edge geometry. The cutting edge is ground to micron-level tolerances (±0.01mm), resulting in clean, burr-free cuts. Surface finish is polished to Ra 0.4μm for reduced friction and enhanced cutting efficiency.": "Chaque lame est rectifiée avec précision à l'aide d'une technologie de meulage CNC avancée pour garantir une concentricité et une géométrie de bord parfaites. ",
  "Optimized Edge Design": "Conception de bord optimisée",
  "The cutting edge features an optimized angle and relief design specifically engineered for your application. Available in various edge profiles including straight, beveled, and specialized geometries. This design minimizes cutting force while maximizing edge life and cut quality across different materials.": "Le tranchant présente un angle et un relief optimisés spécialement conçus pour votre application. ",
  "Rigorous Quality Control": "Contrôle qualité rigoureux",
  "Every blade undergoes comprehensive quality inspection including dimensional verification, hardness testing, surface finish measurement, and dynamic balance checking. Certified to meet international quality standards. Each blade is individually inspected and certified before shipment to ensure consistent performance.": "Chaque lame est soumise à une inspection de qualité complète comprenant une vérification dimensionnelle, des tests de dureté, une mesure de l'état de surface et une vérification de l'équilibre dynamique. ",
  "Standard & Custom Options": "Options standard et personnalisées",
  "Choose from standard configurations or customize your blades to meet specific application requirements": "Choisissez parmi les configurations standard ou personnalisez vos lames pour répondre aux exigences spécifiques des applications",
  "Standard Features": "Fonctionnalités standards",
  "Custom Options": "Options personnalisées",
  "Need help selecting the right blade configuration?": "Besoin d'aide pour sélectionner la bonne configuration de lame ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our rolling shear slitting blades": "Questions courantes sur nos lames de refendage par cisaillement roulant",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "La durée de vie de la lame dépend du matériau à couper, de la vitesse de coupe et des pratiques d'entretien. ",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "Oui, nos lames de cisailles à rouleaux sont conçues pour plusieurs cycles de réaffûtage. ",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "Nos lames de cisailles à roulement manipulent une large gamme de matériaux, notamment l'acier, l'acier inoxydable, l'aluminium, le cuivre, le laiton, les films plastiques, le papier, le carton, le caoutchouc, la mousse, les textiles et les matériaux composites. ",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "Le choix de la lame dépend des spécifications de votre machine, du type de matériau et des exigences de coupe. ",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "Les lames de taille standard sont généralement expédiées sous 7 à 10 jours ouvrables. ",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "Oui, une assistance technique complète est incluse avec toutes les commandes de lames. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Technical Catalog": "Télécharger le catalogue technique",
  "Get detailed specifications, material grades, dimensional charts, and application guidelines for our complete range of rolling shear slitting blades. Download our comprehensive product catalog in PDF format.": "Obtenez des spécifications détaillées, des qualités de matériaux, des tableaux dimensionnels et des directives d'application pour notre gamme complète de lames de refendage par cisaillement roulant. "
}