{
  "Rolling Shear Slitting Blade": "ローリングシャースリッティングブレード",
  "Precision-engineered circular rotary cutting blades designed for high-speed slitting operations. Manufactured from premium high-speed steel with superior hardness and wear resistance for extended service life in continuous production environments.": "高速スリッティング作業用に設計された、精密設計の円形回転切断ブレード。",
  "Request Quote": "見積依頼",
  "View Specs": "仕様を見る",
  "Technical Specifications": "技術仕様",
  "High-performance rolling shear blades engineered for precision and durability": "精度と耐久性を追求した高性能ローリングシャーブレード",
  "Blade Dimensions": "刃の寸法",
  "Outer Diameter: 50mm - 600mm": "外径：50mm～600mm",
  "Inner Bore: Custom specifications": "インナーボア：カスタム仕様",
  "Thickness: 0.5mm - 10mm": "厚さ：0.5mm～10mm",
  "Tolerance: ±0.01mm (precision ground)": "公差：±0.01mm（精密研磨）",
  "Material & Hardness": "材質と硬度",
  "Material: HSS (High-Speed Steel)": "材質：HSS（ハイス鋼）",
  "Hardness: HRC 60-65": "硬度: HRC 60-65",
  "Heat Treatment: Vacuum hardening": "熱処理：真空焼入れ",
  "Surface: Precision ground & polished": "表面: 精密研磨および研磨",
  "Cutting Performance": "切削性能",
  "Materials: Steel, aluminum, copper, film": "材質：スチール、アルミニウム、銅、フィルム",
  "Speed: Up to 200m/min": "速度: 最大200m/分",
  "Edge Life: 5-10x standard blades": "エッジ寿命: 標準ブレードの 5 ～ 10 倍",
  "Re-sharpening: Multiple cycles supported": "再研磨: 複数サイクルをサポート",
  "Why Choose Our Rolling Shear Blades?": "当社のローリングシャーブレードを選ぶ理由",
  "Discover the key advantages that make our slitting blades the preferred choice for industrial cutting applications": "当社のスリッターブレードが工業用切断用途に最適な選択肢となる主な利点をご覧ください。",
  "Superior Material Quality": "優れた素材品質",
  "Premium high-speed steel composition with precise heat treatment for maximum hardness and toughness": "最高の硬度と靭性を実現する精密な熱処理を施したプレミアム高速度鋼組成",
  "Extended Blade Life": "ブレードの寿命の延長",
  "5-10 times longer service life compared to standard blades, reducing replacement frequency and downtime": "標準ブレードと比較して5～10倍の耐用年数があり、交換頻度とダウンタイムを削減します。",
  "Precision Ground Edges": "精密研磨されたエッジ",
  "Advanced CNC grinding ensures consistent edge geometry and superior cutting accuracy with minimal burring": "高度な CNC 研削により、バリを最小限に抑えながら一貫した刃先形状と優れた切断精度を保証します。",
  "Re-sharpenable Design": "再研磨可能なデザイン",
  "Blades can be professionally re-sharpened multiple times, maximizing ROI and reducing operational costs": "ブレードは専門家によって何度も研ぎ直されるため、ROI が最大化され、運用コストが削減されます。",
  "Custom Configuration": "カスタム構成",
  "Tailored dimensions, bore sizes, and edge profiles to match your specific slitting machine requirements": "特定のスリッティングマシンの要件に合わせて寸法、ボアサイズ、エッジプロファイルをカスタマイズ",
  "Heat Resistance": "耐熱性",
  "Excellent thermal stability maintains cutting performance even at high-speed continuous operation": "優れた熱安定性により高速連続運転でも切断性能を維持",
  "Applications": "アプリケーション",
  "Our rolling shear slitting blades are widely used across various industries for precision material cutting": "当社のローリングシャースリッティングブレードは、材料の精密切断のためにさまざまな業界で広く使用されています。",
  "Metal Processing": "金属加工",
  "Slitting steel, stainless steel, aluminum, and copper coils into precise widths for various manufacturing applications": "スチール、ステンレス鋼、アルミニウム、銅のコイルをさまざまな製造用途に合わせて正確な幅にスリットします。",
  "Paper & Film Industry": "紙・フィルム産業",
  "Precision cutting of paper, cardboard, plastic films, and flexible packaging materials": "紙、段ボール、プラスチックフィルム、軟包材の精密切断",
  "Textile Manufacturing": "繊維製造業",
  "Cutting woven and non-woven fabrics, synthetic materials, and industrial textiles": "織布・不織布、合成繊維、工業用繊維の切断",
  "Rubber & Foam": "ゴムとフォーム",
  "Slitting rubber sheets, foam materials, and composite products with clean, precise edges": "ゴムシート、発泡材料、複合製品をきれいで正確なエッジでスリットします。",
  "Converting Industry": "加工産業",
  "Label stock, adhesive tapes, and specialty materials for packaging and industrial use": "包装用および産業用のラベルストック、粘着テープ、特殊材料",
  "Foil & Laminate": "フォイル＆ラミネート",
  "Processing aluminum foil, laminated materials, and multi-layer composite products": "アルミ箔、ラミネート材、多層複合製品の加工",
  "Blade Features & Construction": "ブレードの機能と構造",
  "Better understand blade performance through detailed feature descriptions and technical characteristics": "詳細な機能説明と技術的特性を通じて、ブレードのパフォーマンスをより深く理解できます。",
  "High-Speed Steel (HSS) Material": "高速度鋼 (HSS) 材質",
  "Manufactured from premium grade high-speed steel with optimized alloy composition. The material undergoes vacuum heat treatment to achieve HRC 60-65 hardness, providing exceptional wear resistance and edge retention. This ensures consistent cutting performance over extended production runs with minimal degradation.": "合金組成が最適化されたプレミアムグレードの高速度鋼から製造されています。",
  "CNC Precision Grinding": "CNC精密研削",
  "Each blade is precision ground using advanced CNC grinding technology to ensure perfect concentricity and edge geometry. The cutting edge is ground to micron-level tolerances (±0.01mm), resulting in clean, burr-free cuts. Surface finish is polished to Ra 0.4μm for reduced friction and enhanced cutting efficiency.": "各ブレードは高度な CNC 研削技術を使用して精密に研削され、完璧な同心性とエッジの形状を保証します。",
  "Optimized Edge Design": "最適化されたエッジデザイン",
  "The cutting edge features an optimized angle and relief design specifically engineered for your application. Available in various edge profiles including straight, beveled, and specialized geometries. This design minimizes cutting force while maximizing edge life and cut quality across different materials.": "刃先は、用途に合わせて特別に設計された、最適化された角度とレリーフ設計を特徴としています。",
  "Rigorous Quality Control": "厳格な品質管理",
  "Every blade undergoes comprehensive quality inspection including dimensional verification, hardness testing, surface finish measurement, and dynamic balance checking. Certified to meet international quality standards. Each blade is individually inspected and certified before shipment to ensure consistent performance.": "すべてのブレードは、寸法検証、硬度テスト、表面仕上げ測定、動的バランスチェックを含む包括的な品質検査を受けます。",
  "Standard & Custom Options": "標準およびカスタム オプション",
  "Choose from standard configurations or customize your blades to meet specific application requirements": "標準構成から選択するか、特定のアプリケーション要件に合わせてブレードをカスタマイズします",
  "Standard Features": "標準機能",
  "Custom Options": "カスタムオプション",
  "Need help selecting the right blade configuration?": "適切なブレード構成の選択にサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about our rolling shear slitting blades": "ローリングシャーのスリッティングブレードに関するよくある質問",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "ブレードの寿命は、切断する材料、切断速度、メンテナンス方法によって異なります。",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "はい、当社のローリングシャーブレードは複数回の再研磨サイクル向けに設計されています。",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "当社のローリングシャーブレードは、鋼鉄、ステンレス鋼、アルミニウム、銅、真鍮、プラスチックフィルム、紙、ボール紙、ゴム、フォーム、繊維、複合材料など、幅広い材料を処理します。",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "ブレードの選択は、機械の仕様、材料の種類、切断要件によって異なります。",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "標準サイズのブレードは通常 7 ～ 10 営業日以内に発送されます。",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "はい、すべてのブレードの注文には包括的な技術サポートが含まれています。",
  "Still have questions?": "まだ質問がありますか?",
  "Download Technical Catalog": "技術カタログをダウンロード",
  "Get detailed specifications, material grades, dimensional charts, and application guidelines for our complete range of rolling shear slitting blades. Download our comprehensive product catalog in PDF format.": "当社のローリングシャー スリッティング ブレードの全製品の詳細な仕様、材料グレード、寸法表、およびアプリケーション ガイドラインをご覧ください。"
}