{
  "Rolling Shear Slitting Blade": "المتداول القص الحز بليد",
  "Precision-engineered circular rotary cutting blades designed for high-speed slitting operations. Manufactured from premium high-speed steel with superior hardness and wear resistance for extended service life in continuous production environments.": "شفرات قطع دوارة دائرية مصممة بدقة ومصممة لعمليات القطع عالية السرعة. ",
  "Request Quote": "طلب اقتباس",
  "View Specs": "عرض المواصفات",
  "Technical Specifications": "المواصفات الفنية",
  "High-performance rolling shear blades engineered for precision and durability": "شفرات قص دوارة عالية الأداء مصممة لتحقيق الدقة والمتانة",
  "Blade Dimensions": "أبعاد الشفرة",
  "Outer Diameter: 50mm - 600mm": "القطر الخارجي: 50 مم - 600 مم",
  "Inner Bore: Custom specifications": "التجويف الداخلي: المواصفات المخصصة",
  "Thickness: 0.5mm - 10mm": "السُمك: 0.5 مم - 10 مم",
  "Tolerance: ±0.01mm (precision ground)": "التسامح: ± 0.01 مم (الأرضية الدقيقة)",
  "Material & Hardness": "المواد والصلابة",
  "Material: HSS (High-Speed Steel)": "المواد: HSS (فولاذ عالي السرعة)",
  "Hardness: HRC 60-65": "الصلابة: HRC 60-65",
  "Heat Treatment: Vacuum hardening": "المعالجة الحرارية: تصلب الفراغ",
  "Surface: Precision ground & polished": "السطح: أرضي دقيق ومصقول",
  "Cutting Performance": "أداء القطع",
  "Materials: Steel, aluminum, copper, film": "المواد: الصلب والألومنيوم والنحاس والفيلم",
  "Speed: Up to 200m/min": "السرعة: تصل إلى 200 م/دقيقة",
  "Edge Life: 5-10x standard blades": "عمر الحافة: 5-10x شفرات قياسية",
  "Re-sharpening: Multiple cycles supported": "إعادة الشحذ: دعم دورات متعددة",
  "Why Choose Our Rolling Shear Blades?": "لماذا تختار شفرات القص الدوارة الخاصة بنا؟",
  "Discover the key advantages that make our slitting blades the preferred choice for industrial cutting applications": "اكتشف المزايا الرئيسية التي تجعل شفرات الحز الخاصة بنا الخيار المفضل لتطبيقات القطع الصناعية",
  "Superior Material Quality": "جودة مواد متفوقة",
  "Premium high-speed steel composition with precise heat treatment for maximum hardness and toughness": "تركيبة فولاذية ممتازة عالية السرعة مع معالجة حرارية دقيقة لتحقيق أقصى قدر من الصلابة والمتانة",
  "Extended Blade Life": "تمديد عمر الشفرة",
  "5-10 times longer service life compared to standard blades, reducing replacement frequency and downtime": "عمر خدمة أطول من 5 إلى 10 مرات مقارنة بالشفرات القياسية، مما يقلل من تكرار الاستبدال ووقت التوقف عن العمل",
  "Precision Ground Edges": "حواف أرضية دقيقة",
  "Advanced CNC grinding ensures consistent edge geometry and superior cutting accuracy with minimal burring": "يضمن الطحن المتقدم باستخدام الحاسب الآلي هندسة حافة متسقة ودقة قطع فائقة مع الحد الأدنى من الحرق",
  "Re-sharpenable Design": "تصميم قابل لإعادة الشحذ",
  "Blades can be professionally re-sharpened multiple times, maximizing ROI and reducing operational costs": "يمكن إعادة شحذ الشفرات بشكل احترافي عدة مرات، مما يؤدي إلى زيادة عائد الاستثمار إلى الحد الأقصى وتقليل تكاليف التشغيل",
  "Custom Configuration": "التكوين المخصص",
  "Tailored dimensions, bore sizes, and edge profiles to match your specific slitting machine requirements": "الأبعاد المخصصة وأحجام التجويف وملفات تعريف الحواف لتتناسب مع متطلبات آلة الحز المحددة الخاصة بك",
  "Heat Resistance": "مقاومة الحرارة",
  "Excellent thermal stability maintains cutting performance even at high-speed continuous operation": "يحافظ الاستقرار الحراري الممتاز على أداء القطع حتى عند التشغيل المستمر عالي السرعة",
  "Applications": "التطبيقات",
  "Our rolling shear slitting blades are widely used across various industries for precision material cutting": "يتم استخدام شفرات الحز الخاصة بنا على نطاق واسع في مختلف الصناعات من أجل قطع المواد بدقة",
  "Metal Processing": "معالجة المعادن",
  "Slitting steel, stainless steel, aluminum, and copper coils into precise widths for various manufacturing applications": "تقطيع ملفات الفولاذ والفولاذ المقاوم للصدأ والألومنيوم والنحاس إلى عروض دقيقة لمختلف تطبيقات التصنيع",
  "Paper & Film Industry": "صناعة الورق والأفلام",
  "Precision cutting of paper, cardboard, plastic films, and flexible packaging materials": "التقطيع الدقيق للورق والكرتون والأفلام البلاستيكية ومواد التغليف المرنة",
  "Textile Manufacturing": "صناعة المنسوجات",
  "Cutting woven and non-woven fabrics, synthetic materials, and industrial textiles": "قطع الأقمشة المنسوجة وغير المنسوجة والمواد الاصطناعية والمنسوجات الصناعية",
  "Rubber & Foam": "المطاط والرغوة",
  "Slitting rubber sheets, foam materials, and composite products with clean, precise edges": "تقطيع الصفائح المطاطية والمواد الرغوية والمنتجات المركبة بحواف نظيفة ودقيقة",
  "Converting Industry": "صناعة التحويل",
  "Label stock, adhesive tapes, and specialty materials for packaging and industrial use": "مخزون الملصقات والأشرطة اللاصقة والمواد المتخصصة للتغليف والاستخدام الصناعي",
  "Foil & Laminate": "احباط وصفح",
  "Processing aluminum foil, laminated materials, and multi-layer composite products": "معالجة رقائق الألومنيوم والمواد المصفحة والمنتجات المركبة متعددة الطبقات",
  "Blade Features & Construction": "ميزات الشفرة والبناء",
  "Better understand blade performance through detailed feature descriptions and technical characteristics": "فهم أفضل لأداء الشفرة من خلال أوصاف الميزات التفصيلية والخصائص التقنية",
  "High-Speed Steel (HSS) Material": "مادة الفولاذ عالي السرعة (HSS).",
  "Manufactured from premium grade high-speed steel with optimized alloy composition. The material undergoes vacuum heat treatment to achieve HRC 60-65 hardness, providing exceptional wear resistance and edge retention. This ensures consistent cutting performance over extended production runs with minimal degradation.": "مصنوع من الفولاذ عالي السرعة عالي الجودة مع تركيبة سبيكة محسنة. ",
  "CNC Precision Grinding": "طحن دقيق باستخدام الحاسب الآلي",
  "Each blade is precision ground using advanced CNC grinding technology to ensure perfect concentricity and edge geometry. The cutting edge is ground to micron-level tolerances (±0.01mm), resulting in clean, burr-free cuts. Surface finish is polished to Ra 0.4μm for reduced friction and enhanced cutting efficiency.": "كل شفرة تم طحنها بدقة باستخدام تقنية الطحن CNC المتقدمة لضمان التركيز المثالي وهندسة الحافة. ",
  "Optimized Edge Design": "تصميم الحافة الأمثل",
  "The cutting edge features an optimized angle and relief design specifically engineered for your application. Available in various edge profiles including straight, beveled, and specialized geometries. This design minimizes cutting force while maximizing edge life and cut quality across different materials.": "تتميز الحافة المتطورة بزاوية محسنة وتصميم بارز مصمم خصيصًا لتطبيقك. ",
  "Rigorous Quality Control": "مراقبة الجودة الصارمة",
  "Every blade undergoes comprehensive quality inspection including dimensional verification, hardness testing, surface finish measurement, and dynamic balance checking. Certified to meet international quality standards. Each blade is individually inspected and certified before shipment to ensure consistent performance.": "تخضع كل شفرة لفحص شامل للجودة بما في ذلك التحقق من الأبعاد واختبار الصلابة وقياس تشطيب السطح وفحص التوازن الديناميكي. ",
  "Standard & Custom Options": "الخيارات القياسية والمخصصة",
  "Choose from standard configurations or customize your blades to meet specific application requirements": "اختر من بين التكوينات القياسية أو قم بتخصيص الشفرات الخاصة بك لتلبية متطلبات التطبيق المحددة",
  "Standard Features": "الميزات القياسية",
  "Custom Options": "خيارات مخصصة",
  "Need help selecting the right blade configuration?": "هل تحتاج إلى مساعدة في اختيار التكوين الصحيح للشفرة؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about our rolling shear slitting blades": "الأسئلة الشائعة حول شفرات القطع والقص المتداول لدينا",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "يعتمد عمر الشفرة على المواد التي يتم قطعها، وسرعة القطع، وممارسات الصيانة. ",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "نعم، لقد تم تصميم شفرات القص الدوارة الخاصة بنا للقيام بدورات إعادة شحذ متعددة. ",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "تتعامل شفرات القص المتداول لدينا مع مجموعة واسعة من المواد بما في ذلك الفولاذ والفولاذ المقاوم للصدأ والألومنيوم والنحاس والنحاس والأفلام البلاستيكية والورق والكرتون والمطاط والرغوة والمنسوجات والمواد المركبة. ",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "يعتمد اختيار الشفرة على مواصفات جهازك ونوع المادة ومتطلبات القطع. ",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "عادةً ما يتم شحن الشفرات ذات الحجم القياسي خلال 7-10 أيام عمل. ",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "نعم، يتم تضمين الدعم الفني الشامل مع جميع طلبات الشفرات. ",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "Download Technical Catalog": "تحميل الكتالوج الفني",
  "Get detailed specifications, material grades, dimensional charts, and application guidelines for our complete range of rolling shear slitting blades. Download our comprehensive product catalog in PDF format.": "احصل على المواصفات التفصيلية ودرجات المواد ومخططات الأبعاد وإرشادات التطبيق لمجموعتنا الكاملة من شفرات القص المتدحرجة. "
}