{
  "Rolling Shear Slitting Blade": "Лезвие для продольной резки",
  "Precision-engineered circular rotary cutting blades designed for high-speed slitting operations. Manufactured from premium high-speed steel with superior hardness and wear resistance for extended service life in continuous production environments.": "Прецизионные круговые вращающиеся режущие лезвия, предназначенные для высокоскоростных операций продольной резки. ",
  "Request Quote": "Запросить цену",
  "View Specs": "Посмотреть характеристики",
  "Technical Specifications": "Технические характеристики",
  "High-performance rolling shear blades engineered for precision and durability": "Высокопроизводительные вращающиеся режущие лезвия, разработанные для обеспечения точности и долговечности.",
  "Blade Dimensions": "Размеры лезвия",
  "Outer Diameter: 50mm - 600mm": "Внешний диаметр: 50–600 мм",
  "Inner Bore: Custom specifications": "Внутреннее отверстие: пользовательские характеристики",
  "Thickness: 0.5mm - 10mm": "Толщина: 0,5–10 мм",
  "Tolerance: ±0.01mm (precision ground)": "Допуск: ±0,01 мм (прецизионная шлифовка)",
  "Material & Hardness": "Материал и твердость",
  "Material: HSS (High-Speed Steel)": "Материал: HSS (быстрорежущая сталь)",
  "Hardness: HRC 60-65": "Твердость: HRC 60-65",
  "Heat Treatment: Vacuum hardening": "Термическая обработка: вакуумная закалка",
  "Surface: Precision ground & polished": "Поверхность: прецизионная шлифовка и полировка.",
  "Cutting Performance": "Производительность резки",
  "Materials: Steel, aluminum, copper, film": "Материалы: Сталь, алюминий, медь, пленка.",
  "Speed: Up to 200m/min": "Скорость: До 200 м/мин.",
  "Edge Life: 5-10x standard blades": "Edge Life: 5-10 стандартных лезвий",
  "Re-sharpening: Multiple cycles supported": "Повторная заточка: поддерживается несколько циклов",
  "Why Choose Our Rolling Shear Blades?": "Почему стоит выбрать наши роликовые ножницы?",
  "Discover the key advantages that make our slitting blades the preferred choice for industrial cutting applications": "Откройте для себя ключевые преимущества, которые делают наши лезвия для продольной резки предпочтительным выбором для промышленной резки.",
  "Superior Material Quality": "Превосходное качество материала",
  "Premium high-speed steel composition with precise heat treatment for maximum hardness and toughness": "Состав быстрорежущей стали премиум-класса с точной термообработкой для максимальной твердости и ударной вязкости.",
  "Extended Blade Life": "Увеличенный срок службы лезвия",
  "5-10 times longer service life compared to standard blades, reducing replacement frequency and downtime": "Срок службы в 5–10 раз дольше по сравнению со стандартными лезвиями, что снижает частоту замены и время простоя.",
  "Precision Ground Edges": "Прецизионные шлифованные кромки",
  "Advanced CNC grinding ensures consistent edge geometry and superior cutting accuracy with minimal burring": "Усовершенствованное шлифование с ЧПУ обеспечивает постоянную геометрию кромки и превосходную точность резки с минимальным образованием заусенцев.",
  "Re-sharpenable Design": "Повторно затачиваемый дизайн",
  "Blades can be professionally re-sharpened multiple times, maximizing ROI and reducing operational costs": "Лезвия можно профессионально затачивать несколько раз, что максимизирует окупаемость инвестиций и снижает эксплуатационные расходы.",
  "Custom Configuration": "Пользовательская конфигурация",
  "Tailored dimensions, bore sizes, and edge profiles to match your specific slitting machine requirements": "Индивидуальные размеры, размеры отверстий и профили кромок в соответствии с вашими требованиями к продольно-резательной машине.",
  "Heat Resistance": "Теплостойкость",
  "Excellent thermal stability maintains cutting performance even at high-speed continuous operation": "Превосходная термическая стабильность сохраняет производительность резки даже при непрерывной работе на высокой скорости.",
  "Applications": "Приложения",
  "Our rolling shear slitting blades are widely used across various industries for precision material cutting": "Наши лезвия для продольной резки широко используются в различных отраслях промышленности для точной резки материалов.",
  "Metal Processing": "Обработка металлов",
  "Slitting steel, stainless steel, aluminum, and copper coils into precise widths for various manufacturing applications": "Резка рулонов стали, нержавеющей стали, алюминия и меди на точную ширину для различных производственных применений.",
  "Paper & Film Industry": "Бумажная и киноиндустрия",
  "Precision cutting of paper, cardboard, plastic films, and flexible packaging materials": "Точная резка бумаги, картона, пластиковой пленки и гибких упаковочных материалов.",
  "Textile Manufacturing": "Текстильное производство",
  "Cutting woven and non-woven fabrics, synthetic materials, and industrial textiles": "Раскрой тканых и нетканых материалов, синтетических материалов и промышленного текстиля.",
  "Rubber & Foam": "Резина и пена",
  "Slitting rubber sheets, foam materials, and composite products with clean, precise edges": "Резка резиновых листов, пенопластов и композитных изделий с чистыми и точными краями.",
  "Converting Industry": "Преобразующая промышленность",
  "Label stock, adhesive tapes, and specialty materials for packaging and industrial use": "Этикеточный материал, клейкие ленты и специальные материалы для упаковки и промышленного использования.",
  "Foil & Laminate": "Фольга и ламинат",
  "Processing aluminum foil, laminated materials, and multi-layer composite products": "Обработка алюминиевой фольги, ламинированных материалов и многослойных композитных изделий.",
  "Blade Features & Construction": "Характеристики и конструкция лезвия",
  "Better understand blade performance through detailed feature descriptions and technical characteristics": "Лучшее понимание характеристик лезвий благодаря подробным описаниям функций и техническим характеристикам.",
  "High-Speed Steel (HSS) Material": "Материал из быстрорежущей стали (HSS)",
  "Manufactured from premium grade high-speed steel with optimized alloy composition. The material undergoes vacuum heat treatment to achieve HRC 60-65 hardness, providing exceptional wear resistance and edge retention. This ensures consistent cutting performance over extended production runs with minimal degradation.": "Изготовлен из быстрорежущей стали премиум-класса с оптимизированным составом сплава. ",
  "CNC Precision Grinding": "Прецизионное шлифование с ЧПУ",
  "Each blade is precision ground using advanced CNC grinding technology to ensure perfect concentricity and edge geometry. The cutting edge is ground to micron-level tolerances (±0.01mm), resulting in clean, burr-free cuts. Surface finish is polished to Ra 0.4μm for reduced friction and enhanced cutting efficiency.": "Каждое лезвие прецизионно отшлифовано с использованием передовой технологии шлифования с ЧПУ, чтобы обеспечить идеальную концентричность и геометрию кромки. ",
  "Optimized Edge Design": "Оптимизированный дизайн кромок",
  "The cutting edge features an optimized angle and relief design specifically engineered for your application. Available in various edge profiles including straight, beveled, and specialized geometries. This design minimizes cutting force while maximizing edge life and cut quality across different materials.": "Режущая кромка имеет оптимизированный угол и рельеф, специально разработанный для вашего применения. ",
  "Rigorous Quality Control": "Строгий контроль качества",
  "Every blade undergoes comprehensive quality inspection including dimensional verification, hardness testing, surface finish measurement, and dynamic balance checking. Certified to meet international quality standards. Each blade is individually inspected and certified before shipment to ensure consistent performance.": "Каждое лезвие проходит комплексную проверку качества, включая проверку размеров, испытание на твердость, измерение качества поверхности и проверку динамического баланса. ",
  "Standard & Custom Options": "Стандартные и пользовательские опции",
  "Choose from standard configurations or customize your blades to meet specific application requirements": "Выбирайте стандартные конфигурации или настраивайте лезвия в соответствии с конкретными требованиями применения.",
  "Standard Features": "Стандартные функции",
  "Custom Options": "Пользовательские параметры",
  "Need help selecting the right blade configuration?": "Нужна помощь в выборе правильной конфигурации лезвий?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about our rolling shear slitting blades": "Распространенные вопросы о наших лезвиях для продольной резки",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "Срок службы лезвия зависит от разрезаемого материала, скорости резки и методов технического обслуживания. ",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "Да, наши роликовые ножницы рассчитаны на несколько циклов заточки. ",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "Наши роликовые ножницы работают с широким спектром материалов, включая сталь, нержавеющую сталь, алюминий, медь, латунь, пластиковую пленку, бумагу, картон, резину, пенопласт, текстиль и композитные материалы. ",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "Выбор лезвия зависит от характеристик вашей машины, типа материала и требований к резке. ",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "Лезвия стандартного размера обычно доставляются в течение 7–10 рабочих дней. ",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "Да, комплексная техническая поддержка включена во все заказы на лезвия. ",
  "Still have questions?": "Остались вопросы?",
  "Download Technical Catalog": "Скачать технический каталог",
  "Get detailed specifications, material grades, dimensional charts, and application guidelines for our complete range of rolling shear slitting blades. Download our comprehensive product catalog in PDF format.": "Получите подробные спецификации, марки материалов, таблицы размеров и рекомендации по применению для всей нашей линейки продольно-резательных лезвий. "
}