{
  "Shearing Machine Blade": "شفرة آلة القص",
  "Premium guillotine shear blades manufactured from high-grade tool steel for hydraulic shearing machines. Precision ground with four usable cutting edges, delivering exceptional hardness (HRC 58-62) and extended service life for demanding metal fabrication applications.": "شفرات القص المقصلة الممتازة مصنوعة من فولاذ الأدوات عالي الجودة لآلات القص الهيدروليكية. ",
  "Request Quote": "طلب اقتباس",
  "View Specs": "عرض المواصفات",
  "Technical Specifications": "المواصفات الفنية",
  "High-performance shearing blades engineered for precision and durability": "شفرات قص عالية الأداء مصممة لتحقيق الدقة والمتانة",
  "Material Options": "خيارات المواد",
  "Carbon Tool Steel (T8, T10): HRC 57-59": "فولاذ أداة الكربون (T8، T10): HRC 57-59",
  "Low Alloy Tool Steel (Cr12MoV, 6CrW2Si): HRC 58-62": "فولاذ أداة منخفض السبائك (Cr12MoV، 6CrW2Si): ​​HRC 58-62",
  "High-Speed Steel (HSS): Premium grade": "الفولاذ عالي السرعة (HSS): درجة ممتازة",
  "Tungsten Carbide: For hard metals": "كربيد التنغستن: للمعادن الصلبة",
  "Blade Features": "مميزات الشفرة",
  "Four usable cutting edges": "أربع حواف قطع قابلة للاستخدام",
  "Precision ground to ±0.01mm": "دقة الأرض إلى ±0.01 مم",
  "Straight edge (90°) design": "تصميم بحافة مستقيمة (90 درجة).",
  "Custom dimensions available": "الأبعاد المخصصة متاحة",
  "Cutting Performance": "أداء القطع",
  "Materials: Steel, stainless, aluminum, copper": "المواد: الفولاذ، الفولاذ المقاوم للصدأ، الألومنيوم، النحاس",
  "Thickness: 0.25\" to 2\" (6mm-50mm)": "السُمك: 0.25 بوصة إلى 2 بوصة (6 مم - 50 مم)",
  "Clean cuts with minimal deformation": "قطع نظيفة مع الحد الأدنى من التشوه",
  "Compatible with hydraulic shears": "متوافق مع المقصات الهيدروليكية",
  "Why Choose Our Shearing Machine Blades?": "لماذا تختار شفرات آلة القص الخاصة بنا؟",
  "Discover the key advantages that make our shearing blades the preferred choice for metal fabrication": "اكتشف المزايا الرئيسية التي تجعل شفرات القص لدينا الخيار المفضل لتصنيع المعادن",
  "Premium Materials": "مواد متميزة",
  "High-grade tool steel with precise heat treatment for optimal hardness and toughness balance": "أداة فولاذية عالية الجودة مع معالجة حرارية دقيقة لتحقيق التوازن الأمثل للصلابة والمتانة",
  "Four Usable Edges": "أربع حواف قابلة للاستخدام",
  "Quadruple the blade life with four precision-ground cutting edges, reducing downtime and costs": "يمكنك مضاعفة عمر الشفرة أربع مرات باستخدام أربع حواف قطع أرضية دقيقة، مما يقلل من وقت التوقف عن العمل والتكاليف",
  "Precision Ground": "أرض الدقة",
  "Advanced grinding technology ensures consistent edge geometry and superior cutting accuracy": "تضمن تقنية الطحن المتقدمة هندسة حافة متسقة ودقة قطع فائقة",
  "Superior Hardness": "صلابة متفوقة",
  "HRC 58-62 hardness rating provides exceptional wear resistance and extended service life": "يوفر تصنيف صلابة HRC 58-62 مقاومة تآكل استثنائية وعمر خدمة ممتد",
  "Clean Cuts": "قطع نظيفة",
  "Minimal deformation and burring for superior edge quality and reduced post-processing": "الحد الأدنى من التشوه والحرق للحصول على جودة حافة فائقة وتقليل المعالجة اللاحقة",
  "Custom Solutions": "حلول مخصصة",
  "Tailored dimensions and specifications to match your specific shearing machine requirements": "أبعاد ومواصفات مخصصة لتتناسب مع متطلبات آلة القص الخاصة بك",
  "Applications": "التطبيقات",
  "Our shearing machine blades are widely used across various metal fabrication industries": "تُستخدم شفرات آلة القص الخاصة بنا على نطاق واسع في مختلف صناعات تصنيع المعادن",
  "Automotive Manufacturing": "تصنيع السيارات",
  "Cutting steel sheets and aluminum plates for body panels, brackets, and structural components": "قطع صفائح الفولاذ وألواح الألمنيوم لألواح الجسم والأقواس والمكونات الهيكلية",
  "Aerospace Industry": "صناعة الطيران",
  "Precision cutting of aluminum, titanium, and specialty alloys for aircraft components": "القطع الدقيق للألمنيوم والتيتانيوم والسبائك المتخصصة لمكونات الطائرات",
  "Construction Steel": "حديد البناء",
  "Processing structural steel, roofing materials, and metal panels for building construction": "معالجة الفولاذ الهيكلي، ومواد التسقيف، والألواح المعدنية لبناء المباني",
  "Shipbuilding": "بناء السفن",
  "Cutting thick steel plates for hull construction, bulkheads, and marine structures": "قطع الألواح الفولاذية السميكة لبناء الهيكل والحواجز والهياكل البحرية",
  "Appliance Manufacturing": "تصنيع الأجهزة",
  "Sheet metal processing for refrigerators, washing machines, and household appliances": "معالجة الصفائح المعدنية للثلاجات والغسالات والأجهزة المنزلية",
  "Metal Fabrication": "تصنيع المعادن",
  "General fabrication shops cutting various metals for custom parts and components": "تقوم محلات التصنيع العامة بقطع المعادن المختلفة لأجزاء ومكونات مخصصة",
  "Blade Construction & Quality": "بناء الشفرة وجودتها",
  "Understand the advanced manufacturing processes that ensure superior blade performance": "فهم عمليات التصنيع المتقدمة التي تضمن الأداء الفائق للشفرة",
  "Premium Tool Steel Selection": "اختيار ممتاز للأداة الفولاذية",
  "Our shearing blades are manufactured from carefully selected high-grade tool steels including Cr12MoV, 6CrW2Si, and SKD-11. Each material is chosen for its optimal balance of hardness, toughness, and wear resistance. Rigorous material certification ensures consistent quality and performance across all production batches.": "يتم تصنيع شفرات القص لدينا من فولاذ الأدوات عالي الجودة الذي تم اختياره بعناية بما في ذلك Cr12MoV، و6CrW2Si، وSKD-11. ",
  "Precision Heat Treatment": "المعالجة الحرارية الدقيقة",
  "Blades undergo controlled vacuum heat treatment to achieve optimal hardness of HRC 58-62. The process includes precise temperature control, quenching, and tempering to eliminate internal stress while maximizing edge retention. This advanced heat treatment ensures uniform hardness throughout the blade and superior dimensional stability.": "تخضع الشفرات لمعالجة حرارية مفرغة يتم التحكم فيها لتحقيق الصلابة المثالية لـ HRC 58-62. ",
  "CNC Precision Grinding": "طحن دقيق باستخدام الحاسب الآلي",
  "Each cutting edge is precision ground using advanced CNC grinding equipment to tolerances of ±0.01mm. The four-edge design provides multiple cutting surfaces, extending blade life by 4x compared to single-edge blades. Flatness and parallelism are carefully controlled to ensure optimal cutting performance and minimal blade deflection.": "كل حافة قطع عبارة عن أرضية دقيقة باستخدام معدات طحن CNC متقدمة بتفاوتات تبلغ ±0.01 مم. ",
  "Comprehensive Quality Control": "مراقبة الجودة الشاملة",
  "Every blade undergoes rigorous inspection including dimensional verification, hardness testing, edge straightness measurement, and surface finish analysis. Our quality control process ensures each blade meets or exceeds industry standards. Complete traceability documentation is provided with each order for quality assurance.": "تخضع كل شفرة لفحص صارم بما في ذلك التحقق من الأبعاد واختبار الصلابة وقياس استقامة الحافة وتحليل تشطيب السطح. ",
  "Standard & Custom Options": "الخيارات القياسية والمخصصة",
  "Choose from standard configurations or customize blades to your exact specifications": "اختر من بين التكوينات القياسية أو قم بتخصيص الشفرات وفقًا لمواصفاتك الدقيقة",
  "Standard Features": "الميزات القياسية",
  "Custom Options": "خيارات مخصصة",
  "Need help selecting the right blade?": "هل تحتاج إلى مساعدة في اختيار الشفرة المناسبة؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about shearing machine blades": "الأسئلة الشائعة حول شفرات آلة القص",
  "Blade life depends on material being cut, thickness, frequency of use, and maintenance. With four usable edges, our blades can last 4 times longer than single-edge blades. Typical service life ranges from tens of thousands to hundreds of thousands of cuts. Proper blade gap adjustment and regular rotation extend blade life significantly.": "يعتمد عمر الشفرة على المادة التي يتم قطعها، والسمك، وتكرار الاستخدام، والصيانة. ",
  "Our shearing blades can cut mild steel, stainless steel, aluminum, copper, brass, and other metal alloys. The maximum cutting thickness depends on material hardness and machine capacity. Standard blades handle materials up to 50mm thick in mild steel. For harder materials like stainless steel, specialized blade materials are recommended.": "يمكن لشفرات القص الخاصة بنا أن تقوم بقطع الفولاذ الطري، والفولاذ المقاوم للصدأ، والألمنيوم، والنحاس، والنحاس الأصفر، والسبائك المعدنية الأخرى. ",
  "Signs include increased burring, rough cut edges, visible nicks or chips in the cutting edge, increased cutting force required, or material deformation. When these occur, rotate the blade to use a fresh edge. Replace when all four edges show significant wear. Regular visual inspection after every shift helps maintain optimal cutting quality.": "تشمل العلامات زيادة الحرق، أو حواف القطع الخشنة، أو الشقوق أو الرقائق المرئية في حافة القطع، أو زيادة قوة القطع المطلوبة، أو تشوه المواد. ",
  "Blades with minor wear can sometimes be professionally re-ground to restore cutting performance. However, deep nicks, cracks, or severe wear typically require replacement. Re-grinding reduces blade dimensions and may affect machine blade gap settings. We offer professional blade inspection services to determine if re-grinding is cost-effective for your situation.": "يمكن في بعض الأحيان إعادة تأريض الشفرات ذات التآكل البسيط بشكل احترافي لاستعادة أداء القطع. ",
  "For general mild steel cutting, Cr12MoV or 6CrW2Si provides excellent performance and value. For stainless steel and harder materials, consider high-speed steel (HSS) or tungsten carbide. For high-volume production, premium materials offer better long-term cost-effectiveness despite higher initial cost. Our technical team can recommend optimal materials based on your specific application.": "بالنسبة لقطع الفولاذ الطري بشكل عام، يوفر Cr12MoV أو 6CrW2Si أداءً وقيمة ممتازين. ",
  "Yes, we provide comprehensive installation guidelines, blade gap adjustment procedures, and setup recommendations with every blade order. Our technical support team is available to assist with installation questions, troubleshooting, and optimization. On-site installation services are available for large orders or complex applications.": "نعم، نحن نقدم إرشادات التثبيت الشاملة وإجراءات ضبط فجوة الشفرة وتوصيات الإعداد مع كل طلب شفرة. ",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "Download Technical Specifications": "تحميل المواصفات الفنية",
  "Get detailed material specifications, dimensional charts, hardness ratings, and application guidelines for our complete range of shearing machine blades. Download our comprehensive product catalog in PDF format.": "احصل على مواصفات المواد التفصيلية، ومخططات الأبعاد، وتقييمات الصلابة، وإرشادات التطبيق لمجموعتنا الكاملة من شفرات آلات القص. "
}