{
  "Toothed Blade": "Lame dentée",
  "Precision-engineered toothed blades for perforating, cutting, and scoring applications. Features custom tooth designs with optimized pitch and geometry for clean, consistent cuts in paper, plastic film, packaging materials, and specialty substrates.": "Lames dentées conçues avec précision pour les applications de perforation, de coupe et de marquage. ",
  "Request Quote": "Demander un devis",
  "View Specs": "Voir les spécifications",
  "Technical Specifications": "Spécifications techniques",
  "High-performance toothed blades engineered for precision perforating and cutting": "Lames dentées haute performance conçues pour une perforation et une coupe de précision",
  "Tooth Design Options": "Options de conception des dents",
  "Standard teeth (straight edge)": "Dents standard (bord droit)",
  "Serrated teeth (wave pattern)": "Dents dentelées (motif ondulé)",
  "Scalloped teeth (concave edge)": "Dents festonnées (bord concave)",
  "Custom tooth profiles available": "Profils de dents personnalisés disponibles",
  "Material & Construction": "Matériau et construction",
  "High-Speed Steel (HSS)": "Acier rapide (HSS)",
  "Tungsten Carbide": "Carbure de tungstène",
  "Stainless Steel (food grade)": "Acier inoxydable (qualité alimentaire)",
  "Precision CNC machined": "Usiné CNC avec précision",
  "Performance Features": "Caractéristiques de performances",
  "Tooth pitch: 0.5mm - 50mm": "Pas de dent : 0,5 mm - 50 mm",
  "Dimensional tolerance: ±0.01mm": "Tolérance dimensionnelle : ±0,01 mm",
  "Custom OD, ID, hub thickness": "OD, ID, épaisseur de moyeu personnalisés",
  "Heat treated for durability": "Traité thermiquement pour plus de durabilité",
  "Why Choose Our Toothed Blades?": "Pourquoi choisir nos lames dentées ?",
  "Discover the key advantages that make our toothed blades the preferred choice for perforating applications": "Découvrez les principaux avantages qui font de nos lames dentées le choix privilégié pour les applications de perforation",
  "Precision Tooth Design": "Conception de dents de précision",
  "Custom-engineered tooth geometry and spacing optimized for your specific material and application": "Géométrie et espacement des dents conçus sur mesure et optimisés pour votre matériau et votre application spécifiques",
  "Clean Perforations": "Perforations propres",
  "Consistent perforation patterns with minimal tearing and clean tear-off for professional results": "Motifs de perforation cohérents avec un minimum de déchirures et une déchirure propre pour des résultats professionnels",
  "Superior Materials": "Matériaux supérieurs",
  "Premium HSS and carbide materials ensure exceptional edge retention and extended service life": "Les matériaux HSS et carbure de qualité supérieure garantissent une rétention exceptionnelle des bords et une durée de vie prolongée",
  "Custom Engineering": "Ingénierie personnalisée",
  "Tailored dimensions, tooth patterns, and materials to match your specific machine and material requirements": "Dimensions, modèles de dents et matériaux sur mesure pour répondre aux exigences spécifiques de votre machine et de vos matériaux",
  "Versatile Applications": "Applications polyvalentes",
  "Suitable for paper, plastic film, packaging, textiles, and specialty materials across multiple industries": "Convient au papier, aux films plastiques, aux emballages, aux textiles et aux matériaux spéciaux dans plusieurs secteurs",
  "High-Speed Performance": "Performances à grande vitesse",
  "Designed for high-speed production environments with minimal downtime and consistent quality": "Conçu pour les environnements de production à grande vitesse avec des temps d'arrêt minimes et une qualité constante",
  "Applications": "Applications",
  "Our toothed blades are widely used across various industries for precision cutting and perforating": "Nos lames dentées sont largement utilisées dans diverses industries pour la coupe et la perforation de précision",
  "Paper & Printing Industry": "Industrie du papier et de l'imprimerie",
  "Perforating tickets, coupons, forms, and continuous stationery with clean tear-off lines": "Perforation de tickets, de coupons, de formulaires et de papeterie continue avec des lignes détachables nettes",
  "Packaging Industry": "Industrie de l'emballage",
  "Creating easy-open perforations in flexible packaging, labels, and tamper-evident seals": "Création de perforations faciles à ouvrir dans les emballages flexibles, les étiquettes et les scellés inviolables",
  "Plastic Film Converting": "Transformation de films plastiques",
  "Perforating and scoring plastic films, laminated materials, and specialty substrates": "Perforation et incision de films plastiques, de matériaux stratifiés et de substrats spéciaux",
  "Textile Industry": "Industrie textile",
  "Cutting and perforating woven and non-woven fabrics with precision tooth patterns": "Découpe et perforation de tissus tissés et non tissés avec des motifs de dents précis",
  "Food Processing": "Transformation des aliments",
  "Food-grade stainless steel blades for cutting and perforating food packaging materials": "Lames en acier inoxydable de qualité alimentaire pour couper et perforer les matériaux d'emballage alimentaire",
  "Converting Industry": "Industrie de conversion",
  "Label stock, adhesive tapes, and specialty materials requiring precise perforating": "Étiquettes, rubans adhésifs et matériaux spéciaux nécessitant une perforation précise",
  "Tooth Design & Engineering": "Conception et ingénierie dentaire",
  "Understand the precision engineering behind our custom toothed blade solutions": "Comprendre l'ingénierie de précision derrière nos solutions de lames dentées personnalisées",
  "Custom Tooth Patterns": "Modèles de dents personnalisés",
  "We offer a comprehensive range of tooth designs including V-toothed, diamond-toothed, convex-toothed, and serrated patterns. Each tooth profile is precision-engineered to create specific perforation characteristics. The tooth spacing (pitch) is customizable from 0.5mm to 50mm to achieve your desired cut-to-tie ratio and tear strength.": "Nous proposons une gamme complète de modèles de dents, notamment des modèles à dents en V, à dents en diamant, à dents convexes et dentelées. ",
  "Precision CNC Manufacturing": "Fabrication CNC de précision",
  "Each toothed blade is manufactured using advanced CNC machining technology for exceptional accuracy. The process includes precision cutting of the blade shape, followed by CNC grinding or wire EDM to create perfectly uniform teeth with consistent geometry. Dimensional tolerances are maintained to ±0.01mm for optimal performance.": "Chaque lame dentée est fabriquée à l'aide d'une technologie d'usinage CNC avancée pour une précision exceptionnelle. ",
  "Premium Material Selection": "Sélection de matériaux haut de gamme",
  "Material selection is critical for toothed blade performance. HSS provides excellent balance of hardness and toughness for paper and thin plastics. Tungsten carbide offers superior wear resistance for demanding applications and abrasive materials. Food-grade stainless steel is available for applications requiring FDA compliance.": "La sélection des matériaux est essentielle pour les performances de la lame dentée. ",
  "Comprehensive Quality Testing": "Tests de qualité complets",
  "Every toothed blade undergoes rigorous quality inspection including dimensional verification of tooth pitch, depth, and profile. Edge sharpness testing ensures consistent cutting performance. Dynamic balance testing for rotary blades guarantees smooth operation at high speeds. Complete traceability documentation provided with each order.": "Chaque lame dentée est soumise à un contrôle de qualité rigoureux, y compris une vérification dimensionnelle du pas, de la profondeur et du profil des dents. ",
  "Standard & Custom Options": "Options standard et personnalisées",
  "Choose from standard tooth patterns or custom-engineered solutions for your specific needs": "Choisissez parmi des modèles de dents standard ou des solutions conçues sur mesure pour vos besoins spécifiques",
  "Standard Features": "Fonctionnalités standards",
  "Custom Options": "Options personnalisées",
  "Need help designing the perfect toothed blade?": "Besoin d’aide pour concevoir la lame dentée parfaite ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about toothed blades": "Questions courantes sur les lames dentées",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "Le choix du pas de dent dépend de la résistance à la déchirure et de la qualité de perforation souhaitées. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "Les lames dentées peuvent perforer le papier, le carton, les films plastiques, les stratifiés, les feuilles, les textiles et les matériaux spéciaux. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "La durée de vie de la lame varie considérablement en fonction du matériau traité, de la vitesse de production et de la conception des dents. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "Certains modèles de lames dentées peuvent être réaffûtés, tandis que d'autres sont conçus pour être remplacés. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "Pour des devis personnalisés précis, fournissez : le diamètre extérieur de la lame, le diamètre intérieur (taille de l'alésage), l'épaisseur du moyeu, le pas de dent souhaité, le type de profil de dent si connu, le matériau en cours de traitement, l'épaisseur du matériau, la vitesse de production et toute exigence particulière. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "Oui, nous proposons des services de production d’échantillons de lames et de tests pour des applications personnalisées. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Tooth Design Guide": "Télécharger le guide de conception des dents",
  "Get our comprehensive guide to tooth patterns, pitch selection, and application guidelines for toothed blades. Includes technical specifications, material recommendations, and troubleshooting tips.": "Obtenez notre guide complet sur les modèles de dents, la sélection du pas et les directives d'application des lames dentées. "
}