{
  "Toothed Blade": "Hoja dentada",
  "Precision-engineered toothed blades for perforating, cutting, and scoring applications. Features custom tooth designs with optimized pitch and geometry for clean, consistent cuts in paper, plastic film, packaging materials, and specialty substrates.": "Hojas dentadas de precisión para aplicaciones de perforación, corte y rayado. ",
  "Request Quote": "Solicitar Cotización",
  "View Specs": "Ver especificaciones",
  "Technical Specifications": "Especificaciones técnicas",
  "High-performance toothed blades engineered for precision perforating and cutting": "Hojas dentadas de alto rendimiento diseñadas para perforar y cortar con precisión",
  "Tooth Design Options": "Opciones de diseño de dientes",
  "Standard teeth (straight edge)": "Dientes estándar (borde recto)",
  "Serrated teeth (wave pattern)": "Dientes dentados (patrón de ondas)",
  "Scalloped teeth (concave edge)": "Dientes festoneados (borde cóncavo)",
  "Custom tooth profiles available": "Perfiles de dientes personalizados disponibles",
  "Material & Construction": "Materiales y construcción",
  "High-Speed Steel (HSS)": "Acero de alta velocidad (HSS)",
  "Tungsten Carbide": "Carburo de tungsteno",
  "Stainless Steel (food grade)": "Acero inoxidable (grado alimentario)",
  "Precision CNC machined": "Mecanizado CNC de precisión",
  "Performance Features": "Características de rendimiento",
  "Tooth pitch: 0.5mm - 50mm": "Paso de dientes: 0,5 mm - 50 mm",
  "Dimensional tolerance: ±0.01mm": "Tolerancia dimensional: ±0,01 mm",
  "Custom OD, ID, hub thickness": "OD, ID y espesor del cubo personalizados",
  "Heat treated for durability": "Tratado térmicamente para mayor durabilidad.",
  "Why Choose Our Toothed Blades?": "¿Por qué elegir nuestras hojas dentadas?",
  "Discover the key advantages that make our toothed blades the preferred choice for perforating applications": "Descubra las ventajas clave que hacen de nuestras hojas dentadas la opción preferida para aplicaciones de perforación",
  "Precision Tooth Design": "Diseño de dientes de precisión",
  "Custom-engineered tooth geometry and spacing optimized for your specific material and application": "Geometría de dientes personalizada y espaciado optimizado para su material y aplicación específicos.",
  "Clean Perforations": "Limpiar perforaciones",
  "Consistent perforation patterns with minimal tearing and clean tear-off for professional results": "Patrones de perforación consistentes con desgarros mínimos y cortes limpios para obtener resultados profesionales.",
  "Superior Materials": "Materiales superiores",
  "Premium HSS and carbide materials ensure exceptional edge retention and extended service life": "Los materiales HSS y carburo de primera calidad garantizan una retención excepcional de los bordes y una vida útil prolongada.",
  "Custom Engineering": "Ingeniería personalizada",
  "Tailored dimensions, tooth patterns, and materials to match your specific machine and material requirements": "Dimensiones, patrones de dientes y materiales personalizados para adaptarse a los requisitos específicos de su máquina y material.",
  "Versatile Applications": "Aplicaciones versátiles",
  "Suitable for paper, plastic film, packaging, textiles, and specialty materials across multiple industries": "Adecuado para papel, películas plásticas, embalajes, textiles y materiales especiales en múltiples industrias.",
  "High-Speed Performance": "Rendimiento de alta velocidad",
  "Designed for high-speed production environments with minimal downtime and consistent quality": "Diseñado para entornos de producción de alta velocidad con un tiempo de inactividad mínimo y una calidad constante",
  "Applications": "Aplicaciones",
  "Our toothed blades are widely used across various industries for precision cutting and perforating": "Nuestras hojas dentadas se utilizan ampliamente en diversas industrias para corte y perforación de precisión.",
  "Paper & Printing Industry": "Industria del papel y la impresión",
  "Perforating tickets, coupons, forms, and continuous stationery with clean tear-off lines": "Perforación de billetes, cupones, formularios y material de oficina continuo con líneas de corte limpias",
  "Packaging Industry": "Industria del embalaje",
  "Creating easy-open perforations in flexible packaging, labels, and tamper-evident seals": "Creación de perforaciones de fácil apertura en envases flexibles, etiquetas y sellos a prueba de manipulaciones",
  "Plastic Film Converting": "Conversión de película plástica",
  "Perforating and scoring plastic films, laminated materials, and specialty substrates": "Perforación y rayado de películas plásticas, materiales laminados y sustratos especiales",
  "Textile Industry": "Industria textil",
  "Cutting and perforating woven and non-woven fabrics with precision tooth patterns": "Cortar y perforar telas tejidas y no tejidas con patrones de dientes de precisión",
  "Food Processing": "Procesamiento de alimentos",
  "Food-grade stainless steel blades for cutting and perforating food packaging materials": "Cuchillas de acero inoxidable apto para uso alimentario para cortar y perforar materiales de envasado de alimentos",
  "Converting Industry": "Industria de conversión",
  "Label stock, adhesive tapes, and specialty materials requiring precise perforating": "Material para etiquetas, cintas adhesivas y materiales especiales que requieren una perforación precisa",
  "Tooth Design & Engineering": "Diseño e ingeniería dental",
  "Understand the precision engineering behind our custom toothed blade solutions": "Comprenda la ingeniería de precisión detrás de nuestras soluciones de hojas dentadas personalizadas",
  "Custom Tooth Patterns": "Patrones de dientes personalizados",
  "We offer a comprehensive range of tooth designs including V-toothed, diamond-toothed, convex-toothed, and serrated patterns. Each tooth profile is precision-engineered to create specific perforation characteristics. The tooth spacing (pitch) is customizable from 0.5mm to 50mm to achieve your desired cut-to-tie ratio and tear strength.": "Ofrecemos una amplia gama de diseños de dientes que incluyen patrones de dientes en V, dientes de diamante, dientes convexos y dentados. ",
  "Precision CNC Manufacturing": "Fabricación CNC de precisión",
  "Each toothed blade is manufactured using advanced CNC machining technology for exceptional accuracy. The process includes precision cutting of the blade shape, followed by CNC grinding or wire EDM to create perfectly uniform teeth with consistent geometry. Dimensional tolerances are maintained to ±0.01mm for optimal performance.": "Cada hoja dentada se fabrica utilizando tecnología avanzada de mecanizado CNC para una precisión excepcional. ",
  "Premium Material Selection": "Selección de materiales de primera calidad",
  "Material selection is critical for toothed blade performance. HSS provides excellent balance of hardness and toughness for paper and thin plastics. Tungsten carbide offers superior wear resistance for demanding applications and abrasive materials. Food-grade stainless steel is available for applications requiring FDA compliance.": "La selección del material es fundamental para el rendimiento de la hoja dentada. ",
  "Comprehensive Quality Testing": "Pruebas de calidad integrales",
  "Every toothed blade undergoes rigorous quality inspection including dimensional verification of tooth pitch, depth, and profile. Edge sharpness testing ensures consistent cutting performance. Dynamic balance testing for rotary blades guarantees smooth operation at high speeds. Complete traceability documentation provided with each order.": "Cada hoja dentada se somete a una rigurosa inspección de calidad que incluye la verificación dimensional del paso, la profundidad y el perfil de los dientes. ",
  "Standard & Custom Options": "Opciones estándar y personalizadas",
  "Choose from standard tooth patterns or custom-engineered solutions for your specific needs": "Elija entre patrones de dientes estándar o soluciones diseñadas a medida para sus necesidades específicas",
  "Standard Features": "Características estándar",
  "Custom Options": "Opciones personalizadas",
  "Need help designing the perfect toothed blade?": "¿Necesita ayuda para diseñar la hoja dentada perfecta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about toothed blades": "Preguntas comunes sobre las hojas dentadas",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "La selección del paso de los dientes depende de la resistencia al desgarro y la calidad de perforación deseadas. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "Las hojas dentadas pueden perforar papel, cartón, películas plásticas, laminados, láminas, textiles y materiales especiales. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "La vida útil de la hoja varía significativamente según el material procesado, la velocidad de producción y el diseño de los dientes. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "Algunos diseños de hojas dentadas se pueden volver a afilar, mientras que otros están diseñados para ser reemplazados. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "Para obtener cotizaciones personalizadas precisas, proporcione: diámetro exterior de la hoja, diámetro interior (tamaño del orificio), espesor del cubo, paso de diente deseado, tipo de perfil de diente si lo conoce, material que se está procesando, espesor del material, velocidad de producción y cualquier requisito especial. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "Sí, ofrecemos servicios de prueba y producción de hojas de muestra para aplicaciones personalizadas. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Tooth Design Guide": "Descargar la guía de diseño de dientes",
  "Get our comprehensive guide to tooth patterns, pitch selection, and application guidelines for toothed blades. Includes technical specifications, material recommendations, and troubleshooting tips.": "Obtenga nuestra guía completa sobre patrones de dientes, selección de paso y pautas de aplicación para hojas dentadas. "
}