{
  "Toothed Blade": "Gezahnte Klinge",
  "Precision-engineered toothed blades for perforating, cutting, and scoring applications. Features custom tooth designs with optimized pitch and geometry for clean, consistent cuts in paper, plastic film, packaging materials, and specialty substrates.": "Präzisionsgefertigte Zahnklingen zum Perforieren, Schneiden und Ritzen. ",
  "Request Quote": "Angebot anfordern",
  "View Specs": "Technische Daten anzeigen",
  "Technical Specifications": "Technische Spezifikationen",
  "High-performance toothed blades engineered for precision perforating and cutting": "Hochleistungs-Zahnklingen für präzises Perforieren und Schneiden",
  "Tooth Design Options": "Optionen für die Zahngestaltung",
  "Standard teeth (straight edge)": "Standardverzahnung (gerade Kante)",
  "Serrated teeth (wave pattern)": "Gezahnte Zähne (Wellenmuster)",
  "Scalloped teeth (concave edge)": "Gezahnte Zähne (konkave Kante)",
  "Custom tooth profiles available": "Kundenspezifische Zahnprofile verfügbar",
  "Material & Construction": "Material & Konstruktion",
  "High-Speed Steel (HSS)": "Schnellarbeitsstahl (HSS)",
  "Tungsten Carbide": "Wolframkarbid",
  "Stainless Steel (food grade)": "Edelstahl (Lebensmittelqualität)",
  "Precision CNC machined": "Präzisions-CNC-gefräst",
  "Performance Features": "Leistungsmerkmale",
  "Tooth pitch: 0.5mm - 50mm": "Zahnteilung: 0,5 mm – 50 mm",
  "Dimensional tolerance: ±0.01mm": "Maßtoleranz: ±0,01 mm",
  "Custom OD, ID, hub thickness": "Kundenspezifischer Außendurchmesser, Innendurchmesser und Nabendicke",
  "Heat treated for durability": "Für Haltbarkeit wärmebehandelt",
  "Why Choose Our Toothed Blades?": "Warum sollten Sie sich für unsere gezahnten Klingen entscheiden?",
  "Discover the key advantages that make our toothed blades the preferred choice for perforating applications": "Entdecken Sie die entscheidenden Vorteile, die unsere gezahnten Klingen zur bevorzugten Wahl für Perforationsanwendungen machen",
  "Precision Tooth Design": "Präzises Zahndesign",
  "Custom-engineered tooth geometry and spacing optimized for your specific material and application": "Maßgeschneiderte Zahngeometrie und Zahnabstände, optimiert für Ihr spezifisches Material und Ihre Anwendung",
  "Clean Perforations": "Saubere Perforationen",
  "Consistent perforation patterns with minimal tearing and clean tear-off for professional results": "Konsistente Perforationsmuster mit minimalem Abreißen und sauberem Abriss für professionelle Ergebnisse",
  "Superior Materials": "Überlegene Materialien",
  "Premium HSS and carbide materials ensure exceptional edge retention and extended service life": "Hochwertige HSS- und Hartmetallmaterialien sorgen für außergewöhnliche Schnitthaltigkeit und längere Lebensdauer",
  "Custom Engineering": "Kundenspezifisches Engineering",
  "Tailored dimensions, tooth patterns, and materials to match your specific machine and material requirements": "Maßgeschneiderte Abmessungen, Zahnmuster und Materialien passend zu Ihren spezifischen Maschinen- und Materialanforderungen",
  "Versatile Applications": "Vielseitige Anwendungen",
  "Suitable for paper, plastic film, packaging, textiles, and specialty materials across multiple industries": "Geeignet für Papier, Kunststofffolien, Verpackungen, Textilien und Spezialmaterialien in zahlreichen Branchen",
  "High-Speed Performance": "Hochgeschwindigkeitsleistung",
  "Designed for high-speed production environments with minimal downtime and consistent quality": "Entwickelt für Hochgeschwindigkeitsproduktionsumgebungen mit minimalen Ausfallzeiten und gleichbleibender Qualität",
  "Applications": "Anwendungen",
  "Our toothed blades are widely used across various industries for precision cutting and perforating": "Unsere gezahnten Klingen werden in verschiedenen Branchen zum Präzisionsschneiden und Perforieren eingesetzt",
  "Paper & Printing Industry": "Papier- und Druckindustrie",
  "Perforating tickets, coupons, forms, and continuous stationery with clean tear-off lines": "Perforieren von Tickets, Coupons, Formularen und Endlospapier mit sauberen Abreißlinien",
  "Packaging Industry": "Verpackungsindustrie",
  "Creating easy-open perforations in flexible packaging, labels, and tamper-evident seals": "Erstellen Sie leicht zu öffnende Perforationen in flexiblen Verpackungen, Etiketten und manipulationssicheren Siegeln",
  "Plastic Film Converting": "Verarbeitung von Kunststofffolien",
  "Perforating and scoring plastic films, laminated materials, and specialty substrates": "Perforieren und Ritzen von Kunststofffolien, laminierten Materialien und Spezialsubstraten",
  "Textile Industry": "Textilindustrie",
  "Cutting and perforating woven and non-woven fabrics with precision tooth patterns": "Schneiden und Perforieren von Geweben und Vliesstoffen mit präzisen Zahnmustern",
  "Food Processing": "Lebensmittelverarbeitung",
  "Food-grade stainless steel blades for cutting and perforating food packaging materials": "Klingen aus lebensmittelechtem Edelstahl zum Schneiden und Perforieren von Lebensmittelverpackungsmaterialien",
  "Converting Industry": "Konvertierende Industrie",
  "Label stock, adhesive tapes, and specialty materials requiring precise perforating": "Etikettenmaterial, Klebebänder und Spezialmaterialien, die eine präzise Perforierung erfordern",
  "Tooth Design & Engineering": "Zahndesign und -technik",
  "Understand the precision engineering behind our custom toothed blade solutions": "Verstehen Sie die Präzisionstechnik, die hinter unseren maßgeschneiderten Zahnblattlösungen steckt",
  "Custom Tooth Patterns": "Benutzerdefinierte Zahnmuster",
  "We offer a comprehensive range of tooth designs including V-toothed, diamond-toothed, convex-toothed, and serrated patterns. Each tooth profile is precision-engineered to create specific perforation characteristics. The tooth spacing (pitch) is customizable from 0.5mm to 50mm to achieve your desired cut-to-tie ratio and tear strength.": "Wir bieten ein umfassendes Sortiment an Zahndesigns an, darunter V-verzahnte, diamantverzahnte, konvex verzahnte und gezahnte Muster. ",
  "Precision CNC Manufacturing": "Präzisions-CNC-Fertigung",
  "Each toothed blade is manufactured using advanced CNC machining technology for exceptional accuracy. The process includes precision cutting of the blade shape, followed by CNC grinding or wire EDM to create perfectly uniform teeth with consistent geometry. Dimensional tolerances are maintained to ±0.01mm for optimal performance.": "Jede gezahnte Klinge wird mithilfe fortschrittlicher CNC-Bearbeitungstechnologie für außergewöhnliche Genauigkeit hergestellt. ",
  "Premium Material Selection": "Premium-Materialauswahl",
  "Material selection is critical for toothed blade performance. HSS provides excellent balance of hardness and toughness for paper and thin plastics. Tungsten carbide offers superior wear resistance for demanding applications and abrasive materials. Food-grade stainless steel is available for applications requiring FDA compliance.": "Die Materialauswahl ist entscheidend für die Leistung der Zahnklinge. ",
  "Comprehensive Quality Testing": "Umfassende Qualitätsprüfung",
  "Every toothed blade undergoes rigorous quality inspection including dimensional verification of tooth pitch, depth, and profile. Edge sharpness testing ensures consistent cutting performance. Dynamic balance testing for rotary blades guarantees smooth operation at high speeds. Complete traceability documentation provided with each order.": "Jedes Zahnblatt wird einer strengen Qualitätsprüfung unterzogen, einschließlich der Maßprüfung von Zahnteilung, -tiefe und -profil. ",
  "Standard & Custom Options": "Standard- und benutzerdefinierte Optionen",
  "Choose from standard tooth patterns or custom-engineered solutions for your specific needs": "Wählen Sie zwischen Standardzahnmustern oder maßgeschneiderten Lösungen für Ihre spezifischen Anforderungen",
  "Standard Features": "Standardfunktionen",
  "Custom Options": "Benutzerdefinierte Optionen",
  "Need help designing the perfect toothed blade?": "Benötigen Sie Hilfe bei der Gestaltung des perfekten Zahnblatts?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about toothed blades": "Häufige Fragen zu Zahnklingen",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "Die Auswahl der Zahnteilung hängt von der gewünschten Reißfestigkeit und Perforationsqualität ab. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "Gezahnte Klingen können Papier, Pappe, Kunststofffolien, Laminate, Folien, Textilien und Spezialmaterialien perforieren. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "Die Lebensdauer der Klinge variiert erheblich je nach verarbeitetem Material, Produktionsgeschwindigkeit und Zahndesign. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "Einige gezahnte Klingendesigns können nachgeschärft werden, während andere für den Austausch konzipiert sind. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "Für genaue kundenspezifische Angebote geben Sie Folgendes an: Blattaußendurchmesser, Innendurchmesser (Bohrungsgröße), Nabendicke, gewünschte Zahnteilung, Zahnprofiltyp, sofern bekannt, zu verarbeitendes Material, Materialdicke, Produktionsgeschwindigkeit und etwaige spezielle Anforderungen. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "Ja, wir bieten die Herstellung und Prüfung von Musterblättern für kundenspezifische Anwendungen an. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Download Tooth Design Guide": "Laden Sie den Zahndesign-Leitfaden herunter",
  "Get our comprehensive guide to tooth patterns, pitch selection, and application guidelines for toothed blades. Includes technical specifications, material recommendations, and troubleshooting tips.": "Holen Sie sich unseren umfassenden Leitfaden zu Zahnmustern, Teilungsauswahl und Anwendungsrichtlinien für Zahnblätter. "
}