{
  "Toothed Blade": "شفرة مسننة",
  "Precision-engineered toothed blades for perforating, cutting, and scoring applications. Features custom tooth designs with optimized pitch and geometry for clean, consistent cuts in paper, plastic film, packaging materials, and specialty substrates.": "شفرات مسننة مصممة بدقة لتطبيقات التثقيب والقطع والتسجيل. ",
  "Request Quote": "طلب اقتباس",
  "View Specs": "عرض المواصفات",
  "Technical Specifications": "المواصفات الفنية",
  "High-performance toothed blades engineered for precision perforating and cutting": "شفرات مسننة عالية الأداء مصممة للتثقيب والقطع بدقة",
  "Tooth Design Options": "خيارات تصميم الأسنان",
  "Standard teeth (straight edge)": "الأسنان القياسية (الحافة المستقيمة)",
  "Serrated teeth (wave pattern)": "أسنان مسننة (نمط موجة)",
  "Scalloped teeth (concave edge)": "أسنان صدفية (حافة مقعرة)",
  "Custom tooth profiles available": "تتوفر ملفات تعريف الأسنان المخصصة",
  "Material & Construction": "المواد والبناء",
  "High-Speed Steel (HSS)": "الفولاذ عالي السرعة (HSS)",
  "Tungsten Carbide": "كربيد التنغستن",
  "Stainless Steel (food grade)": "الفولاذ المقاوم للصدأ (الغذاء الصف)",
  "Precision CNC machined": "ماكينة CNC دقيقة",
  "Performance Features": "ميزات الأداء",
  "Tooth pitch: 0.5mm - 50mm": "مسافة الأسنان: 0.5 مم - 50 مم",
  "Dimensional tolerance: ±0.01mm": "التسامح الأبعاد: ± 0.01 مم",
  "Custom OD, ID, hub thickness": "مخصص OD، معرف، سمك المحور",
  "Heat treated for durability": "تمت معالجته بالحرارة من أجل المتانة",
  "Why Choose Our Toothed Blades?": "لماذا تختار شفراتنا المسننة؟",
  "Discover the key advantages that make our toothed blades the preferred choice for perforating applications": "اكتشف المزايا الرئيسية التي تجعل شفراتنا المسننة الخيار المفضل لتطبيقات التثقيب",
  "Precision Tooth Design": "تصميم دقيق للأسنان",
  "Custom-engineered tooth geometry and spacing optimized for your specific material and application": "تم تصميم هندسة الأسنان وتباعدها خصيصًا لموادك وتطبيقاتك المحددة",
  "Clean Perforations": "الثقوب النظيفة",
  "Consistent perforation patterns with minimal tearing and clean tear-off for professional results": "أنماط ثقب متسقة مع الحد الأدنى من التمزق والتمزق النظيف للحصول على نتائج احترافية",
  "Superior Materials": "مواد متفوقة",
  "Premium HSS and carbide materials ensure exceptional edge retention and extended service life": "تضمن مواد HSS والكربيد المتميزة الاحتفاظ بالحواف بشكل استثنائي وإطالة عمر الخدمة",
  "Custom Engineering": "الهندسة المخصصة",
  "Tailored dimensions, tooth patterns, and materials to match your specific machine and material requirements": "أبعاد وأنماط أسنان ومواد مخصصة لتتناسب مع متطلبات الماكينة والمواد الخاصة بك",
  "Versatile Applications": "تطبيقات متعددة الاستخدامات",
  "Suitable for paper, plastic film, packaging, textiles, and specialty materials across multiple industries": "مناسب للورق والأفلام البلاستيكية والتغليف والمنسوجات والمواد المتخصصة في العديد من الصناعات",
  "High-Speed Performance": "أداء عالي السرعة",
  "Designed for high-speed production environments with minimal downtime and consistent quality": "تم تصميمه لبيئات الإنتاج عالية السرعة مع الحد الأدنى من فترات التوقف عن العمل وجودة متسقة",
  "Applications": "التطبيقات",
  "Our toothed blades are widely used across various industries for precision cutting and perforating": "تُستخدم شفراتنا المسننة على نطاق واسع في مختلف الصناعات من أجل القطع والتثقيب الدقيق",
  "Paper & Printing Industry": "صناعة الورق والطباعة",
  "Perforating tickets, coupons, forms, and continuous stationery with clean tear-off lines": "تثقيب التذاكر والكوبونات والنماذج والقرطاسية المستمرة بخطوط تمزيق نظيفة",
  "Packaging Industry": "صناعة التعبئة والتغليف",
  "Creating easy-open perforations in flexible packaging, labels, and tamper-evident seals": "إنشاء ثقوب سهلة الفتح في العبوات المرنة والملصقات والأختام الواضحة للتلاعب",
  "Plastic Film Converting": "تحويل الفيلم البلاستيكي",
  "Perforating and scoring plastic films, laminated materials, and specialty substrates": "تثقيب وتسجيل الأغشية البلاستيكية والمواد المصفحة والركائز المتخصصة",
  "Textile Industry": "صناعة النسيج",
  "Cutting and perforating woven and non-woven fabrics with precision tooth patterns": "قطع وتثقيب الأقمشة المنسوجة وغير المنسوجة بأنماط أسنان دقيقة",
  "Food Processing": "تجهيز الأغذية",
  "Food-grade stainless steel blades for cutting and perforating food packaging materials": "شفرات من الفولاذ المقاوم للصدأ صالحة للطعام لقطع وثقب مواد تغليف المواد الغذائية",
  "Converting Industry": "صناعة التحويل",
  "Label stock, adhesive tapes, and specialty materials requiring precise perforating": "مخزون الملصقات والأشرطة اللاصقة والمواد المتخصصة التي تتطلب تثقيبًا دقيقًا",
  "Tooth Design & Engineering": "تصميم وهندسة الأسنان",
  "Understand the precision engineering behind our custom toothed blade solutions": "فهم الهندسة الدقيقة وراء حلول الشفرات المسننة المخصصة لدينا",
  "Custom Tooth Patterns": "أنماط الأسنان المخصصة",
  "We offer a comprehensive range of tooth designs including V-toothed, diamond-toothed, convex-toothed, and serrated patterns. Each tooth profile is precision-engineered to create specific perforation characteristics. The tooth spacing (pitch) is customizable from 0.5mm to 50mm to achieve your desired cut-to-tie ratio and tear strength.": "نحن نقدم مجموعة شاملة من تصميمات الأسنان بما في ذلك الأنماط ذات الأسنان على شكل V، والأسنان الماسية، والأسنان المحدبة، والمسننة. ",
  "Precision CNC Manufacturing": "التصنيع باستخدام الحاسب الآلي الدقيق",
  "Each toothed blade is manufactured using advanced CNC machining technology for exceptional accuracy. The process includes precision cutting of the blade shape, followed by CNC grinding or wire EDM to create perfectly uniform teeth with consistent geometry. Dimensional tolerances are maintained to ±0.01mm for optimal performance.": "يتم تصنيع كل شفرة مسننة باستخدام تقنية التصنيع CNC المتقدمة للحصول على دقة استثنائية. ",
  "Premium Material Selection": "اختيار المواد المتميزة",
  "Material selection is critical for toothed blade performance. HSS provides excellent balance of hardness and toughness for paper and thin plastics. Tungsten carbide offers superior wear resistance for demanding applications and abrasive materials. Food-grade stainless steel is available for applications requiring FDA compliance.": "يعد اختيار المواد أمرًا بالغ الأهمية لأداء الشفرة المسننة. ",
  "Comprehensive Quality Testing": "اختبار الجودة الشامل",
  "Every toothed blade undergoes rigorous quality inspection including dimensional verification of tooth pitch, depth, and profile. Edge sharpness testing ensures consistent cutting performance. Dynamic balance testing for rotary blades guarantees smooth operation at high speeds. Complete traceability documentation provided with each order.": "تخضع كل شفرة مسننة لفحص صارم للجودة بما في ذلك التحقق من الأبعاد من درجة الأسنان والعمق والشكل الجانبي. ",
  "Standard & Custom Options": "الخيارات القياسية والمخصصة",
  "Choose from standard tooth patterns or custom-engineered solutions for your specific needs": "اختر من بين أنماط الأسنان القياسية أو الحلول المصممة خصيصًا لتلبية احتياجاتك الخاصة",
  "Standard Features": "الميزات القياسية",
  "Custom Options": "خيارات مخصصة",
  "Need help designing the perfect toothed blade?": "هل تحتاج إلى مساعدة في تصميم الشفرة المسننة المثالية؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about toothed blades": "الأسئلة الشائعة حول الشفرات المسننة",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "يعتمد اختيار درجة الأسنان على قوة التمزق المطلوبة وجودة التثقيب. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "يمكن للشفرات المسننة أن تثقب الورق والكرتون والأفلام البلاستيكية والشرائح والرقائق والمنسوجات والمواد المتخصصة. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "يختلف عمر الشفرة بشكل كبير بناءً على المواد المعالجة وسرعة الإنتاج وتصميم الأسنان. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "يمكن إعادة شحذ بعض تصميمات الشفرات المسننة، بينما يتم تصميم البعض الآخر للاستبدال. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "للحصول على عروض أسعار مخصصة دقيقة، قم بتوفير: القطر الخارجي للشفرة، والقطر الداخلي (حجم التجويف)، وسمك المحور، ودرجة السن المطلوبة، ونوع ملف تعريف السن إذا كان معروفًا، والمواد التي تتم معالجتها، وسمك المادة، وسرعة الإنتاج، وأي متطلبات خاصة. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "نعم، نحن نقدم خدمات إنتاج واختبار الشفرات للتطبيقات المخصصة. ",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "Download Tooth Design Guide": "تحميل دليل تصميم الأسنان",
  "Get our comprehensive guide to tooth patterns, pitch selection, and application guidelines for toothed blades. Includes technical specifications, material recommendations, and troubleshooting tips.": "احصل على دليلنا الشامل لأنماط الأسنان واختيار درجة الصوت وإرشادات تطبيق الشفرات المسننة. "
}