{
  "Toothed Blade": "Зубчатый клинок",
  "Precision-engineered toothed blades for perforating, cutting, and scoring applications. Features custom tooth designs with optimized pitch and geometry for clean, consistent cuts in paper, plastic film, packaging materials, and specialty substrates.": "Прецизионные зубчатые лезвия для перфорации, резки и надрезки. ",
  "Request Quote": "Запросить цену",
  "View Specs": "Посмотреть характеристики",
  "Technical Specifications": "Технические характеристики",
  "High-performance toothed blades engineered for precision perforating and cutting": "Высокопроизводительные зубчатые лезвия, разработанные для точной перфорации и резки.",
  "Tooth Design Options": "Варианты дизайна зубов",
  "Standard teeth (straight edge)": "Стандартные зубья (прямая кромка)",
  "Serrated teeth (wave pattern)": "Зубчатые зубцы (волнистый рисунок)",
  "Scalloped teeth (concave edge)": "Зубчатые зубы (вогнутый край)",
  "Custom tooth profiles available": "Доступны индивидуальные профили зубов",
  "Material & Construction": "Материал и конструкция",
  "High-Speed Steel (HSS)": "Быстрорежущая сталь (HSS)",
  "Tungsten Carbide": "Карбид вольфрама",
  "Stainless Steel (food grade)": "Нержавеющая сталь (пищевая)",
  "Precision CNC machined": "Прецизионная обработка на станке с ЧПУ",
  "Performance Features": "Характеристики производительности",
  "Tooth pitch: 0.5mm - 50mm": "Шаг зубьев: 0,5–50 мм.",
  "Dimensional tolerance: ±0.01mm": "Допуск на размер: ± 0,01 мм",
  "Custom OD, ID, hub thickness": "Нестандартный внешний вид, внутренний диаметр, толщина ступицы",
  "Heat treated for durability": "Термическая обработка для долговечности",
  "Why Choose Our Toothed Blades?": "Почему стоит выбрать наши зубчатые лезвия?",
  "Discover the key advantages that make our toothed blades the preferred choice for perforating applications": "Откройте для себя ключевые преимущества, которые делают наши зубчатые лезвия предпочтительным выбором для перфорации.",
  "Precision Tooth Design": "Прецизионный дизайн зуба",
  "Custom-engineered tooth geometry and spacing optimized for your specific material and application": "Специально разработанная геометрия и расстояние между зубьями оптимизированы для конкретного материала и применения.",
  "Clean Perforations": "Чистая перфорация",
  "Consistent perforation patterns with minimal tearing and clean tear-off for professional results": "Равномерный рисунок перфорации с минимальными разрывами и чистым отрывом для достижения профессиональных результатов.",
  "Superior Materials": "Превосходные материалы",
  "Premium HSS and carbide materials ensure exceptional edge retention and extended service life": "Высококачественная быстрорежущая сталь и твердосплавные материалы обеспечивают исключительное удержание кромки и увеличенный срок службы.",
  "Custom Engineering": "Индивидуальное проектирование",
  "Tailored dimensions, tooth patterns, and materials to match your specific machine and material requirements": "Индивидуальные размеры, расположение зубьев и материалы в соответствии с вашими требованиями к конкретному станку и материалам.",
  "Versatile Applications": "Универсальные приложения",
  "Suitable for paper, plastic film, packaging, textiles, and specialty materials across multiple industries": "Подходит для бумаги, пластиковой пленки, упаковки, текстиля и специальных материалов в различных отраслях промышленности.",
  "High-Speed Performance": "Высокоскоростная производительность",
  "Designed for high-speed production environments with minimal downtime and consistent quality": "Разработан для высокоскоростных производственных сред с минимальным временем простоя и стабильным качеством.",
  "Applications": "Приложения",
  "Our toothed blades are widely used across various industries for precision cutting and perforating": "Наши зубчатые лезвия широко используются в различных отраслях промышленности для точной резки и перфорации.",
  "Paper & Printing Industry": "Бумажная и полиграфическая промышленность",
  "Perforating tickets, coupons, forms, and continuous stationery with clean tear-off lines": "Перфорация билетов, купонов, бланков и непрерывных канцелярских товаров с чистыми линиями отрыва.",
  "Packaging Industry": "Упаковочная промышленность",
  "Creating easy-open perforations in flexible packaging, labels, and tamper-evident seals": "Создание легко открывающихся перфорационных отверстий в гибкой упаковке, этикетках и пломбах с защитой от несанкционированного доступа.",
  "Plastic Film Converting": "Преобразование пластиковой пленки",
  "Perforating and scoring plastic films, laminated materials, and specialty substrates": "Перфорация и надрез пластиковых пленок, ламинированных материалов и специальных подложек",
  "Textile Industry": "Текстильная промышленность",
  "Cutting and perforating woven and non-woven fabrics with precision tooth patterns": "Резка и перфорация тканых и нетканых материалов с точным расположением зубьев.",
  "Food Processing": "Пищевая промышленность",
  "Food-grade stainless steel blades for cutting and perforating food packaging materials": "Лезвия из пищевой нержавеющей стали для резки и перфорации упаковочных материалов для пищевых продуктов.",
  "Converting Industry": "Преобразующая промышленность",
  "Label stock, adhesive tapes, and specialty materials requiring precise perforating": "Этикеточный материал, клейкие ленты и специальные материалы, требующие точной перфорации.",
  "Tooth Design & Engineering": "Дизайн и инженерия зубов",
  "Understand the precision engineering behind our custom toothed blade solutions": "Поймите точную инженерию, лежащую в основе наших индивидуальных решений с зубчатыми лезвиями.",
  "Custom Tooth Patterns": "Индивидуальные образцы зубов",
  "We offer a comprehensive range of tooth designs including V-toothed, diamond-toothed, convex-toothed, and serrated patterns. Each tooth profile is precision-engineered to create specific perforation characteristics. The tooth spacing (pitch) is customizable from 0.5mm to 50mm to achieve your desired cut-to-tie ratio and tear strength.": "Мы предлагаем широкий ассортимент зубьев, включая V-образные, ромбовидные, выпуклые и зубчатые. ",
  "Precision CNC Manufacturing": "Прецизионное производство с ЧПУ",
  "Each toothed blade is manufactured using advanced CNC machining technology for exceptional accuracy. The process includes precision cutting of the blade shape, followed by CNC grinding or wire EDM to create perfectly uniform teeth with consistent geometry. Dimensional tolerances are maintained to ±0.01mm for optimal performance.": "Каждое зубчатое лезвие изготовлено с использованием передовой технологии обработки с ЧПУ, обеспечивающей исключительную точность. ",
  "Premium Material Selection": "Выбор материала премиум-класса",
  "Material selection is critical for toothed blade performance. HSS provides excellent balance of hardness and toughness for paper and thin plastics. Tungsten carbide offers superior wear resistance for demanding applications and abrasive materials. Food-grade stainless steel is available for applications requiring FDA compliance.": "Выбор материала имеет решающее значение для производительности зубчатого полотна. ",
  "Comprehensive Quality Testing": "Комплексное тестирование качества",
  "Every toothed blade undergoes rigorous quality inspection including dimensional verification of tooth pitch, depth, and profile. Edge sharpness testing ensures consistent cutting performance. Dynamic balance testing for rotary blades guarantees smooth operation at high speeds. Complete traceability documentation provided with each order.": "Каждое зубчатое полотно проходит строгий контроль качества, включая проверку размеров шага, глубины и профиля зубьев. ",
  "Standard & Custom Options": "Стандартные и пользовательские опции",
  "Choose from standard tooth patterns or custom-engineered solutions for your specific needs": "Выбирайте стандартные модели зубьев или индивидуально разработанные решения для ваших конкретных потребностей.",
  "Standard Features": "Стандартные функции",
  "Custom Options": "Пользовательские параметры",
  "Need help designing the perfect toothed blade?": "Нужна помощь в разработке идеального зубчатого лезвия?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about toothed blades": "Частые вопросы о зубчатых лезвиях",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "Выбор шага зубьев зависит от желаемой прочности на разрыв и качества перфорации. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "Зубчатые лезвия могут перфорировать бумагу, картон, пластиковую пленку, ламинат, фольгу, текстиль и специальные материалы. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "Срок службы лезвия значительно варьируется в зависимости от обрабатываемого материала, скорости производства и конструкции зубьев. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "Некоторые конструкции зубчатых лезвий можно затачивать повторно, а другие предназначены для замены. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "Для получения точного индивидуального предложения укажите: внешний диаметр лезвия, внутренний диаметр (размер отверстия), толщину ступицы, желаемый шаг зубьев, тип профиля зуба, если известен, обрабатываемый материал, толщину материала, скорость производства и любые особые требования. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "Да, мы предлагаем услуги по изготовлению и тестированию образцов лезвий для индивидуальных применений. ",
  "Still have questions?": "Остались вопросы?",
  "Download Tooth Design Guide": "Скачать Руководство по дизайну зубов",
  "Get our comprehensive guide to tooth patterns, pitch selection, and application guidelines for toothed blades. Includes technical specifications, material recommendations, and troubleshooting tips.": "Получите наше подробное руководство по расположению зубьев, выбору шага и рекомендациям по применению зубчатых полотен. "
}