{
  "About Rucheng Technology": "如程科技について",
  "Your Trusted Partner in Sheet Metal Fabrication": "板金加工における信頼できるパートナー",
  "Company Overview": "会社概要",
  "Nanjing Rucheng Technology Co., Ltd. is a modern management enterprise that produces all kinds of ordinary\n            and CNC bending machines, plate shears, laser cutting machines and supporting knives and molds. We have a\n            number of knowledgeable and young teams dedicated to the development of sheet metal processing machine\n            tools.": "南京如程科技有限公司は、各種普通およびCNCベンディングマシン、板金シャー、レーザー切断機、および関連刃物と金型を製造する近代的な経営企業です。板金加工工作機械の開発に専念する知識豊富で若いチームを多数擁しています。",
  "Founded with a vision to revolutionize the sheet metal fabrication industry, Rucheng Technology has grown\n            from a small workshop to a leading manufacturer of precision machinery. Our commitment to innovation,\n            quality, and customer satisfaction has made us a trusted partner for businesses worldwide.": "板金加工業界に革命をもたらすというビジョンのもとに設立された如程科技は、小さな工場から精密機械の大手メーカーへと成長しました。革新、品質、顧客満足への私たちのコミットメントにより、世界中の企業から信頼されるパートナーとなっています。",
  "Our Mission": "ミッション",
  "To provide innovative, high-quality sheet metal fabrication solutions that empower our customers to achieve\n            excellence in their manufacturing processes while maintaining the highest standards of reliability and\n            efficiency.": "お客様が製造プロセスで卓越性を達成できるよう、最高水準の信頼性と効率性を維持しながら、革新的で高品質な板金加工ソリューションを提供すること。",
  "Our Vision": "ビジョン",
  "To be the global leader in sheet metal fabrication technology, recognized for our innovation, quality, and\n            commitment to customer success, while contributing to the advancement of manufacturing excellence worldwide.": "革新、品質、顧客成功へのコミットメントで認められ、世界中の製造業の卓越性の向上に貢献しながら、板金加工技術のグローバルリーダーになること。",
  "Our Core Values": "コアバリュー",
  "Quality Excellence": "卓越した品質",
  "We maintain the highest standards of quality in every product we manufacture.": "製造するすべての製品において、最高レベルの品質基準を維持しています。",
  "Innovation": "革新",
  "We continuously innovate to provide cutting-edge solutions for our customers.": "お客様に最先端のソリューションを提供するために、常に革新を続けています。",
  "Customer Focus": "顧客第一",
  "Our customers' success is our success. We prioritize their needs above all.": "お客様の成功が私たちの成功です。お客様のニーズを何よりも優先します。",
  "Teamwork": "チームワーク",
  "We believe in the power of collaboration and mutual respect among our team.": "チーム内の協力と相互尊重の力を信じています。",
  "Our Journey": "私たちの歩み",
  "Company Founded": "会社設立",
  "Rucheng Technology was established with a vision to revolutionize sheet metal fabrication.": "如程科技は、板金加工業界に革命をもたらすというビジョンのもとに設立されました。",
  "Technology Innovation": "技術革新",
  "Launched our first CNC bending machine with advanced automation features.": "先進的な自動化機能を備えた初のCNCベンディングマシンを発売しました。",
  "Global Expansion": "グローバル展開",
  "Expanded our presence to over 50 countries worldwide.": "世界50カ国以上に事業を展開しております。",
  "Our Expert Team": "専門チーム",
  "Our team consists of experienced engineers, skilled technicians, and dedicated professionals who are passionate\n        about delivering the best solutions to our customers.": "私たちのチームは、お客様に最高のソリューションを提供することに情熱を注ぐ、経験豊富なエンジニア、熟練した技術者、献身的な専門家で構成されています。",
  "Engineering Team": "エンジニアリングチーム",
  "R&D & Innovation": "研究開発と革新",
  "Production Team": "生産チーム",
  "Manufacturing Excellence": "製造の卓越性",
  "After-sales Team": "アフターサービスチーム",
  "After-sales Service": "アフターサービス",
  "Certifications & Awards": "認証と受賞",
  "ISO 9001:2015": "ISO 9001:2015",
  "Quality Management System Certification": "品質マネジメントシステム認証",
  "CE Certification": "CE認証",
  "European Conformity Mark": "欧州適合マーク",
  "Best Manufacturer": "ベストメーカー",
  "Industry Excellence Award 2023": "2023年業界優秀賞"
}