{
  "About Rucheng Technology": "عن تقنية روتشنغ",
  "Your Trusted Partner in Sheet Metal Fabrication": "شريكك الموثوق في تصنيع الصفائح المعدنية",
  "Company Overview": "نظرة عامة على الشركة",
  "Nanjing Rucheng Technology Co., Ltd. is a modern management enterprise that produces all kinds of ordinary\n            and CNC bending machines, plate shears, laser cutting machines and supporting knives and molds. We have a\n            number of knowledgeable and young teams dedicated to the development of sheet metal processing machine\n            tools.": "شركة نانجينغ روتشنغ للتكنولوجيا المحدودة هي مؤسسة إدارية حديثة تنتج جميع أنواع آلات الثني العادية والتحكم الرقمي، ومقصات الصفائح، وآلات القطع بالليزر، والسكاكين والقوالب الداعمة. لدينا عدد من الفرق الشابة والمعرفية المكرسة لتطوير أدوات آلات معالجة الصفائح المعدنية.",
  "Founded with a vision to revolutionize the sheet metal fabrication industry, Rucheng Technology has grown\n            from a small workshop to a leading manufacturer of precision machinery. Our commitment to innovation,\n            quality, and customer satisfaction has made us a trusted partner for businesses worldwide.": "تأسست تكنولوجيا روتشنغ برؤية لإحداث ثورة في صناعة تصنيع الصفائح المعدنية، وقد نمت من ورشة صغيرة إلى شركة رائدة في تصنيع الآلات الدقيقة. إن التزامنا بالابتكار والجودة ورضا العملاء جعلنا شريكًا موثوقًا للشركات في جميع أنحاء العالم.",
  "Our Mission": "مهمتنا",
  "To provide innovative, high-quality sheet metal fabrication solutions that empower our customers to achieve\n            excellence in their manufacturing processes while maintaining the highest standards of reliability and\n            efficiency.": "تقديم حلول مبتكرة وعالية الجودة لتصنيع الصفائح المعدنية تمكن عملائنا من تحقيق التميز في عمليات التصنيع الخاصة بهم مع الحفاظ على أعلى معايير الموثوقية والكفاءة.",
  "Our Vision": "رؤيتنا",
  "To be the global leader in sheet metal fabrication technology, recognized for our innovation, quality, and\n            commitment to customer success, while contributing to the advancement of manufacturing excellence worldwide.": "أن نكون الرائد العالمي في تكنولوجيا تصنيع الصفائح المعدنية، معترف بنا لابتكارنا وجودتنا والتزامنا بنجاح العملاء، مع المساهمة في تقدم التميز في التصنيع في جميع أنحاء العالم.",
  "Our Core Values": "قيمنا الأساسية",
  "Quality Excellence": "التميز في الجودة",
  "We maintain the highest standards of quality in every product we manufacture.": "نحافظ على أعلى معايير الجودة في كل منتج نصنعه.",
  "Innovation": "الابتكار",
  "We continuously innovate to provide cutting-edge solutions for our customers.": "نبتكر باستمرار لتقديم حلول متطورة لعملائنا.",
  "Customer Focus": "التركيز على العملاء",
  "Our customers' success is our success. We prioritize their needs above all.": "نجاح عملائنا هو نجاحنا. نعطي الأولوية لاحتياجاتهم قبل كل شيء.",
  "Teamwork": "العمل الجماعي",
  "We believe in the power of collaboration and mutual respect among our team.": "نؤمن بقوة التعاون والاحترام المتبادل بين فريقنا.",
  "Our Journey": "رحلتنا",
  "Company Founded": "تأسيس الشركة",
  "Rucheng Technology was established with a vision to revolutionize sheet metal fabrication.": "تأسست تقنية روتشنغ برؤية لإحداث ثورة في تصنيع الصفائح المعدنية.",
  "Technology Innovation": "الابتكار التكنولوجي",
  "Launched our first CNC bending machine with advanced automation features.": "أطلقنا أول ماكينة ثني بالتحكم الرقمي مع ميزات أتمتة متقدمة.",
  "Global Expansion": "التوسع العالمي",
  "Expanded our presence to over 50 countries worldwide.": "قمنا بتوسيع تواجدنا لأكثر من 50 دولة حول العالم.",
  "Our Expert Team": "فريق الخبراء لدينا",
  "Our team consists of experienced engineers, skilled technicians, and dedicated professionals who are passionate\n        about delivering the best solutions to our customers.": "يتكون فريقنا من مهندسين ذوي خبرة وفنيين مهرة ومحترفين متفانين شغوفين بتقديم أفضل الحلول لعملائنا.",
  "Engineering Team": "فريق الهندسة",
  "R&D & Innovation": "البحث والتطوير والابتكار",
  "Production Team": "فريق الإنتاج",
  "Manufacturing Excellence": "التميز في التصنيع",
  "After-sales Team": "فريق ما بعد البيع",
  "After-sales Service": "خدمة ما بعد البيع",
  "Certifications & Awards": "الشهادات والجوائز",
  "ISO 9001:2015": "ISO 9001:2015",
  "Quality Management System Certification": "شهادة نظام إدارة الجودة",
  "CE Certification": "شهادة CE",
  "European Conformity Mark": "علامة المطابقة الأوروبية",
  "Best Manufacturer": "أفضل شركة مصنعة",
  "Industry Excellence Award 2023": "جائزة التميز الصناعي 2023"
}