{
  "About Rucheng Technology": "О компании Rucheng Technology",
  "Your Trusted Partner in Sheet Metal Fabrication": "Ваш надежный партнер в области обработки листового металла",
  "Company Overview": "Обзор компании",
  "Nanjing Rucheng Technology Co., Ltd. is a modern management enterprise that produces all kinds of ordinary\n            and CNC bending machines, plate shears, laser cutting machines and supporting knives and molds. We have a\n            number of knowledgeable and young teams dedicated to the development of sheet metal processing machine\n            tools.": "Nanjing Rucheng Technology Co., Ltd. - это современное управленческое предприятие, производящее все виды обычных и ЧПУ гибочных станков, гильотинных ножниц, лазерных резаков, а также вспомогательных ножей и пресс-форм. У нас есть несколько знающих и молодых команд, занимающихся разработкой станков для обработки листового металла.",
  "Founded with a vision to revolutionize the sheet metal fabrication industry, Rucheng Technology has grown\n            from a small workshop to a leading manufacturer of precision machinery. Our commitment to innovation,\n            quality, and customer satisfaction has made us a trusted partner for businesses worldwide.": "Основанная с видением революционизировать индустрию обработки листового металла, Rucheng Technology выросла из небольшой мастерской в ведущего производителя прецизионного оборудования. Наша приверженность инновациям, качеству и удовлетворенности клиентов сделала нас надежным партнером для предприятий по всему миру.",
  "Our Mission": "Наша миссия",
  "To provide innovative, high-quality sheet metal fabrication solutions that empower our customers to achieve\n            excellence in their manufacturing processes while maintaining the highest standards of reliability and\n            efficiency.": "Предоставлять инновационные, высококачественные решения для обработки листового металла, которые позволяют нашим клиентам достигать совершенства в своих производственных процессах, сохраняя при этом высочайшие стандарты надежности и эффективности.",
  "Our Vision": "Наше видение",
  "To be the global leader in sheet metal fabrication technology, recognized for our innovation, quality, and\n            commitment to customer success, while contributing to the advancement of manufacturing excellence worldwide.": "Быть мировым лидером в технологии обработки листового металла, признанным за наши инновации, качество и приверженность успеху клиентов, внося вклад в продвижение производственного совершенства по всему миру.",
  "Our Core Values": "Наши основные ценности",
  "Quality Excellence": "Превосходство качества",
  "We maintain the highest standards of quality in every product we manufacture.": "Мы поддерживаем самые высокие стандарты качества в каждом производимом изделии.",
  "Innovation": "Инновации",
  "We continuously innovate to provide cutting-edge solutions for our customers.": "Мы постоянно внедряем инновации, чтобы предоставлять нашим клиентам передовые решения.",
  "Customer Focus": "Ориентация на клиента",
  "Our customers' success is our success. We prioritize their needs above all.": "Успех наших клиентов — это наш успех. Мы ставим их потребности превыше всего.",
  "Teamwork": "Командная работа",
  "We believe in the power of collaboration and mutual respect among our team.": "Мы верим в силу сотрудничества и взаимного уважения в нашей команде.",
  "Our Journey": "Наш путь",
  "Company Founded": "Год основания компании",
  "Rucheng Technology was established with a vision to revolutionize sheet metal fabrication.": "Компания Rucheng Technology была основана с целью революционизировать обработку листового металла.",
  "Technology Innovation": "Технологические инновации",
  "Launched our first CNC bending machine with advanced automation features.": "Запущен первый ЧПУ листогибочный станок с расширенными функциями автоматизации.",
  "Global Expansion": "Глобальная экспансия",
  "Expanded our presence to over 50 countries worldwide.": "Мы расширили свое присутствие более чем в 50 странах мира.",
  "Our Expert Team": "Наша команда экспертов",
  "Our team consists of experienced engineers, skilled technicians, and dedicated professionals who are passionate\n        about delivering the best solutions to our customers.": "Наша команда состоит из опытных инженеров, квалифицированных техников и преданных своему делу профессионалов, которые увлечены предоставлением лучших решений нашим клиентам.",
  "Engineering Team": "Инженерная команда",
  "R&D & Innovation": "НИОКР и инновации",
  "Production Team": "Производственная команда",
  "Manufacturing Excellence": "Производственное совершенство",
  "After-sales Team": "Команда послепродажного обслуживания",
  "After-sales Service": "Послепродажное обслуживание",
  "Certifications & Awards": "Сертификаты и награды",
  "ISO 9001:2015": "ISO 9001:2015",
  "Quality Management System Certification": "Сертификация системы менеджмента качества",
  "CE Certification": "Сертификация CE",
  "European Conformity Mark": "Европейский знак соответствия",
  "Best Manufacturer": "Лучший производитель",
  "Industry Excellence Award 2023": "Премия за отраслевое совершенство 2023"
}