{
  "About Rucheng Technology": "À propos de Rucheng Technology",
  "Your Trusted Partner in Sheet Metal Fabrication": "Votre partenaire de confiance en fabrication de tôlerie",
  "Company Overview": "Présentation de l'entreprise",
  "Nanjing Rucheng Technology Co., Ltd. is a modern management enterprise that produces all kinds of ordinary\n            and CNC bending machines, plate shears, laser cutting machines and supporting knives and molds. We have a\n            number of knowledgeable and young teams dedicated to the development of sheet metal processing machine\n            tools.": "Nanjing Rucheng Technology Co., Ltd. est une entreprise de gestion moderne qui produit toutes sortes de plieuses ordinaires et CNC, cisailles à tôle, machines de découpe laser et couteaux et moules de support. Nous disposons de plusieurs équipes jeunes et compétentes dédiées au développement de machines-outils de traitement de tôlerie.",
  "Founded with a vision to revolutionize the sheet metal fabrication industry, Rucheng Technology has grown\n            from a small workshop to a leading manufacturer of precision machinery. Our commitment to innovation,\n            quality, and customer satisfaction has made us a trusted partner for businesses worldwide.": "Fondée avec la vision de révolutionner l'industrie de la fabrication de tôlerie, Rucheng Technology est passée d'un petit atelier à un fabricant leader de machines de précision. Notre engagement envers l'innovation, la qualité et la satisfaction client a fait de nous un partenaire de confiance pour les entreprises du monde entier.",
  "Our Mission": "Notre mission",
  "To provide innovative, high-quality sheet metal fabrication solutions that empower our customers to achieve\n            excellence in their manufacturing processes while maintaining the highest standards of reliability and\n            efficiency.": "Fournir des solutions innovantes et de haute qualité pour la fabrication de tôlerie qui permettent à nos clients d'atteindre l'excellence dans leurs processus de fabrication tout en maintenant les plus hauts standards de fiabilité et d'efficacité.",
  "Our Vision": "Notre vision",
  "To be the global leader in sheet metal fabrication technology, recognized for our innovation, quality, and\n            commitment to customer success, while contributing to the advancement of manufacturing excellence worldwide.": "Être le leader mondial de la technologie de fabrication de tôlerie, reconnu pour notre innovation, notre qualité et notre engagement envers le succès des clients, tout en contribuant à l'avancement de l'excellence manufacturière dans le monde entier.",
  "Our Core Values": "Nos valeurs fondamentales",
  "Quality Excellence": "Excellence de la qualité",
  "We maintain the highest standards of quality in every product we manufacture.": "Nous maintenons les normes de qualité les plus élevées dans chaque produit que nous fabriquons.",
  "Innovation": "Innovation",
  "We continuously innovate to provide cutting-edge solutions for our customers.": "Nous innovons continuellement pour fournir des solutions de pointe à nos clients.",
  "Customer Focus": "Orientation client",
  "Our customers' success is our success. We prioritize their needs above all.": "Le succès de nos clients est notre succès. Nous donnons la priorité à leurs besoins avant tout.",
  "Teamwork": "Travail d'équipe",
  "We believe in the power of collaboration and mutual respect among our team.": "Nous croyons au pouvoir de la collaboration et du respect mutuel au sein de notre équipe.",
  "Our Journey": "Notre parcours",
  "Company Founded": "Création de l'entreprise",
  "Rucheng Technology was established with a vision to revolutionize sheet metal fabrication.": "Rucheng Technology a été créée avec la vision de révolutionner la fabrication de tôlerie.",
  "Technology Innovation": "Innovation technologique",
  "Launched our first CNC bending machine with advanced automation features.": "Lancement de notre première presse plieuse CNC avec des fonctionnalités d'automatisation avancées.",
  "Global Expansion": "Expansion mondiale",
  "Expanded our presence to over 50 countries worldwide.": "Nous avons étendu notre présence dans plus de 50 pays dans le monde.",
  "Our Expert Team": "Notre équipe d'experts",
  "Our team consists of experienced engineers, skilled technicians, and dedicated professionals who are passionate\n        about delivering the best solutions to our customers.": "Notre équipe est composée d'ingénieurs expérimentés, de techniciens qualifiés et de professionnels dévoués qui sont passionnés par la fourniture des meilleures solutions à nos clients.",
  "Engineering Team": "Équipe d'ingénierie",
  "R&D & Innovation": "R&D et innovation",
  "Production Team": "Équipe de production",
  "Manufacturing Excellence": "Excellence de fabrication",
  "After-sales Team": "Équipe après-vente",
  "After-sales Service": "Service après-vente",
  "Certifications & Awards": "Certifications et récompenses",
  "ISO 9001:2015": "ISO 9001:2015",
  "Quality Management System Certification": "Certification du système de gestion de la qualité",
  "CE Certification": "Certification CE",
  "European Conformity Mark": "Marquage de conformité européenne",
  "Best Manufacturer": "Meilleur fabricant",
  "Industry Excellence Award 2023": "Prix d'excellence de l'industrie 2023"
}