{
  "About Rucheng Technology": "关于如程科技",
  "Your Trusted Partner in Sheet Metal Fabrication": "您值得信赖的钣金加工合作伙伴",
  "Company Overview": "公司概况",
  "Nanjing Rucheng Technology Co., Ltd. is a modern management enterprise that produces all kinds of ordinary\n            and CNC bending machines, plate shears, laser cutting machines and supporting knives and molds. We have a\n            number of knowledgeable and young teams dedicated to the development of sheet metal processing machine\n            tools.": "南京如程科技有限公司是一家现代化管理企业，生产各类普通及数控折弯机、板材剪切机、激光切割机及配套刀具和模具。我们拥有多支知识丰富的年轻团队，致力于钣金加工机床的研发。",
  "Founded with a vision to revolutionize the sheet metal fabrication industry, Rucheng Technology has grown\n            from a small workshop to a leading manufacturer of precision machinery. Our commitment to innovation,\n            quality, and customer satisfaction has made us a trusted partner for businesses worldwide.": "如程科技创立之初就立志革新钣金加工行业，从一个小作坊发展成为精密机械的领先制造商。我们对创新、质量和客户满意度的承诺，使我们成为全球企业值得信赖的合作伙伴。",
  "Our Mission": "我们的使命",
  "To provide innovative, high-quality sheet metal fabrication solutions that empower our customers to achieve\n            excellence in their manufacturing processes while maintaining the highest standards of reliability and\n            efficiency.": "提供创新、高质量的钣金加工解决方案，帮助客户在制造过程中实现卓越，同时保持最高的可靠性和效率标准。",
  "Our Vision": "我们的愿景",
  "To be the global leader in sheet metal fabrication technology, recognized for our innovation, quality, and\n            commitment to customer success, while contributing to the advancement of manufacturing excellence worldwide.": "成为全球钣金加工技术的领导者，以创新、质量和对客户成功的承诺而闻名，同时为全球制造卓越的进步做出贡献。",
  "Our Core Values": "我们的核心价值观",
  "Quality Excellence": "卓越品质",
  "We maintain the highest standards of quality in every product we manufacture.": "我们在每一件制造的产品中都保持最高的质量标准。",
  "Innovation": "创新",
  "We continuously innovate to provide cutting-edge solutions for our customers.": "我们不断创新，为客户提供尖端解决方案。",
  "Customer Focus": "以客户为中心",
  "Our customers' success is our success. We prioritize their needs above all.": "客户的成功就是我们的成功。我们将客户需求放在首位。",
  "Teamwork": "团队合作",
  "We believe in the power of collaboration and mutual respect among our team.": "我们相信团队之间协作和相互尊重的力量。",
  "Our Journey": "我们的历程",
  "Company Founded": "公司成立",
  "Rucheng Technology was established with a vision to revolutionize sheet metal fabrication.": "如程科技的成立愿景是革新钣金加工行业。",
  "Technology Innovation": "技术创新",
  "Launched our first CNC bending machine with advanced automation features.": "推出首台具有先进自动化功能的数控折弯机。",
  "Global Expansion": "全球扩张",
  "Expanded our presence to over 50 countries worldwide.": "我们的业务已扩展到全球50多个国家。",
  "Our Expert Team": "我们的专家团队",
  "Our team consists of experienced engineers, skilled technicians, and dedicated professionals who are passionate\n        about delivering the best solutions to our customers.": "我们的团队由经验丰富的工程师、技术精湛的技术人员和敬业的专业人士组成，他们热衷于为客户提供最佳解决方案。",
  "Engineering Team": "工程团队",
  "R&D & Innovation": "研发与创新",
  "Production Team": "生产团队",
  "Manufacturing Excellence": "制造卓越",
  "After-sales Team": "售后团队",
  "After-sales Service": "售后服务",
  "Certifications & Awards": "认证与奖项",
  "ISO 9001:2015": "ISO 9001:2015",
  "Quality Management System Certification": "质量管理体系认证",
  "CE Certification": "CE认证",
  "European Conformity Mark": "欧洲合格标志",
  "Best Manufacturer": "最佳制造商",
  "Industry Excellence Award 2023": "2023年行业卓越奖"
}