{
  "About Rucheng Technology": "Über Rucheng Technology",
  "Your Trusted Partner in Sheet Metal Fabrication": "Ihr vertrauenswürdiger Partner in der Blechbearbeitung",
  "Company Overview": "Unternehmensübersicht",
  "Nanjing Rucheng Technology Co., Ltd. is a modern management enterprise that produces all kinds of ordinary\n            and CNC bending machines, plate shears, laser cutting machines and supporting knives and molds. We have a\n            number of knowledgeable and young teams dedicated to the development of sheet metal processing machine\n            tools.": "Nanjing Rucheng Technology Co., Ltd. ist ein modernes Managementunternehmen, das alle Arten von gewöhnlichen und CNC-Biegemaschinen, Blechscheren, Laserschneidmaschinen sowie unterstützende Messer und Formen herstellt. Wir verfügen über mehrere sachkundige und junge Teams, die sich der Entwicklung von Blechbearbeitungsmaschinen widmen.",
  "Founded with a vision to revolutionize the sheet metal fabrication industry, Rucheng Technology has grown\n            from a small workshop to a leading manufacturer of precision machinery. Our commitment to innovation,\n            quality, and customer satisfaction has made us a trusted partner for businesses worldwide.": "Mit der Vision gegründet, die Blechbearbeitungsindustrie zu revolutionieren, hat sich Rucheng Technology von einer kleinen Werkstatt zu einem führenden Hersteller von Präzisionsmaschinen entwickelt. Unser Engagement für Innovation, Qualität und Kundenzufriedenheit hat uns zu einem vertrauenswürdigen Partner für Unternehmen weltweit gemacht.",
  "Our Mission": "Unsere Mission",
  "To provide innovative, high-quality sheet metal fabrication solutions that empower our customers to achieve\n            excellence in their manufacturing processes while maintaining the highest standards of reliability and\n            efficiency.": "Innovative, qualitativ hochwertige Lösungen für die Blechbearbeitung bereitzustellen, die es unseren Kunden ermöglichen, Exzellenz in ihren Fertigungsprozessen zu erreichen, während die höchsten Standards an Zuverlässigkeit und Effizienz aufrechterhalten werden.",
  "Our Vision": "Unsere Vision",
  "To be the global leader in sheet metal fabrication technology, recognized for our innovation, quality, and\n            commitment to customer success, while contributing to the advancement of manufacturing excellence worldwide.": "Der weltweit führende Anbieter in der Blechbearbeitungstechnologie zu sein, anerkannt für unsere Innovation, Qualität und unser Engagement für den Kundenerfolg, während wir zum Fortschritt der Fertigungsexzellenz weltweit beitragen.",
  "Our Core Values": "Unsere Grundwerte",
  "Quality Excellence": "Qualitätsexzellenz",
  "We maintain the highest standards of quality in every product we manufacture.": "Wir halten die höchsten Qualitätsstandards in jedem Produkt ein, das wir herstellen.",
  "Innovation": "Innovation",
  "We continuously innovate to provide cutting-edge solutions for our customers.": "Wir innovieren kontinuierlich, um unseren Kunden Spitzenlösungen zu bieten.",
  "Customer Focus": "Kundenorientierung",
  "Our customers' success is our success. We prioritize their needs above all.": "Der Erfolg unserer Kunden ist unser Erfolg. Wir priorisieren ihre Bedürfnisse vor allem anderen.",
  "Teamwork": "Teamarbeit",
  "We believe in the power of collaboration and mutual respect among our team.": "Wir glauben an die Kraft der Zusammenarbeit und des gegenseitigen Respekts in unserem Team.",
  "Our Journey": "Unsere Reise",
  "Company Founded": "Unternehmensgründung",
  "Rucheng Technology was established with a vision to revolutionize sheet metal fabrication.": "Rucheng Technology wurde mit der Vision gegründet, die Blechbearbeitung zu revolutionieren.",
  "Technology Innovation": "Technologie-Innovation",
  "Launched our first CNC bending machine with advanced automation features.": "Einführung unserer ersten CNC-Biegemaschine mit fortschrittlichen Automatisierungsfunktionen.",
  "Global Expansion": "Globale Expansion",
  "Expanded our presence to over 50 countries worldwide.": "Wir haben unsere Präsenz auf über 50 Länder weltweit ausgeweitet.",
  "Our Expert Team": "Unser Expertenteam",
  "Our team consists of experienced engineers, skilled technicians, and dedicated professionals who are passionate\n        about delivering the best solutions to our customers.": "Unser Team besteht aus erfahrenen Ingenieuren, qualifizierten Technikern und engagierten Fachleuten, die leidenschaftlich daran interessiert sind, unseren Kunden die besten Lösungen zu liefern.",
  "Engineering Team": "Engineering-Team",
  "R&D & Innovation": "F&E & Innovation",
  "Production Team": "Produktionsteam",
  "Manufacturing Excellence": "Fertigungsexzellenz",
  "After-sales Team": "Kundendienstteam",
  "After-sales Service": "Kundendienst",
  "Certifications & Awards": "Zertifizierungen & Auszeichnungen",
  "ISO 9001:2015": "ISO 9001:2015",
  "Quality Management System Certification": "Qualitätsmanagementsystem-Zertifizierung",
  "CE Certification": "CE-Zertifizierung",
  "European Conformity Mark": "Europäisches Konformitätszeichen",
  "Best Manufacturer": "Bester Hersteller",
  "Industry Excellence Award 2023": "Branchenexzellenz-Award 2023"
}