{
  "About Rucheng Technology": "Sobre Rucheng Technology",
  "Your Trusted Partner in Sheet Metal Fabrication": "Su Socio de Confianza en Fabricación de Chapa Metálica",
  "Company Overview": "Descripción de la Empresa",
  "Nanjing Rucheng Technology Co., Ltd. is a modern management enterprise that produces all kinds of ordinary\n            and CNC bending machines, plate shears, laser cutting machines and supporting knives and molds. We have a\n            number of knowledgeable and young teams dedicated to the development of sheet metal processing machine\n            tools.": "Nanjing Rucheng Technology Co., Ltd. es una empresa de gestión moderna que produce todo tipo de plegadoras ordinarias y CNC, cizallas de chapa, máquinas de corte láser y cuchillas y moldes de soporte. Contamos con varios equipos jóvenes y conocedores dedicados al desarrollo de máquinas-herramienta para el procesamiento de chapa metálica.",
  "Founded with a vision to revolutionize the sheet metal fabrication industry, Rucheng Technology has grown\n            from a small workshop to a leading manufacturer of precision machinery. Our commitment to innovation,\n            quality, and customer satisfaction has made us a trusted partner for businesses worldwide.": "Fundada con la visión de revolucionar la industria de fabricación de chapa metálica, Rucheng Technology ha crecido de un pequeño taller a un fabricante líder de maquinaria de precisión. Nuestro compromiso con la innovación, la calidad y la satisfacción del cliente nos ha convertido en un socio de confianza para empresas de todo el mundo.",
  "Our Mission": "Nuestra Misión",
  "To provide innovative, high-quality sheet metal fabrication solutions that empower our customers to achieve\n            excellence in their manufacturing processes while maintaining the highest standards of reliability and\n            efficiency.": "Proporcionar soluciones innovadoras y de alta calidad para la fabricación de chapa metálica que permitan a nuestros clientes lograr la excelencia en sus procesos de fabricación mientras mantienen los más altos estándares de confiabilidad y eficiencia.",
  "Our Vision": "Nuestra Visión",
  "To be the global leader in sheet metal fabrication technology, recognized for our innovation, quality, and\n            commitment to customer success, while contributing to the advancement of manufacturing excellence worldwide.": "Ser el líder mundial en tecnología de fabricación de chapa metálica, reconocidos por nuestra innovación, calidad y compromiso con el éxito del cliente, mientras contribuimos al avance de la excelencia en la fabricación a nivel mundial.",
  "Our Core Values": "Nuestros Valores Fundamentales",
  "Quality Excellence": "Excelencia en Calidad",
  "We maintain the highest standards of quality in every product we manufacture.": "Mantenemos los más altos estándares de calidad en cada producto que fabricamos.",
  "Innovation": "Innovación",
  "We continuously innovate to provide cutting-edge solutions for our customers.": "Innovamos continuamente para proporcionar soluciones de vanguardia para nuestros clientes.",
  "Customer Focus": "Enfoque en el Cliente",
  "Our customers' success is our success. We prioritize their needs above all.": "El éxito de nuestros clientes es nuestro éxito. Priorizamos sus necesidades por encima de todo.",
  "Teamwork": "Trabajo en Equipo",
  "We believe in the power of collaboration and mutual respect among our team.": "Creemos en el poder de la colaboración y el respeto mutuo entre nuestro equipo.",
  "Our Journey": "Nuestro Recorrido",
  "Company Founded": "Empresa Fundada",
  "Rucheng Technology was established with a vision to revolutionize sheet metal fabrication.": "Rucheng Technology fue establecida con la visión de revolucionar la fabricación de chapa metálica.",
  "Technology Innovation": "Innovación Tecnológica",
  "Launched our first CNC bending machine with advanced automation features.": "Lanzamos nuestra primera plegadora CNC con características de automatización avanzadas.",
  "Global Expansion": "Expansión Global",
  "Expanded our presence to over 50 countries worldwide.": "Expandimos nuestra presencia a más de 50 países en todo el mundo.",
  "Our Expert Team": "Nuestro Equipo de Expertos",
  "Our team consists of experienced engineers, skilled technicians, and dedicated professionals who are passionate\n        about delivering the best solutions to our customers.": "Nuestro equipo está formado por ingenieros experimentados, técnicos capacitados y profesionales dedicados que se apasionan por ofrecer las mejores soluciones a nuestros clientes.",
  "Engineering Team": "Equipo de Ingeniería",
  "R&D & Innovation": "I+D e Innovación",
  "Production Team": "Equipo de Producción",
  "Manufacturing Excellence": "Excelencia en Manufactura",
  "After-sales Team": "Equipo de Postventa",
  "After-sales Service": "Servicio Postventa",
  "Certifications & Awards": "Certificaciones y Premios",
  "ISO 9001:2015": "ISO 9001:2015",
  "Quality Management System Certification": "Certificación del Sistema de Gestión de Calidad",
  "CE Certification": "Certificación CE",
  "European Conformity Mark": "Marca de Conformidad Europea",
  "Best Manufacturer": "Mejor Fabricante",
  "Industry Excellence Award 2023": "Premio a la Excelencia de la Industria 2023"
}