{
  "_comment": "قاموس الترجمة العربية - Arabic Translation Dictionary",

  "Home": "الرئيسية",
  "About Us": "عن الشركة",
  "Product": "المنتجات",
  "Services": "الخدمات",
  "Blog": "المدونة",
  "Contact Us": "اتصل بنا",

  "Featured Products": "المنتجات المميزة",
  "All Products": "جميع المنتجات",
  "View Our Products": "عرض منتجاتنا",

  "Press Brake": "ماكينة الثني",
  "Shearing Machine": "ماكينة القص",
  "Shearing Machines": "ماكينات القص",
  "Fiber Laser Cutting Machine": "ماكينة القطع بالليزر الليفي",
  "Laser Cutting Machines": "ماكينات القطع بالليزر",
  "Plate Rolling Machine": "ماكينة لف الصفائح",
  "Plate Rolling Machines": "ماكينات لف الصفائح",
  "Punching machine": "ماكينة التثقيب",
  "Punching Machine": "ماكينة التثقيب",
  "Four-Column Hydraulic Press Machine": "المكبس الهيدروليكي ذو الأعمدة الأربعة",
  "Four-Column Hydraulic Press": "المكبس الهيدروليكي ذو الأعمدة الأربعة",
  "Hydraulic Presses": "المكابس الهيدروليكية",
  "Mechanical Blade": "الشفرة الميكانيكية",
  "Bending Machine Mold": "قالب ماكينة الثني",
  "Blades & Knives": "الشفرات والسكاكين",
  "Molds & Dies": "القوالب والقوالب المعدنية",

  "Electro-hydraulic CNC Press Brake": "ماكينة الثني الكهروهيدروليكية بالتحكم الرقمي",
  "Heavy-duty Press Brake": "ماكينة الثني للخدمة الشاقة",
  "Torsion-synchro NC Press Brake": "ماكينة الثني بالتحكم الرقمي بنظام التزامن الالتوائي",
  "Robotic Press Brake": "ماكينة الثني الآلية",
  "Tandem Press Brake": "ماكينة الثني المزدوجة",
  "Guillotine Shear": "مقص الجليوتين",
  "Swing Beam Shearing Machine": "ماكينة القص بالذراع المتأرجحة",
  "Single Table Fiber Laser Cutting Machine": "ماكينة القطع بالليزر الليفي بطاولة واحدة",
  "Double Table Fiber Laser Cutting Machine": "ماكينة القطع بالليزر الليفي بطاولتين",
  "Series Fully Enclosed Laser Cutting Machine": "ماكينة القطع بالليزر المغلقة بالكامل",
  "Exchange Table Plate Tube Integrated Laser": "ماكينة الليزر المتكاملة للصفائح والأنابيب بطاولة قابلة للتبديل",
  "Full-Protection Interactive Table Panel Tube Integrated Laser": "ماكينة الليزر المتكاملة للصفائح والأنابيب بطاولة تفاعلية بحماية كاملة",
  "Single Panel Tube Integrated Laser Cutting": "ماكينة القطع بالليزر المتكاملة للصفائح والأنابيب بطاولة واحدة",
  "Tube Laser Cutting Machine": "ماكينة القطع بالليزر للأنابيب",
  "W11 Three-roller Plate Rolling Machine": "ماكينة لف الصفائح W11 ثلاثية الأسطوانات",
  "W11S Universal Veneer Reeling Machine": "ماكينة اللف العامة W11S",

  "Shearing Machine Blade": "شفرة ماكينة القص",
  "CNC Bending Machine Mold": "قالب ماكينة الثني بالتحكم الرقمي",
  "Press Brake Flattening Die": "قالب التسطيح لماكينة الثني",
  "Slitting Round Blade": "شفرة دائرية للتقطيع الطولي",
  "Rolling Shear Slitting Blade": "شفرة التقطيع الدوارة",
  "Toothed Blade": "الشفرة المسننة",
  "Rolling Knife": "السكين الدوارة",
  "Chipper Blades": "شفرات التقطيع",
  "Crusher Blade": "شفرة الكسارة",
  "Slow Crusher Blade": "شفرة الكسارة البطيئة",
  "Corrugated Paper Cutter": "قاطع الورق المموج",
  "Ink Knife": "سكين الحبر",

  "Welcome to Rucheng —": "مرحباً بكم في روتشنغ —",
  "Your Trusted Partner in Sheet Metal Fabrication": "شريكك الموثوق في تصنيع الصفائح المعدنية",
  "About our company": "عن شركتنا",
  "Company Overview": "نظرة عامة على الشركة",
  "About Rucheng Technology": "عن تقنية روتشنغ",
  "Rucheng Technology was established with a vision to revolutionize sheet metal fabrication.": "تأسست تقنية روتشنغ برؤية لإحداث ثورة في تصنيع الصفائح المعدنية.",

  "Knowledgeable and young team.": "فريق شاب ومتمكن.",
  "Advanced production equipment.": "معدات إنتاج متطورة.",
  "Strong product design ability.": "قدرة قوية على تصميم المنتجات.",
  "Advanced management mode.": "نمط إدارة متقدم.",
  "Wide range of product applications.": "مجموعة واسعة من تطبيقات المنتجات.",
  "Tailor-made personalized products.": "منتجات مخصصة حسب الطلب.",
  "Guarantee excellent product quality.": "ضمان جودة منتج ممتازة.",
  "Good after-sales service.": "خدمة ما بعد البيع الجيدة.",
  "More About": "المزيد عن",
  "Learn More": "تعرف على المزيد",

  "Why choose us": "لماذا تختارنا",
  "Quality Guarantee": "ضمان الجودة",
  "Every product is backed by a 1-year guarantee for any quality issues.": "كل منتج مدعوم بضمان لمدة عام واحد لأية مشاكل في الجودة.",
  "Competitive Price": "سعر تنافسي",
  "Due to our batch manufacturing, we will have a lower price with best quality machines.": "بفضل التصنيع بالدفعات، نقدم أسعاراً أقل مع ماكينات بأفضل جودة.",
  "Technical Support": "الدعم الفني",
  "When a breakdown occurs, our technicals are on call for both online & onsite correction.": "عند حدوث عطل، فإن فريقنا الفني متاح للدعم عبر الإنترنت والدعم الميداني.",
  "Expert Solutions": "حلول الخبراء",
  "We will provide you professional expert suggestions for your required machine.": "سنقدم لك اقتراحات الخبراء المحترفين للماكينة التي تحتاجها.",
  "All Solutions": "جميع الحلول",
  "Get A Solution For All Industries": "احصل على حل لجميع الصناعات",

  "Projects Completed": "المشاريع المنجزة",
  "Work Employed": "العمال الموظفون",
  "Work facilities": "مرافق العمل",
  "Company Founded": "تأسيس الشركة",
  "Global Expansion": "التوسع العالمي",
  "Expanded our presence to over 50 countries worldwide.": "قمنا بتوسيع تواجدنا لأكثر من 50 دولة حول العالم.",
  "Launched our first CNC bending machine with advanced automation features.": "أطلقنا أول ماكينة ثني بالتحكم الرقمي مع ميزات أتمتة متقدمة.",

  "Explore Recent Work": "استكشف الأعمال الحديثة",
  "Buying customers from all over the world": "عملاء من جميع أنحاء العالم",
  "Export to Kuwait": "التصدير إلى الكويت",
  "Export to UAE": "التصدير إلى الإمارات",
  "Export to Vietnam": "التصدير إلى فيتنام",
  "Export to India": "التصدير إلى الهند",

  "What our client say": "ماذا يقول عملاؤنا",
  "Happy With Customers & Clients": "سعداء مع العملاء والزبائن",
  "I am very happy and proud to be working with this company. I think it's a very efficient and professional company. Good luck and success to your company!": "أنا سعيد جداً وفخور بالعمل مع هذه الشركة. أعتقد أنها شركة فعالة ومهنية للغاية. حظاً موفقاً ونجاحاً لشركتكم!",
  "John Doe": "جون دو",
  "CEO": "الرئيس التنفيذي",
  "\"Such a useful machine! Oh no, it's not just a machine, it's the result of our choice to cooperate with you and the testimony of our continued cooperation!\"": "\"ماكينة مفيدة جداً! لا، إنها ليست مجرد ماكينة، إنها نتيجة اختيارنا للتعاون معكم وشهادة على استمرار تعاوننا!\"",

  "— Latest Articles Updated Daily —": "— أحدث المقالات يتم تحديثها يومياً —",
  "We Are Here To Learn You More From Blog": "نحن هنا لنعلمك المزيد من المدونة",
  "Our Blog": "مدونتنا",
  "Latest News & Insights": "آخر الأخبار والرؤى",
  "Stay updated with the latest industry trends, technical insights, and company news from Rucheng Technology.": "ابق على اطلاع بأحدث اتجاهات الصناعة، والرؤى الفنية، وأخبار الشركة من تقنية روتشنغ.",
  "Discover valuable insights about industrial machinery, maintenance tips, and industry best practices.": "اكتشف رؤى قيمة حول الآلات الصناعية، ونصائح الصيانة، وأفضل الممارسات في الصناعة.",

  "How about Rucheng Technology?": "ما رأيك في تقنية روتشنغ؟",
  "Details determine quality": "التفاصيل تحدد الجودة",
  "READ MORE >>": "اقرأ المزيد >>",
  "READ MORE »": "اقرأ المزيد »",
  "Next »": "التالي »",
  "February 11, 2022": "11 فبراير 2022",
  "• No comments": "• لا توجد تعليقات",
  "How to maintain the laser cutting machine?": "كيفية صيانة ماكينة القطع بالليزر؟",
  "Maintenance of laser cutting machine": "صيانة ماكينة القطع بالليزر",
  "February 23, 2022": "23 فبراير 2022",
  "Laser cutting machine has high efficiency and low cost, saving labor costs": "ماكينة القطع بالليزر ذات كفاءة عالية وتكلفة منخفضة، مما يوفر تكاليف العمالة",
  "March 14, 2022": "14 مارس 2022",
  "CNC bending machine compensation mode to choose mechanical compensation or hydraulic compensation?": "وضع تعويض ماكينة الثني بالتحكم الرقمي: اختيار التعويض الميكانيكي أم الهيدروليكي؟",
  "A comprehensive guide to choosing the right compensation system for your CNC bending operations.": "دليل شامل لاختيار نظام التعويض المناسب لعمليات الثني بالتحكم الرقمي.",
  "How does the bending machine work?": "كيف تعمل ماكينة الثني؟",
  "Introduction of bending machine": "مقدمة عن ماكينة الثني",
  "February 24, 2022": "24 فبراير 2022",
  "Maintenance and maintenance of shears": "صيانة وإصلاح ماكينات القص",
  "Essential maintenance tips and best practices for keeping your shearing equipment in optimal condition.": "نصائح الصيانة الأساسية وأفضل الممارسات للحفاظ على معدات القص في حالة مثالية.",
  "Discover how modern laser cutting technology can significantly reduce your operational costs while improving efficiency.": "اكتشف كيف يمكن لتقنية القطع بالليزر الحديثة تقليل تكاليف التشغيل بشكل كبير مع تحسين الكفاءة.",
  "CATEGORIES": "الفئات",
  "Categories": "الفئات",

  "Professional Industrial Solutions": "حلول صناعية احترافية",
  "We provide comprehensive manufacturing equipment and technical services to help your business achieve excellence in production efficiency and quality control.": "نقدم معدات تصنيع شاملة وخدمات فنية لمساعدة عملك على تحقيق التميز في كفاءة الإنتاج ومراقبة الجودة.",
  "Explore Our Services": "استكشف خدماتنا",
  "Our Core Services": "خدماتنا الأساسية",
  "Comprehensive solutions for modern manufacturing needs": "حلول شاملة لاحتياجات التصنيع الحديثة",

  "Equipment Manufacturing": "تصنيع المعدات",
  "High-quality industrial machinery including press brakes, laser cutters, and specialized manufacturing equipment.": "آلات صناعية عالية الجودة بما في ذلك ماكينات الثني، وقواطع الليزر، ومعدات التصنيع المتخصصة.",
  "Custom design and engineering": "التصميم والهندسة المخصصة",
  "Precision manufacturing": "التصنيع الدقيق",
  "Quality assurance testing": "اختبار ضمان الجودة",
  "Technical documentation": "الوثائق الفنية",

  "Comprehensive technical support and maintenance services to ensure optimal equipment performance.": "دعم فني شامل وخدمات صيانة لضمان الأداء الأمثل للمعدات.",
  "24/7 technical assistance": "مساعدة فنية على مدار الساعة",
  "Preventive maintenance": "الصيانة الوقائية",
  "Repair and replacement": "الإصلاح والاستبدال",
  "Training and certification": "التدريب والاعتماد",

  "Consulting Services": "خدمات الاستشارات",
  "Expert consulting to optimize your manufacturing processes and improve operational efficiency.": "استشارات الخبراء لتحسين عمليات التصنيع وتحسين الكفاءة التشغيلية.",
  "Process optimization": "تحسين العمليات",
  "Equipment selection": "اختيار المعدات",
  "Workflow analysis": "تحليل سير العمل",
  "Performance improvement": "تحسين الأداء",

  "Custom Solutions": "الحلول المخصصة",
  "Tailored solutions designed to meet your specific manufacturing requirements and challenges.": "حلول مصممة خصيصاً لتلبية متطلبات وتحديات التصنيع الخاصة بك.",
  "Custom equipment design": "تصميم المعدات المخصصة",
  "Integration services": "خدمات التكامل",
  "Specialized modifications": "التعديلات المتخصصة",
  "Turnkey solutions": "حلول جاهزة للتشغيل",

  "Training Programs": "برامج التدريب",
  "Comprehensive training programs to ensure your team can operate equipment safely and efficiently.": "برامج تدريبية شاملة لضمان قدرة فريقك على تشغيل المعدات بأمان وكفاءة.",
  "Operator training": "تدريب المشغلين",
  "Safety protocols": "بروتوكولات السلامة",
  "Maintenance procedures": "إجراءات الصيانة",
  "Certification programs": "برامج الاعتماد",

  "Global Support": "الدعم العالمي",
  "Worldwide support network ensuring you receive assistance wherever your operations are located.": "شبكة دعم عالمية تضمن حصولك على المساعدة أينما كانت عملياتك.",
  "International service": "الخدمة الدولية",
  "Local partnerships": "الشراكات المحلية",
  "Remote diagnostics": "التشخيص عن بُعد",
  "Spare parts supply": "توريد قطع الغيار",

  "Our Service Process": "عملية خدمتنا",
  "A systematic approach to delivering excellence": "نهج منهجي لتقديم التميز",
  "Consultation": "الاستشارة",
  "We begin with a thorough consultation to understand your specific needs, challenges, and objectives.": "نبدأ باستشارة شاملة لفهم احتياجاتك وتحدياتك وأهدافك المحددة.",
  "Analysis": "التحليل",
  "Our experts analyze your current processes and identify opportunities for improvement and optimization.": "يقوم خبراؤنا بتحليل عملياتك الحالية وتحديد فرص التحسين والتحسين.",
  "Solution Design": "تصميم الحل",
  "We design customized solutions that address your specific requirements and deliver measurable results.": "نقوم بتصميم حلول مخصصة تلبي متطلباتك المحددة وتحقق نتائج قابلة للقياس.",
  "Implementation": "التنفيذ",
  "Our team ensures smooth implementation with minimal disruption to your operations.": "يضمن فريقنا تنفيذاً سلساً مع الحد الأدنى من التعطيل لعملياتك.",
  "Support": "الدعم",
  "Ongoing support and maintenance to ensure optimal performance and long-term success.": "الدعم والصيانة المستمرة لضمان الأداء الأمثل والنجاح على المدى الطويل.",

  "Technology & Innovation": "التكنولوجيا والابتكار",
  "Cutting-edge technology driving manufacturing excellence": "تقنية متطورة تدفع التميز في التصنيع",
  "Advanced Automation": "الأتمتة المتقدمة",
  "State-of-the-art automation systems that improve efficiency, reduce errors, and increase productivity.": "أنظمة أتمتة متطورة تحسن الكفاءة وتقلل الأخطاء وتزيد الإنتاجية.",
  "Precision Engineering": "الهندسة الدقيقة",
  "High-precision manufacturing processes ensuring consistent quality and reliable performance.": "عمليات تصنيع عالية الدقة تضمن جودة متسقة وأداء موثوق.",
  "Smart Monitoring": "المراقبة الذكية",
  "Intelligent monitoring systems providing real-time data and predictive maintenance capabilities.": "أنظمة مراقبة ذكية توفر بيانات في الوقت الفعلي وقدرات الصيانة التنبؤية.",
  "Energy Efficiency": "كفاءة الطاقة",
  "Energy-efficient solutions that reduce operational costs while maintaining high performance standards.": "حلول موفرة للطاقة تقلل تكاليف التشغيل مع الحفاظ على معايير الأداء العالية.",
  "Quality Control": "مراقبة الجودة",
  "Comprehensive quality control systems ensuring every product meets the highest standards.": "أنظمة مراقبة جودة شاملة تضمن أن كل منتج يلبي أعلى المعايير.",
  "Digital Integration": "التكامل الرقمي",
  "Seamless integration with existing systems and Industry 4.0 technologies for enhanced connectivity.": "تكامل سلس مع الأنظمة الحالية وتقنيات الصناعة 4.0 لتعزيز الاتصال.",

  "Ready to Transform Your Manufacturing?": "هل أنت مستعد لتحويل التصنيع الخاص بك؟",
  "Let's discuss how our services can help you achieve your production goals and improve your operational efficiency.": "لنناقش كيف يمكن لخدماتنا مساعدتك في تحقيق أهداف الإنتاج الخاصة بك وتحسين كفاءتك التشغيلية.",
  "Get Started Today": "ابدأ اليوم",

  "WE'D LOVE TO HEAR FROM YOU": "نحن نحب أن نسمع منك",
  "Contact Us": "اتصل بنا",
  "Send us a Message": "أرسل لنا رسالة",
  "OUR CONTACT DETAILS": "تفاصيل الاتصال بنا",
  "Shiqiu Industrial Zone, Lishui District,": "منطقة شيتشيو الصناعية، منطقة ليشوي،",
  "Shiqiu Industrial Zone, Lishui District, Nanjing City, Jiangsu Province": "منطقة شيتشيو الصناعية، منطقة ليشوي، مدينة نانجينغ، مقاطعة جيانغسو",
  "Ru Cheng": "رو تشنغ",
  "Rucheng": "روتشنغ",
  "Submit": "إرسال",

  "Our Core Values": "قيمنا الأساسية",
  "Quality Excellence": "التميز في الجودة",
  "We maintain the highest standards of quality in every product we manufacture.": "نحافظ على أعلى معايير الجودة في كل منتج نصنعه.",
  "Customer Focus": "التركيز على العملاء",
  "Our customers' success is our success. We prioritize their needs above all.": "نجاح عملائنا هو نجاحنا. نعطي الأولوية لاحتياجاتهم قبل كل شيء.",
  "Innovation": "الابتكار",
  "We continuously innovate to provide cutting-edge solutions for our customers.": "نبتكر باستمرار لتقديم حلول متطورة لعملائنا.",
  "Teamwork": "العمل الجماعي",
  "We believe in the power of collaboration and mutual respect among our team.": "نؤمن بقوة التعاون والاحترام المتبادل بين فريقنا.",

  "Our Journey": "رحلتنا",
  "Our Mission": "مهمتنا",
  "Our Vision": "رؤيتنا",
  "Our Expert Team": "فريق الخبراء لدينا",
  "Our team consists of experienced engineers, skilled technicians, and dedicated professionals who are passionate about delivering the best solutions to our customers.": "يتألف فريقنا من مهندسين ذوي خبرة، وفنيين ماهرين، ومحترفين مخصصين متحمسين لتقديم أفضل الحلول لعملائنا.",
  "Engineering Team": "فريق الهندسة",
  "Production Team": "فريق الإنتاج",
  "After-sales Team": "فريق ما بعد البيع",
  "R&D & Innovation": "البحث والتطوير والابتكار",

  "Certifications & Awards": "الشهادات والجوائز",
  "ISO 9001:2015": "ISO 9001:2015",
  "Quality Management System Certification": "شهادة نظام إدارة الجودة",
  "CE Certification": "شهادة CE",
  "European Conformity Mark": "علامة المطابقة الأوروبية",
  "Industry Excellence Award 2023": "جائزة التميز الصناعي 2023",
  "Best Manufacturer": "أفضل شركة مصنعة",
  "Technology Innovation": "الابتكار التكنولوجي",
  "Manufacturing Excellence": "التميز في التصنيع",
  "After-sales Service": "خدمة ما بعد البيع",

  "Advanced CNC press brake with electro-hydraulic system for precise bending operations.": "ماكينة ثني متقدمة بالتحكم الرقمي مع نظام كهروهيدروليكي لعمليات الثني الدقيقة.",
  "Robust press brake designed for heavy-duty industrial applications.": "ماكينة ثني قوية مصممة للتطبيقات الصناعية الشاقة.",
  "Synchronized torsion bar system for consistent and accurate bending results.": "نظام قضيب التواء متزامن للحصول على نتائج ثني دقيقة ومتسقة.",
  "Automated press brake with robotic integration for enhanced productivity.": "ماكينة ثني آلية مع تكامل روبوتي لتعزيز الإنتاجية.",
  "High-capacity tandem press brake for large-scale production requirements.": "ماكينة ثني مزدوجة عالية السعة لمتطلبات الإنتاج الكبيرة.",

  "High-precision guillotine shear with advanced control system for clean cutting operations.": "مقص جليوتين عالي الدقة مع نظام تحكم متقدم لعمليات القطع النظيفة.",
  "Hydraulic swing beam shearing machine with NC control system for precision sheet metal cutting.": "ماكينة قص بالذراع المتأرجحة الهيدروليكية مع نظام تحكم رقمي لقطع الصفائح المعدنية الدقيق.",
  "Hydraulic punching machine for precision hole punching in metal sheets and plates.": "ماكينة تثقيب هيدروليكية للثقب الدقيق في الصفائح والألواح المعدنية.",

  "Modern fiber laser cutting machine with single table design for efficient processing.": "ماكينة قطع بالليزر الليفي حديثة بتصميم طاولة واحدة للمعالجة الفعالة.",
  "Advanced double table fiber laser cutting system for continuous production.": "نظام قطع بالليزر الليفي بطاولتين متقدم للإنتاج المستمر.",
  "Fully enclosed laser cutting machine with enhanced safety and precision.": "ماكينة قطع بالليزر مغلقة بالكامل مع سلامة ودقة محسّنة.",
  "Advanced exchange table system for continuous plate and tube processing.": "نظام طاولة قابلة للتبديل متقدم للمعالجة المستمرة للصفائح والأنابيب.",
  "Full-protection interactive table system for advanced laser cutting applications.": "نظام طاولة تفاعلية بحماية كاملة لتطبيقات القطع بالليزر المتقدمة.",
  "Integrated laser cutting system for both flat panels and tubes.": "نظام قطع بالليزر متكامل للصفائح المسطحة والأنابيب.",
  "Specialized laser cutting machine designed for tube and pipe processing.": "ماكينة قطع بالليزر متخصصة مصممة لمعالجة الأنابيب.",

  "Three-roller plate rolling machine for precise metal plate forming.": "ماكينة لف الصفائح ثلاثية الأسطوانات لتشكيل الصفائح المعدنية الدقيق.",
  "Universal veneer reeling machine for various material processing applications.": "ماكينة لف عامة لتطبيقات معالجة المواد المختلفة.",
  "Heavy-duty four-column hydraulic press for industrial pressing applications.": "مكبس هيدروليكي ثقيل ذو أربعة أعمدة لتطبيقات الكبس الصناعية.",

  "Professional shearing machine blades for clean cutting operations.": "شفرات ماكينة قص احترافية لعمليات القطع النظيفة.",
  "Precision mold components for CNC bending machine applications.": "مكونات قالب دقيقة لتطبيقات ماكينة الثني بالتحكم الرقمي.",
  "Professional flattening dies for press brake operations.": "قوالب تسطيح احترافية لعمليات ماكينة الثني.",
  "High-quality round blades for precision slitting operations.": "شفرات دائرية عالية الجودة لعمليات التقطيع الطولي الدقيقة.",
  "Precision slitting blades for rolling shear applications.": "شفرات تقطيع دقيقة لتطبيقات القص الدوار.",
  "Precision toothed blades for specialized cutting applications.": "شفرات مسننة دقيقة لتطبيقات القطع المتخصصة.",
  "Serrated rolling knives for specialized cutting applications.": "سكاكين دوارة مسننة لتطبيقات القطع المتخصصة.",
  "Professional chipper blades with comb-like design for material processing.": "شفرات تقطيع احترافية بتصميم مشطي لمعالجة المواد.",
  "Heavy-duty crusher blades for material processing applications.": "شفرات كسارة شاقة لتطبيقات معالجة المواد.",
  "Heavy-duty crusher blades with multiple oval slots for material crushing.": "شفرات كسارة شاقة مع فتحات بيضاوية متعددة لسحق المواد.",
  "Specialized cutting rings for corrugated paper processing.": "حلقات قطع متخصصة لمعالجة الورق المموج.",
  "Specialized ink knife for printing and coating applications.": "سكين حبر متخصص لتطبيقات الطباعة والطلاء.",

  "Electro-hydraulic system": "نظام كهروهيدروليكي",
  "CNC precision control": "التحكم الدقيق بالتحكم الرقمي",
  "Advanced safety features": "ميزات السلامة المتقدمة",
  "Heavy-duty construction": "بناء للخدمة الشاقة",
  "Industrial-grade reliability": "موثوقية صناعية",
  "High tonnage capacity": "سعة حمولة عالية",
  "Torsion-synchro system": "نظام التزامن الالتوائي",
  "CNC precision": "دقة التحكم الرقمي",
  "Synchronized operation": "تشغيل متزامن",
  "Robotic arm automation": "أتمتة الذراع الروبوتية",
  "Advanced control system": "نظام تحكم متقدم",
  "Enhanced safety features": "ميزات سلامة محسّنة",
  "Dual machine configuration": "تكوين الماكينة المزدوجة",
  "High production capacity": "قدرة إنتاجية عالية",
  "Continuous operation": "تشغيل مستمر",

  "Hydraulic drive system": "نظام دفع هيدروليكي",
  "NC back gauge system": "نظام المقياس الخلفي بالتحكم الرقمي",
  "Precision cutting": "قطع دقيق",
  "Swing beam cutting action": "حركة القطع بالذراع المتأرجحة",
  "NC control technology": "تقنية التحكم الرقمي",
  "Professional shearing": "قص احترافي",
  "Hydraulic operation": "تشغيل هيدروليكي",
  "Manual foot pedal operation": "تشغيل يدوي بدواسة القدم",
  "High punching force": "قوة تثقيب عالية",

  "Fiber laser technology": "تقنية الليزر الليفي",
  "Single table design": "تصميم طاولة واحدة",
  "High cutting speed": "سرعة قطع عالية",
  "Double table system": "نظام طاولتين",
  "Automated material handling": "معالجة المواد الآلية",
  "High efficiency operation": "تشغيل عالي الكفاءة",
  "Fully enclosed design": "تصميم مغلق بالكامل",
  "Safety protection system": "نظام الحماية والسلامة",
  "High precision laser": "ليزر عالي الدقة",
  "Exchange table system": "نظام الطاولة القابلة للتبديل",
  "Panel and tube cutting": "قطع الصفائح والأنابيب",
  "Automated feeding system": "نظام التغذية الآلي",
  "Interactive table design": "تصميم الطاولة التفاعلية",
  "Panel and tube integration": "تكامل الصفائح والأنابيب",
  "Full protection system": "نظام الحماية الكاملة",
  "Integrated system design": "تصميم النظام المتكامل",
  "Plate and tube processing": "معالجة الصفائح والأنابيب",
  "Integrated control panel": "لوحة التحكم المتكاملة",
  "Tube and pipe cutting": "قطع الأنابيب",
  "Track-mounted system": "نظام مثبت على مسار",
  "Versatile tube sizes": "أحجام أنابيب متعددة",

  "Three-roller system": "نظام ثلاثي الأسطوانات",
  "Precise plate forming": "تشكيل صفائح دقيق",
  "Adjustable roller positions": "مواضع أسطوانات قابلة للتعديل",
  "Veneer processing": "معالجة القشرة",
  "Extended working length": "طول عمل ممتد",
  "Versatile applications": "تطبيقات متعددة الاستخدامات",

  "Four-column design": "تصميم رباعي الأعمدة",
  "High productivity": "إنتاجية عالية",
  "Robust construction": "بناء متين",

  "Sharp cutting edges": "حواف قطع حادة",
  "High wear resistance": "مقاومة عالية للتآكل",
  "Professional quality": "جودة احترافية",
  "Precision ground": "مصقول بدقة",
  "Multiple sizes available": "أحجام متعددة متوفرة",
  "Durable construction": "بناء متين",
  "Mold components": "مكونات القالب",
  "High precision cutting": "قطع عالي الدقة",
  "Multiple die options": "خيارات قوالب متعددة",
  "Press brake application": "تطبيق ماكينة الثني",
  "Bending applications": "تطبيقات الثني",
  "Flattening operation": "عملية التسطيح",
  "Round blade design": "تصميم الشفرة الدائرية",
  "Precision cutting capability": "قدرة القطع الدقيقة",
  "Industrial applications": "التطبيقات الصناعية",
  "Clean cutting edges": "حواف قطع نظيفة",
  "High cutting accuracy": "دقة قطع عالية",
  "Multiple sizes": "أحجام متعددة",
  "Serrated edges": "حواف مسننة",
  "Specialized cutting": "قطع متخصص",
  "High production efficiency": "كفاءة إنتاج عالية",
  "Serrated edge design": "تصميم الحافة المسننة",
  "Material processing": "معالجة المواد",
  "Robust design": "تصميم متين",
  "Comb-like design": "تصميم مشطي",
  "Professional finish": "تشطيب احترافي",
  "Industrial-grade construction": "بناء صناعي",
  "Heavy-duty design": "تصميم للخدمة الشاقة",
  "Material crushing": "سحق المواد",
  "Multiple oval slots": "فتحات بيضاوية متعددة",
  "Multiple hole patterns": "أنماط ثقوب متعددة",
  "Circular design": "تصميم دائري",
  "Paper processing": "معالجة الورق",
  "Corrugated Paper Cutter": "قاطع الورق المموج",
  "Specialized design": "تصميم متخصص",
  "Printing applications": "تطبيقات الطباعة",
  "Coating machinery": "معدات الطلاء",

  "Notched edges": "حواف مشقوقة",
  "Universal design": "تصميم عالمي",
  "Central bore mounting": "تثبيت بفتحة مركزية",
  "Central keyway mounting": "تثبيت بمجرى مفتاح مركزي",
  "Interlocking design": "تصميم متشابك",
  "Interlocking mechanism": "آلية التشابك",
  "Stepped profile design": "تصميم بملف تعريف متدرج",
  "Polished finish": "تشطيب مصقول",
  "Polished surface": "سطح مصقول",
  "Multiple mounting holes": "ثقوب تثبيت متعددة",
  "Compact unit": "وحدة مدمجة",
  "Digital control panel": "لوحة التحكم الرقمية",
  "Precision measurement scale": "مقياس قياس دقيق",
  "CE safety certified": "معتمد من سلامة CE",
  "FORTOM brand technology": "تقنية علامة FORTOM التجارية",

  "Nanjing Rucheng Technology Co., Ltd. is a modern management enterprise that produces all kinds of ordinary and CNC bending machines, plate shears, laser cutting machines and supporting knives and molds. We have a number of knowledgeable and young teams dedicated to the development of sheet metal processing machine tools.": "شركة نانجينغ روتشنغ للتكنولوجيا المحدودة هي مؤسسة إدارة حديثة تنتج جميع أنواع ماكينات الثني العادية وبالتحكم الرقمي، وماكينات القص، وماكينات القطع بالليزر، والسكاكين والقوالب الداعمة. لدينا العديد من الفرق الشابة والمتمكنة المكرسة لتطوير أدوات الماكينات لتصنيع الصفائح المعدنية.",
  "To provide innovative, high-quality sheet metal fabrication solutions that empower our customers to achieve excellence in their manufacturing processes while maintaining the highest standards of reliability and efficiency.": "تقديم حلول تصنيع الصفائح المعدنية المبتكرة وعالية الجودة التي تمكّن عملاءنا من تحقيق التميز في عمليات التصنيع الخاصة بهم مع الحفاظ على أعلى معايير الموثوقية والكفاءة.",
  "Our team consists of experienced engineers, skilled technicians, and dedicated professionals who are passionate about delivering the best solutions to our customers.": "يتألف فريقنا من مهندسين ذوي خبرة، وفنيين ماهرين، ومحترفين مخصصين متحمسين لتقديم أفضل الحلول لعملائنا.",
  "Founded with a vision to revolutionize the sheet metal fabrication industry, Rucheng Technology has grown from a small workshop to a leading manufacturer of precision machinery. Our commitment to innovation, quality, and customer satisfaction has made us a trusted partner for businesses worldwide.": "تأسست شركة روتشنغ للتكنولوجيا برؤية لإحداث ثورة في صناعة تصنيع الصفائح المعدنية، ونمت من ورشة صغيرة إلى شركة مصنعة رائدة للآلات الدقيقة. لقد جعلنا التزامنا بالابتكار والجودة ورضا العملاء شريكاً موثوقاً للشركات في جميع أنحاء العالم.",
  "To be the global leader in sheet metal fabrication technology, recognized for our innovation, quality, and commitment to customer success, while contributing to the advancement of manufacturing excellence worldwide.": "أن نكون الرائد العالمي في تكنولوجيا تصنيع الصفائح المعدنية، معترف بنا لابتكارنا وجودتنا والتزامنا بنجاح العملاء، مع المساهمة في تقدم التميز التصنيعي في جميع أنحاء العالم.",
  "Your name*": "اسمك*",
  "Email Address*": "عنوان البريد الإلكتروني*",
  "Give us your need as specific as possible*": "أخبرنا باحتياجاتك بأكبر قدر ممكن من التحديد*",
  "Precision hole making": "صنع الثقوب الدقيقة",
  "Our company adheres to the business philosophy of \"sincere life, conscientious work, quality first, reputation first, excellent service\". If you have any questions, please feel free to get in touch with us in the following ways!": "تلتزم شركتنا بفلسفة العمل \"حياة صادقة، عمل ضميري، الجودة أولاً، السمعة أولاً، خدمة ممتازة\". إذا كان لديك أي أسئلة، فلا تتردد في الاتصال بنا بالطرق التالية!"
}
