{
  "Latest News & Insights": "Dernières nouvelles et analyses",
  "Stay updated with the latest industry trends, technical insights, and company news from Rucheng Technology.": "Restez informé des dernières tendances de l'industrie, des analyses techniques et des nouvelles de l'entreprise Rucheng Technology.",
  "Our Blog": "Notre blog",
  "Discover valuable insights about industrial machinery, maintenance tips, and industry best practices.": "Découvrez des informations précieuses sur les machines industrielles, des conseils d'entretien et les meilleures pratiques de l'industrie.",
  "How about Rucheng Technology?": "Que dire de Rucheng Technology ?",
  "Details determine quality": "Les détails déterminent la qualité",
  "February 11, 2022": "11 février 2022",
  "READ MORE »": "LIRE LA SUITE »",
  "How to maintain the laser cutting machine?": "Comment entretenir la machine de découpe laser ?",
  "Maintenance of laser cutting machine": "Entretien de la machine de découpe laser",
  "February 23, 2022": "23 février 2022",
  "Laser cutting machine has high efficiency and low cost, saving labor costs": "La machine de découpe laser offre une efficacité élevée et un faible coût, réduisant les coûts de main-d'œuvre",
  "Discover how modern laser cutting technology can significantly reduce your operational costs while improving efficiency.": "Découvrez comment la technologie moderne de découpe laser peut réduire considérablement vos coûts opérationnels tout en améliorant l'efficacité.",
  "March 14, 2022": "14 mars 2022",
  "CNC bending machine compensation mode to choose mechanical compensation or hydraulic compensation?": "Mode de compensation de la presse plieuse CNC : choisir la compensation mécanique ou hydraulique ?",
  "A comprehensive guide to choosing the right compensation system for your CNC bending operations.": "Un guide complet pour choisir le bon système de compensation pour vos opérations de pliage CNC.",
  "How does the bending machine work?": "Comment fonctionne la presse plieuse ?",
  "Introduction of bending machine": "Introduction à la presse plieuse",
  "February 24, 2022": "24 février 2022",
  "Maintenance and maintenance of shears": "Entretien et maintenance des cisailles",
  "Essential maintenance tips and best practices for keeping your shearing equipment in optimal condition.": "Conseils d'entretien essentiels et meilleures pratiques pour maintenir votre équipement de cisaillage en condition optimale.",
  "Next »": "Suivant »"
}