{
  "Latest News & Insights": "آخر الأخبار والرؤى",
  "Stay updated with the latest industry trends, technical insights, and company news from Rucheng Technology.": "ابق على اطلاع بأحدث اتجاهات الصناعة، والرؤى الفنية، وأخبار الشركة من تقنية روتشنغ.",
  "Our Blog": "مدونتنا",
  "Discover valuable insights about industrial machinery, maintenance tips, and industry best practices.": "اكتشف رؤى قيمة حول الآلات الصناعية، ونصائح الصيانة، وأفضل الممارسات في الصناعة.",
  "How about Rucheng Technology?": "ما رأيك في تقنية روتشنغ؟",
  "Details determine quality": "التفاصيل تحدد الجودة",
  "February 11, 2022": "11 فبراير 2022",
  "READ MORE »": "اقرأ المزيد »",
  "How to maintain the laser cutting machine?": "كيفية صيانة ماكينة القطع بالليزر؟",
  "Maintenance of laser cutting machine": "صيانة ماكينة القطع بالليزر",
  "February 23, 2022": "23 فبراير 2022",
  "Laser cutting machine has high efficiency and low cost, saving labor costs": "ماكينة القطع بالليزر ذات كفاءة عالية وتكلفة منخفضة، مما يوفر تكاليف العمالة",
  "Discover how modern laser cutting technology can significantly reduce your operational costs while improving efficiency.": "اكتشف كيف يمكن لتقنية القطع بالليزر الحديثة تقليل تكاليف التشغيل بشكل كبير مع تحسين الكفاءة.",
  "March 14, 2022": "14 مارس 2022",
  "CNC bending machine compensation mode to choose mechanical compensation or hydraulic compensation?": "وضع تعويض ماكينة الثني بالتحكم الرقمي: اختيار التعويض الميكانيكي أم الهيدروليكي؟",
  "A comprehensive guide to choosing the right compensation system for your CNC bending operations.": "دليل شامل لاختيار نظام التعويض المناسب لعمليات الثني بالتحكم الرقمي.",
  "How does the bending machine work?": "كيف تعمل ماكينة الثني؟",
  "Introduction of bending machine": "مقدمة عن ماكينة الثني",
  "February 24, 2022": "24 فبراير 2022",
  "Maintenance and maintenance of shears": "صيانة وإصلاح ماكينات القص",
  "Essential maintenance tips and best practices for keeping your shearing equipment in optimal condition.": "نصائح الصيانة الأساسية وأفضل الممارسات للحفاظ على معدات القص في حالة مثالية.",
  "Next »": "التالي »"
}