{
  "Latest News & Insights": "Последние новости и аналитика",
  "Stay updated with the latest industry trends, technical insights, and company news from Rucheng Technology.": "Будьте в курсе последних отраслевых тенденций, технических новинок и новостей компании Rucheng Technology.",
  "Our Blog": "Наш блог",
  "Discover valuable insights about industrial machinery, maintenance tips, and industry best practices.": "Узнайте ценную информацию о промышленном оборудовании, советы по обслуживанию и лучшие отраслевые практики.",
  "How about Rucheng Technology?": "Что представляет собой Rucheng Technology?",
  "Details determine quality": "Детали определяют качество",
  "February 11, 2022": "11 февраля 2022 г.",
  "READ MORE »": "ЧИТАТЬ ДАЛЕЕ »",
  "How to maintain the laser cutting machine?": "Как обслуживать лазерный станок?",
  "Maintenance of laser cutting machine": "Техническое обслуживание лазерного станка",
  "February 23, 2022": "23 февраля 2022 г.",
  "Laser cutting machine has high efficiency and low cost, saving labor costs": "Лазерный станок обладает высокой эффективностью и низкой стоимостью, экономя расходы на рабочую силу",
  "Discover how modern laser cutting technology can significantly reduce your operational costs while improving efficiency.": "Узнайте, как современные технологии лазерной резки могут значительно снизить эксплуатационные расходы при повышении эффективности.",
  "March 14, 2022": "14 марта 2022 г.",
  "CNC bending machine compensation mode to choose mechanical compensation or hydraulic compensation?": "Режим компенсации ЧПУ листогиба: выбрать механическую или гидравлическую компенсацию?",
  "A comprehensive guide to choosing the right compensation system for your CNC bending operations.": "Полное руководство по выбору правильной системы компенсации для операций на ЧПУ листогибе.",
  "How does the bending machine work?": "Как работает листогибочный станок?",
  "Introduction of bending machine": "Введение в листогибочные станки",
  "February 24, 2022": "24 февраля 2022 г.",
  "Maintenance and maintenance of shears": "Техническое обслуживание и эксплуатация гильотин",
  "Essential maintenance tips and best practices for keeping your shearing equipment in optimal condition.": "Основные советы по техническому обслуживанию и лучшие практики для поддержания гильотин в оптимальном состоянии.",
  "Next »": "Далее »"
}