{
  "Latest News & Insights": "Neueste Nachrichten & Einblicke",
  "Stay updated with the latest industry trends, technical insights, and company news from Rucheng Technology.": "Bleiben Sie auf dem Laufenden über die neuesten Branchentrends, technischen Einblicke und Unternehmensnachrichten von Rucheng Technology.",
  "Our Blog": "Unser Blog",
  "Discover valuable insights about industrial machinery, maintenance tips, and industry best practices.": "Entdecken Sie wertvolle Einblicke in Industriemaschinen, Wartungstipps und Best Practices der Branche.",
  "How about Rucheng Technology?": "Wie wäre es mit Rucheng Technology?",
  "Details determine quality": "Details bestimmen Qualität",
  "February 11, 2022": "11. Februar 2022",
  "READ MORE »": "MEHR LESEN »",
  "How to maintain the laser cutting machine?": "Wie wartet man die Laserschneidemaschine?",
  "Maintenance of laser cutting machine": "Wartung der Laserschneidemaschine",
  "February 23, 2022": "23. Februar 2022",
  "Laser cutting machine has high efficiency and low cost, saving labor costs": "Laserschneidemaschine hat hohe Effizienz und niedrige Kosten, spart Arbeitskosten",
  "Discover how modern laser cutting technology can significantly reduce your operational costs while improving efficiency.": "Entdecken Sie, wie moderne Laserschneidtechnologie Ihre Betriebskosten erheblich senken und gleichzeitig die Effizienz verbessern kann.",
  "March 14, 2022": "14. März 2022",
  "CNC bending machine compensation mode to choose mechanical compensation or hydraulic compensation?": "CNC-Biegemaschinen-Kompensationsmodus: mechanische oder hydraulische Kompensation wählen?",
  "A comprehensive guide to choosing the right compensation system for your CNC bending operations.": "Ein umfassender Leitfaden zur Auswahl des richtigen Kompensationssystems für Ihre CNC-Biegevorgänge.",
  "How does the bending machine work?": "Wie funktioniert die Biegemaschine?",
  "Introduction of bending machine": "Einführung in die Biegemaschine",
  "February 24, 2022": "24. Februar 2022",
  "Maintenance and maintenance of shears": "Wartung und Pflege von Scheren",
  "Essential maintenance tips and best practices for keeping your shearing equipment in optimal condition.": "Wesentliche Wartungstipps und Best Practices, um Ihre Scherausrüstung in optimalem Zustand zu halten.",
  "Next »": "Weiter »"
}