{
  "Latest News & Insights": "Últimas Noticias y Perspectivas",
  "Stay updated with the latest industry trends, technical insights, and company news from Rucheng Technology.": "Manténgase actualizado con las últimas tendencias de la industria, perspectivas técnicas y noticias de la empresa de Rucheng Technology.",
  "Our Blog": "Nuestro Blog",
  "Discover valuable insights about industrial machinery, maintenance tips, and industry best practices.": "Descubra información valiosa sobre maquinaria industrial, consejos de mantenimiento y mejores prácticas de la industria.",
  "How about Rucheng Technology?": "¿Qué tal Rucheng Technology?",
  "Details determine quality": "Los detalles determinan la calidad",
  "February 11, 2022": "11 de febrero de 2022",
  "READ MORE »": "LEER MÁS »",
  "How to maintain the laser cutting machine?": "¿Cómo mantener la máquina de corte por láser?",
  "Maintenance of laser cutting machine": "Mantenimiento de máquina de corte por láser",
  "February 23, 2022": "23 de febrero de 2022",
  "Laser cutting machine has high efficiency and low cost, saving labor costs": "La máquina de corte por láser tiene alta eficiencia y bajo costo, ahorrando costos laborales",
  "Discover how modern laser cutting technology can significantly reduce your operational costs while improving efficiency.": "Descubra cómo la tecnología moderna de corte por láser puede reducir significativamente sus costos operativos mientras mejora la eficiencia.",
  "March 14, 2022": "14 de marzo de 2022",
  "CNC bending machine compensation mode to choose mechanical compensation or hydraulic compensation?": "¿Modo de compensación de plegadora CNC: elegir compensación mecánica o compensación hidráulica?",
  "A comprehensive guide to choosing the right compensation system for your CNC bending operations.": "Una guía completa para elegir el sistema de compensación adecuado para sus operaciones de plegado CNC.",
  "How does the bending machine work?": "¿Cómo funciona la plegadora?",
  "Introduction of bending machine": "Introducción a la plegadora",
  "February 24, 2022": "24 de febrero de 2022",
  "Maintenance and maintenance of shears": "Mantenimiento y cuidado de cizallas",
  "Essential maintenance tips and best practices for keeping your shearing equipment in optimal condition.": "Consejos de mantenimiento esenciales y mejores prácticas para mantener su equipo de cizallado en condiciones óptimas.",
  "Next »": "Siguiente »"
}