{
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar\n            sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel\n            formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both\n            deep relief clearance and offset capability for the most challenging box and channel forming operations.": "« Cimeterre » ou « sabre » fait référence à une conception de profil incurvé et décalé similaire à la lame incurvée d'une épée cimeterre. ",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the\n            leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and\n            efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They\n            produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision\n            work and thick plate rolling.": "Les machines à 3 rouleaux sont plus économiques et adaptées aux applications générales, mais nécessitent de pré-courber le bord d'attaque séparément et peuvent laisser des bords droits plus longs. ",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing\n            flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to\n            form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing\n            the punch from hitting previously formed flanges, making them essential for box forming, door frames,\n            and channel bending applications.": "Un poinçon à col de cygne présente une conception en relief profond (profil décalé) qui offre un dégagement pour les brides existantes et les géométries de boîtes profondes. ",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day.\n            Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to\n            switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production\n            orders without significant downtime.": "Absolument! ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications.\n            Provide part drawings showing flange dimensions, bend angles, material specifications, and production\n            volume. Our engineering team will design custom gooseneck tooling optimized for your specific application,\n            including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom\n            tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "Absolument. ",
  "Are spare parts readily available?": "Les pièces de rechange sont-elles facilement disponibles ?",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "La durée de vie de la lame dépend du matériau à couper, de la vitesse de coupe et des pratiques d'entretien. ",
  "Blade life depends on material being cut, thickness, frequency of use, and maintenance. With four usable edges, our blades can last 4 times longer than single-edge blades. Typical service life ranges from tens of thousands to hundreds of thousands of cuts. Proper blade gap adjustment and regular rotation extend blade life significantly.": "La durée de vie de la lame dépend du matériau à couper, de son épaisseur, de la fréquence d'utilisation et de l'entretien. ",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "La durée de vie de la lame dépend du type de matériau, de la vitesse du concasseur et du matériau de la lame. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "La durée de vie de la lame varie considérablement en fonction du matériau traité, de la vitesse de production et de la conception des dents. ",
  "Blade life varies significantly based on wood type, material diameter, presence of dirt/rocks, and maintenance practices. In clean wood applications, chromium steel blades typically last 150-300 hours of continuous operation. Carbide-inlay blades can last 800-1200 hours when avoiding metal contaminants. Proper blade maintenance, rotation, and avoiding dirt-contaminated wood maximize blade life.": "La durée de vie de la lame varie considérablement en fonction du type de bois, du diamètre du matériau, de la présence de terre/rochers et des pratiques d'entretien. ",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "Le choix de la lame dépend des spécifications de votre machine, du type de matériau et des exigences de coupe. ",
  "Blades with minor wear can sometimes be professionally re-ground to restore cutting performance. However, deep nicks, cracks, or severe wear typically require replacement. Re-grinding reduces blade dimensions and may affect machine blade gap settings. We offer professional blade inspection services to determine if re-grinding is cost-effective for your situation.": "Les lames présentant une usure mineure peuvent parfois être affûtées professionnellement pour restaurer les performances de coupe. ",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through\n            multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling\n            uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump\n            forming is cost-effective for occasional large radius work, while dedicated radius tooling provides\n            superior surface finish and faster production for regular radius bending applications.": "Le formage de bosses utilise des matrices en V et des poinçons standard avec une programmation CNC pour créer des arcs à grand rayon à travers plusieurs petits coudes incrémentiels (rapprochant l'arc avec des segments linéaires). ",
  "Can I process both plates and tubes in the same production run?": "Puis-je traiter à la fois des plaques et des tubes dans le même cycle de production ?",
  "Can chipper blades be sharpened and reused?": "Les lames de déchiqueteuse peuvent-elles être affûtées et réutilisées ?",
  "Can crusher blades be sharpened and reused?": "Les lames de broyeur peuvent-elles être affûtées et réutilisées ?",
  "Can damaged blades be repaired or re-sharpened?": "Les lames endommagées peuvent-elles être réparées ou réaffûtées ?",
  "Can gooseneck punches be used for hemming operations?": "Les poinçons col de cygne peuvent-ils être utilisés pour les opérations d'ourlet ?",
  "Can the machine cut bevels for pipe welding?": "La machine peut-elle couper des biseaux pour le soudage de tuyaux ?",
  "Can the machine roll conical shapes?": "La machine peut-elle rouler des formes coniques ?",
  "Can the machines operate independently?": "Les machines peuvent-elles fonctionner de manière indépendante ?",
  "Can the system handle different sheet sizes and materials?": "Le système peut-il gérer différentes tailles de feuilles et différents matériaux ?",
  "Can these blades be re-sharpened?": "Ces lames peuvent-elles être réaffûtées ?",
  "Can these machines run 24/7?": "Ces machines peuvent-elles fonctionner 24h/24 et 7j/7 ?",
  "Can toothed blades be re-sharpened?": "Les lames dentées peuvent-elles être réaffûtées ?",
  "Can you manufacture custom profile dies?": "Pouvez-vous fabriquer des matrices de profil personnalisées ?",
  "Can you manufacture custom radius profiles?": "Pouvez-vous fabriquer des profils de rayon personnalisés ?",
  "Check your chipper's operator manual for blade specifications including length, width, thickness, and bolt hole pattern. Measure existing blades if manual is unavailable. Provide chipper brand and model number - we maintain specifications for most major brands (Vermeer, Bandit, Morbark, etc.). Send us photos or measurements of existing blades for confirmation. We can cross-reference and provide exact replacement blades.": "Consultez le manuel d'utilisation de votre déchiqueteuse pour connaître les spécifications de la lame, notamment la longueur, la largeur, l'épaisseur et la configuration des trous de boulons. ",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength,\n            wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium\n            HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production\n            volume, material being bent, and required tool life.": "L'acier au chrome-molybdène (42CrMo, Cr12MoV) est la norme de l'industrie, offrant une résistance, une résistance à l'usure et une protection contre la corrosion exceptionnelles. ",
  "Common questions about our": "Questions courantes sur notre",
  "Contact our support team": "Contactez notre équipe d'assistance",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick,\n            stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage,\n            working length, and material properties.": "En fonction du tonnage et du type de matériau, les presses plieuses robustes peuvent plier l'acier doux jusqu'à 50 mm d'épaisseur, l'acier inoxydable jusqu'à 30 mm et l'aluminium jusqu'à 40 mm. ",
  "Do I need special skills to operate a robotic system?": "Ai-je besoin de compétences particulières pour faire fonctionner un système robotique ?",
  "Do you manufacture custom gooseneck profiles?": "Fabriquez-vous des profils de col de cygne sur mesure ?",
  "Do you offer sample testing before production orders?": "Proposez-vous des tests d'échantillons avant les commandes de production ?",
  "Do you offer technical support and installation guidance?": "Offrez-vous une assistance technique et des conseils d’installation ?",
  "Do you provide installation and maintenance guidance?": "Fournissez-vous des conseils d’installation et de maintenance ?",
  "Do you provide installation and setup guidance?": "Fournissez-vous des conseils d’installation et de configuration ?",
  "Do you provide installation and setup support?": "Fournissez-vous une assistance à l'installation et à la configuration ?",
  "Do you provide installation and training?": "Fournissez-vous l’installation et la formation ?",
  "Double table machines typically achieve 40-50% higher productivity than single table machines. The automatic\n            table exchange takes only rapid, and while one table is cutting, the operator can load/unload the other\n            table simultaneously. This eliminates material loading downtime and enables continuous 24/7 operation, making\n            it ideal for high-volume production environments.": "Les machines à double table atteignent généralement une productivité 40 à 50 % supérieure à celle des machines à table unique. ",
  "Download PDF": "Télécharger le PDF",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between\n            cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also\n            consume less energy and provide faster response times.": "Les presses plieuses électrohydrauliques utilisent un système de contrôle électronique pour une synchronisation précise entre les cylindres, offrant une meilleure précision et répétabilité par rapport aux systèmes hydrauliques traditionnels. ",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized\n            clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical\n            or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American\n            systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "L'outillage européen (systèmes Wila, Amada, Trumpf) utilise des outils segmentés à changement rapide avec des systèmes de serrage standardisés pour une installation rapide. ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning\n            protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction\n            filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser\n            gas refills or mirror alignments are needed.": "Les lasers à fibre ne nécessitent presque aucun entretien par rapport aux lasers CO2. ",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "Les lames plates fonctionnent mieux pour les produits à paroi mince (moins de 3 mm) comme les bouteilles et les films, offrant un rendement plus élevé. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "Pour des devis personnalisés précis, fournissez : le diamètre extérieur de la lame, le diamètre intérieur (taille de l'alésage), l'épaisseur du moyeu, le pas de dent souhaité, le type de profil de dent si connu, le matériau en cours de traitement, l'épaisseur du matériau, la vitesse de production et toute exigence particulière. ",
  "For general mild steel cutting, Cr12MoV or 6CrW2Si provides excellent performance and value. For stainless steel and harder materials, consider high-speed steel (HSS) or tungsten carbide. For high-volume production, premium materials offer better long-term cost-effectiveness despite higher initial cost. Our technical team can recommend optimal materials based on your specific application.": "Pour la coupe générale de l'acier doux, le Cr12MoV ou le 6CrW2Si offrent d'excellentes performances et une excellente valeur. ",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "Pour un usage occasionnel ou des plastiques souples, l’acier à haute teneur en carbone offre un bon rapport qualité-prix. ",
  "For occasional use with clean wood, carbon steel offers good value. For professional/commercial operations, chromium steel (8%+ Cr) provides the best balance of performance and cost. For high-volume production or abrasive applications, consider premium tool steels. Carbide-inlay blades are recommended for maximum productivity in continuous operations despite higher initial cost. Our team can recommend optimal materials based on your specific usage patterns.": "Pour une utilisation occasionnelle avec du bois propre, l’acier au carbone offre un bon rapport qualité-prix. ",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece,\n            eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing,\n            metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also\n            provides superior stability and precision for high-tonnage applications.": "Les presses hydrauliques à quatre colonnes sont dotées de quatre poteaux de guidage qui assurent une répartition uniforme de la force sur l'ensemble de la pièce, éliminant ainsi la déflexion et l'inclinaison courantes dans les presses à colonne unique ou à châssis en C. ",
  "Frequently Asked Questions": "Foire aux questions",
  "Get detailed technical specifications, dimensions, and performance data": "Obtenez des spécifications techniques détaillées, des dimensions et des données de performances",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and\n            the ability to cut thicker materials. They produce minimal material waste and are ideal for\n            applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller\n            footprint, and are better suited for thinner materials.": "Les cisailles guillotine utilisent un mouvement de lame vertical qui descend vers le bas, offrant une plus grande précision et la possibilité de couper des matériaux plus épais. ",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days\n            depending on tonnage, configuration, and optional features. Rush delivery may be available for certain\n            configurations.": "Les presses plieuses robustes sont généralement conçues sur mesure selon les spécifications. ",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and\n            operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick\n            concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "Les presses plieuses robustes nécessitent des fondations en béton armé en raison de leur poids et de leurs forces opérationnelles importantes. ",
  "How accurate is the bending process?": "Quelle est la précision du processus de pliage ?",
  "How accurate is the synchronization between the two machines?": "Quelle est la précision de la synchronisation entre les deux machines ?",
  "How do I find the right blade size for my chipper?": "Comment trouver la bonne taille de lame pour ma déchiqueteuse ?",
  "How do I know when blades need replacement?": "Comment savoir quand les lames doivent être remplacées ?",
  "How do I know when blades need to be replaced or sharpened?": "Comment savoir quand les lames doivent être remplacées ou affûtées ?",
  "How do I know when to rotate or replace blades?": "Comment savoir quand faire pivoter ou remplacer les lames ?",
  "How do I minimize springback in radius bending?": "Comment puis-je minimiser le retour élastique dans le rayon de courbure ?",
  "How do I select the correct V-die opening?": "Comment puis-je sélectionner la bonne ouverture de matrice en V ?",
  "How do I select the correct blade size?": "Comment sélectionner la bonne taille de lame ?",
  "How do I select the correct radius for my application?": "Comment puis-je sélectionner le rayon approprié pour mon application ?",
  "How do I select the correct throat depth for my gooseneck punch?": "Comment puis-je sélectionner la bonne profondeur de gorge pour mon perforateur à col de cygne ?",
  "How do I select the correct tooth pitch for my application?": "Comment puis-je sélectionner le pas de dent correct pour mon application ?",
  "How does the 10-second exchange platform work?": "Comment fonctionne la plateforme d'échange 10 secondes ?",
  "How does the automatic tube feeding system work?": "Comment fonctionne le système d’alimentation automatique par sonde ?",
  "How does the crowning system work?": "Comment fonctionne le système de couronnement ?",
  "How long do chipper blades typically last?": "Combien de temps durent généralement les lames de déchiqueteuse ?",
  "How long do crusher blades typically last?": "Combien de temps durent généralement les lames de concasseur ?",
  "How long do rolling shear blades typically last?": "Combien de temps durent généralement les lames de cisailles à rouleaux ?",
  "How long do shearing machine blades last?": "Combien de temps durent les lames de la cisaille ?",
  "How long do toothed blades last?": "Combien de temps durent les lames dentées ?",
  "How long does installation and commissioning take?": "Combien de temps prennent l’installation et la mise en service ?",
  "How long does it take to program new parts?": "Combien de temps faut-il pour programmer de nouvelles pièces ?",
  "How long does press brake tooling last?": "Combien de temps dure l'outillage de presse plieuse ?",
  "How long is the warranty period?": "Quelle est la durée de la période de garantie ?",
  "How much faster is a double table machine compared to single table?": "Dans quelle mesure une machine à double table est-elle plus rapide qu’une machine à table simple ?",
  "How much maintenance does it require?": "Combien d'entretien nécessite-t-il ?",
  "How often do the blades need to be replaced?": "À quelle fréquence les lames doivent-elles être remplacées ?",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and\n            synchronization testing. We provide comprehensive on-site commissioning and operator training.": "L'installation nécessite généralement 2 à 3 semaines, y compris le positionnement de la machine, la configuration du réseau, l'étalonnage et les tests de synchronisation. ",
  "Is cutting quality the same in both modes?": "La qualité de coupe est-elle la même dans les deux modes ?",
  "Is it suitable for beginners?": "Est-ce adapté aux débutants ?",
  "Is operator training more complex for the integrated machine?": "La formation des opérateurs est-elle plus complexe pour la machine intégrée ?",
  "Is training and installation support provided?": "Une formation et une assistance à l'installation sont-elles fournies ?",
  "Is training provided for operators?": "Une formation est-elle dispensée aux opérateurs ?",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches\n            typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii\n            exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending.\n            Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "Le rayon maximum réalisable dépend de la largeur de la table de la presse plieuse et du système d'outillage. ",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap\n            rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part\n            complexity, and current labor costs.": "La plupart des clients constatent rapidement un retour sur investissement grâce aux économies de main d'œuvre, à une productivité accrue, à des taux de rebut réduits et à la possibilité d'effectuer des équipes sans personnel. ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion),\n            assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables\n            (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power\n            consumption and minimal maintenance requirements.": "Les coûts de fonctionnement comprennent l'électricité (les lasers à fibre sont très efficaces avec une conversion électro-optique d'environ 30 %), le gaz d'assistance (azote, oxygène ou air comprimé), l'électricité du refroidisseur d'eau et les consommables occasionnels (lentilles de protection, buses). ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil\n            (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column\n            hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle\n            while consuming minimal energy during fast approach and return strokes.": "Les coûts d'exploitation comprennent l'électricité pour le moteur de la pompe hydraulique (les besoins en énergie varient selon le tonnage), l'huile hydraulique (remplacements périodiques), le remplacement des filtres, la lubrification et le remplacement occasionnel des joints. ",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum,\n            copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Nos cintreuses CNC peuvent traiter divers matériaux, notamment l'acier doux, l'acier inoxydable, l'aluminium, le cuivre et d'autres alliages métalliques. ",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency.\n            The CNC system allows precise control of roll positions and automatically calculates the correct settings\n            based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in\n            real-time to maintain consistent quality throughout the operation.": "Nos laminoirs de tôles contrôlés par CNC atteignent une précision de pliage élevée pour une cohérence de diamètre. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and\n            12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and titanium.": "Nos machines de découpe laser à fibre peuvent couper différentes épaisseurs d'acier au carbone, d'acier inoxydable, d'aluminium et 12 mm, et de cuivre/laiton jusqu'à 8 mm (les épaisseurs varient en fonction de la puissance du laser). ",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "Nos cisailles à guillotine peuvent traiter divers matériaux métalliques, notamment l'acier doux, l'acier inoxydable, l'aluminium, le cuivre, le laiton et d'autres tôles métalliques. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass,\n            plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking,\n            powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based\n            on material type, thickness, and forming operation requirements.": "Nos presses hydrauliques traitent une large gamme de matériaux, notamment l'acier, l'acier inoxydable, l'aluminium, le cuivre, le laiton, les plastiques, le caoutchouc et les matériaux composites. ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile\n            metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength.\n            Softer materials and those with higher ductility are easier to roll to smaller diameters.": "Nos machines à rouler les tôles peuvent traiter l'acier au carbone, l'acier inoxydable, les alliages d'aluminium et d'autres métaux ductiles. ",
  "Our punching machines can process various thicknesses of carbon steel, stainless steel, aluminum,\n            and copper/brass (thicknesses vary based on machine capacity). Higher tonnage machines can process\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and other sheet metals.": "Nos poinçonneuses peuvent traiter différentes épaisseurs d'acier au carbone, d'acier inoxydable, d'aluminium et de cuivre/laiton (les épaisseurs varient en fonction de la capacité de la machine). ",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "Nos lames de cisailles à roulement manipulent une large gamme de matériaux, notamment l'acier, l'acier inoxydable, l'aluminium, le cuivre, le laiton, les films plastiques, le papier, le carton, le caoutchouc, la mousse, les textiles et les matériaux composites. ",
  "Our shearing blades can cut mild steel, stainless steel, aluminum, copper, brass, and other metal alloys. The maximum cutting thickness depends on material hardness and machine capacity. Standard blades handle materials up to 50mm thick in mild steel. For harder materials like stainless steel, specialized blade materials are recommended.": "Nos lames de cisaillement peuvent couper l'acier doux, l'acier inoxydable, l'aluminium, le cuivre, le laiton et d'autres alliages métalliques. ",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "Nos cisailles à poutre pivotante peuvent traiter divers matériaux métalliques, notamment l'acier doux, l'acier inoxydable, l'aluminium, les plaques de cuivre et d'autres tôles métalliques. ",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide\n            comprehensive training for operators and programmers. Most operators become proficient with basic operations\n            within a short training period.": "Notre système dispose d'une interface intuitive qui nécessite des connaissances minimales en robotique. ",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced\n            sensors continuously monitor and adjust for perfect coordination between both machines.": "Nos systèmes tandem maintiennent une précision de synchronisation exceptionnelle tout au long du processus de pliage. ",
  "Our tube laser cutting machines can process round, square, rectangular, and oval tubes. Standard capacity\n            ranges from customizable diameter, with optional upgrades available for tubes larger diameter options. The machine\n            can handle tube lengths up to Customizable length (standard) with extended options up to 12000mm. Wall thicknesses depend\n            on laser power and material type.": "Nos machines de découpe laser de tubes peuvent traiter des tubes ronds, carrés, rectangulaires et ovales. ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling\n            operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our\n            4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing\n            and reinserting the plate, which saves time and improves quality.": "Le pré-cintrage est le processus de cintrage des bords d’attaque et de fuite de la plaque avant l’opération de laminage principale. ",
  "Q:": "Question :",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear,\n            lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system\n            should be serviced annually with oil changes and filter replacements. With proper maintenance, our\n            machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and\n            training with each machine.": "L'entretien régulier comprend la vérification des niveaux et de la qualité de l'huile hydraulique, l'inspection de l'usure des surfaces des rouleaux, la lubrification des roulements et des pièces mobiles et la vérification de l'alignement du système de rouleaux. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting\n            hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings,\n            checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper\n            maintenance ensures reliable operation and extends machine lifespan for many years.": "L'entretien régulier comprend : la vérification des niveaux et de la qualité de l'huile hydraulique (vidanges d'huile périodiques), l'inspection des tuyaux et des raccords hydrauliques pour déceler les fuites, le nettoyage ou le remplacement des filtres, la lubrification des poteaux de guidage et des roulements linéaires, la vérification des manomètres et des vannes de commande. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine\n            daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide\n            a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "L'entretien régulier est simple et direct : vérifiez les niveaux d'huile hydraulique chaque semaine, nettoyez la machine quotidiennement, lubrifiez les pièces mobiles selon le calendrier et inspectez régulièrement l'état de la lame. ",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality,\n            significantly increased productivity, reduced labor costs, enhanced safety by removing operators from\n            hazardous zones, and the ability to automate complex multi-bend sequences.": "Les presses plieuses robotisées offrent des avantages significatifs, notamment un fonctionnement sans personnel 24h/24 et 7j/7, une qualité constante, une productivité considérablement accrue, des coûts de main-d'œuvre réduits, une sécurité améliorée en éloignant les opérateurs des zones dangereuses et la possibilité d'automatiser des séquences complexes à plusieurs plis.",
  "Signs include increased burring, rough cut edges, visible nicks or chips in the cutting edge, increased cutting force required, or material deformation. When these occur, rotate the blade to use a fresh edge. Replace when all four edges show significant wear. Regular visual inspection after every shift helps maintain optimal cutting quality.": "Les signes incluent une augmentation des bavures, des bords de coupe rugueux, des entailles ou des éclats visibles dans le tranchant, une force de coupe accrue requise ou une déformation du matériau. ",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "Les signes incluent une taille de particule accrue, une granulation inégale, une consommation d'énergie plus élevée, un bruit excessif, des dommages ou des arrondis visibles des lames et un débit réduit. ",
  "Signs include larger chip sizes, increased power consumption, excessive fines or dust, visible edge rounding or nicks, and increased feeding force required. Inspect blades every 50-100 operating hours for wear. Replace or sharpen when cutting edge shows significant rounding or if nicks exceed 3mm depth. Rotating blade positions during inspection helps ensure even wear across all cutting edges.": "Les signes incluent des copeaux de plus grande taille, une consommation d'énergie accrue, des fines ou de la poussière excessives, des arrondis ou des entailles visibles sur les bords et une force d'alimentation accrue requise. ",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "Les machines de découpe laser à table unique disposent d'une table de travail fixe, offrant une solution plus économique adaptée aux volumes de production faibles à moyens. ",
  "Single table punching machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "Les poinçonneuses à table unique disposent d'une table de travail fixe, offrant une solution plus économique adaptée aux volumes de production faibles à moyens. ",
  "SmartCut AI is our intelligent control system that automatically optimizes cutting parameters in real-time.\n            It analyzes tube geometry, material characteristics, and wall thickness to adjust laser power, cutting\n            speed,\n            and focal position. This reduces material waste by up to 18%, improves edge quality, and minimizes operator\n            skill requirements. The system also includes automatic nesting software to maximize material utilization.": "SmartCut AI est notre système de contrôle intelligent qui optimise automatiquement les paramètres de coupe en temps réel. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "Certains modèles de lames dentées peuvent être réaffûtés, tandis que d'autres sont conçus pour être remplacés. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback:\n            use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom\n            bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening\n            to reduce stress, and consider coining for zero springback applications. Material-specific springback\n            tables help predict and compensate for springback in production.": "Le retour élastique augmente avec la dureté du matériau et diminue avec un rayon de courbure plus grand. ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications\n            or higher power configurations may require 45-60 days. We provide regular production updates and coordinate\n            logistics to ensure smooth delivery and installation.": "Les machines à configuration standard sont généralement expédiées dans les 30 à 45 jours suivant la confirmation de la commande. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage\n            machines or custom specifications may require additional time due to larger component manufacturing requirements.\n            We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Les machines à configuration standard sont généralement expédiées dans un délai raisonnable après la confirmation de la commande. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations\n            may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your\n            order and keep you updated throughout the manufacturing process.": "Les configurations standard sont généralement expédiées dans les 30 à 45 jours suivant la confirmation de la commande. ",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days.\n            We'll provide a specific timeline when you place your order.": "Les configurations standard sont généralement expédiées sous 30 à 45 jours. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching\n            hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to\n            prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless\n            steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface\n            hardness while maintaining core toughness.": "Les poinçons à col de cygne standard sont fabriqués à partir d'acier allié T10A, 42CrMo ou Cr12MoV avec une dureté de trempe de HRC 47±2. ",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us\n            for specific delivery timelines.": "Les modèles standard sont généralement expédiés sous 20 à 30 jours. ",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear\n            resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials\n            (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness\n            extends tool life but requires careful handling to avoid chipping.": "L'outillage standard des presses plieuses a généralement une dureté de HRC 45-52, ce qui offre une excellente résistance à l'usure tout en conservant la ténacité pour éviter les fissures. ",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "Les lames de taille standard sont généralement expédiées sous 7 à 10 jours ouvrables. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like\n            a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials.\n            Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher\n            precision.": "Les cisailles à poutre pivotante utilisent une conception de bras pendulaire avec un mouvement de coupe en forme d'arc, offrant des avantages tels qu'un encombrement réduit, une bonne stabilité et une vitesse de travail rapide. ",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations\n            can be designed for various length requirements based on your specific applications.": "Les configurations tandem peuvent traiter des pièces très longues bien au-delà de la capacité standard d'une seule machine. ",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses\n            CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting\n            the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "Le système de bombage automatique compense la déflexion du cadre en ajustant la courbure de la table. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life.\n            Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions,\n            blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Les lames sont conçues avec quatre tranchants utilisables, ce qui prolonge considérablement leur durée de vie. ",
  "The bundle feeder system can hold up to 1800kg of raw tube stock arranged in bundles. Tubes are\n            automatically separated and fed one by one into the four-chuck clamping system. The system is programmable\n            for different tube sizes and can operate continuously without manual intervention. This dramatically\n            increases productivity by eliminating manual loading time and allowing operators to focus on other tasks.": "Le système d'alimentation en paquets peut contenir jusqu'à 1 800 kg de tubes bruts disposés en paquets. ",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the\n            desired mode (plate or tube) on the control panel, and the machine automatically releases the current\n            platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and\n            installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "La plateforme d'échange utilise un système automatisé de changement rapide avec un positionnement précis. ",
  "The fiber laser tube cutter can process carbon steel, stainless steel, aluminum, copper, brass, and titanium\n            tubes. Maximum cutting thickness varies by material: carbon steel up to 8mm, stainless steel up to 6mm,\n            aluminum up to 5mm (thicknesses depend on laser power). The machine handles both coated and uncoated tubes,\n            including galvanized and powder-coated materials.": "Le coupe-tube laser à fibre peut traiter des tubes en acier au carbone, en acier inoxydable, en aluminium, en cuivre, en laiton et en titane. ",
  "The four-chuck clamping system provides superior stability compared to three-chuck systems. It minimizes\n            vibration during cutting, prevents tube displacement, and ensures consistent positioning accuracy of\n            High precision.\n            This is especially important for thin-walled tubes and complex cutting patterns. The pneumatic system allows\n            for quick tube changes while maintaining precise clamping force across different tube sizes.": "Le système de serrage à quatre mandrins offre une stabilité supérieure par rapport aux systèmes à trois mandrins. ",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example,\n            2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents\n            cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider\n            die openings.": "La règle générale est d'utiliser une ouverture en V correspondant à 8 fois l'épaisseur du matériau (règle des 8T). ",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines.\n            Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it\n            ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and\n            dust extractors, which are shared between both modes.": "La machine intégrée nécessite environ 50 % d'espace au sol en moins que les machines séparées à plaques et à tubes. ",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines.\n            Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility\n            expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most\n            customers see ROI within 18-24 months compared to buying two separate systems.": "La machine intégrée coûte généralement 30 à 40 % de moins que l'achat de machines de découpe de plaques et de tubes séparées. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air\n            bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch\n            tip radius to the natural internal radius created by the die opening for consistent angles. Consider\n            material springback (stainless steel requires 1-2° compensation). Consult our technical team with your\n            material specifications for optimal radius selection.": "Le rayon du poinçon doit être d'au moins 63 % de l'épaisseur du matériau pour éviter la concentration des contraintes. ",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines\n            automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both\n            controllers.": "Le système comprend une gestion complète des erreurs. ",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine\n            maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press\n            brake maintenance. We provide remote diagnostics and support.": "Le système comprend des fonctionnalités de maintenance prédictive qui vous alertent avant que des problèmes ne surviennent. ",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal\n            alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "La presse plieuse à torsion synchronisée peut traiter l'acier doux, l'acier inoxydable, l'aluminium et d'autres alliages métalliques courants. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from\n            the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels\n            formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part\n            drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and\n            face width for your application.": "La profondeur de la gorge doit être déterminée par la longueur de la bride de retour que vous devez former. ",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality\n            heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials\n            reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection\n            maximize longevity. Worn tooling can be reground to restore performance.": "La durée de vie de l'outil dépend du matériau plié, de la fréquence de pliage, du tonnage appliqué et de l'entretien. ",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "Le choix du pas de dent dépend de la résistance à la déchirure et de la qualité de perforation souhaitées. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "Les lames dentées peuvent perforer le papier, le carton, les films plastiques, les stratifiés, les feuilles, les textiles et les matériaux spéciaux. ",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more\n            economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than\n            electro-hydraulic systems, it's more reliable and requires less maintenance.": "Torsion-synchro utilise une barre de torsion mécanique pour synchroniser le mouvement du vérin, ce qui le rend plus simple et plus économique que les systèmes hydrauliques ou électro-hydrauliques. ",
  "Training is actually simplified because operators learn one control system for both functions. The interface\n            is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient\n            in both modes within 3-5 days of training. The unified control system means operators don't need to learn\n            two different machines, reducing the overall training burden.": "La formation est en réalité simplifiée car les opérateurs apprennent un seul système de contrôle pour les deux fonctions. ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking\n            is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative\n            metalwork, and any application where surface quality is critical. Steel dies are preferred for higher\n            production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane\n            combines both benefits.": "Utilisez des matrices en uréthane pour plier des matériaux préfinis, pré-peints ou polis où le marquage de surface est inacceptable. ",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and\n            occasional inspection of the torsion bar are typically all that's needed. The mechanical design is\n            inherently reliable.": "Un entretien très minimal est requis. ",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty\n            options are available. Lifetime technical support is included with all machines.": "Nous offrons une garantie complète de 2 ans couvrant tous les principaux composants et systèmes. ",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization\n            system. Extended warranty packages and dedicated support programs are available.": "Nous offrons une garantie complète de 2 ans couvrant tous les composants principaux, y compris le système de synchronisation. ",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This\n            includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended\n            warranty packages and preventive maintenance programs are available.": "Nous offrons une garantie complète de 3 ans sur les machines robustes couvrant tous les composants principaux. ",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are\n            available. Technical support is provided for the life of the machine.": "Nous offrons une garantie standard d'un an couvrant tous les principaux composants. ",
  "What are the cost savings compared to buying two separate machines?": "Quelles sont les économies réalisées par rapport à l’achat de deux machines distinctes ?",
  "What are the main advantages of a robotic press brake?": "Quels sont les principaux avantages d’une presse plieuse robotisée ?",
  "What are the operating costs?": "Quels sont les frais de fonctionnement ?",
  "What blade material offers the best value?": "Quel matériau de lame offre le meilleur rapport qualité-prix ?",
  "What blade material should I choose for my application?": "Quel matériau de lame dois-je choisir pour mon application ?",
  "What does \"scimitar\" mean in press brake tooling?": "Que signifie « cimeterre » dans l'outillage des presses plieuses ?",
  "What foundation requirements are needed?": "Quelles exigences de fondation sont nécessaires ?",
  "What happens if one machine encounters an error?": "Que se passe-t-il si une machine rencontre une erreur ?",
  "What hardness should press brake tooling have?": "Quelle dureté doivent avoir les outils de presse plieuse ?",
  "What information do I need to provide for a custom blade quote?": "Quelles informations dois-je fournir pour un devis de lame personnalisé ?",
  "What is SmartCut AI and how does it improve cutting?": "Qu’est-ce que SmartCut AI et comment améliore-t-il la coupe ?",
  "What is pre-bending and why is it important?": "Qu’est-ce que le pré-cintrage et pourquoi est-ce important ?",
  "What is the ROI for a robotic press brake system?": "Quel est le retour sur investissement d’un système de presse plieuse robotisée ?",
  "What is the advantage of a four-column hydraulic press over other press types?": "Quel est l'avantage d'une presse hydraulique à quatre colonnes par rapport aux autres types de presses ?",
  "What is the advantage of the four-chuck clamping system?": "Quel est l'avantage du système de serrage à quatre mandrins ?",
  "What is the difference between 3-roll and 4-roll plate rolling machines?": "Quelle est la différence entre les rouleuses de tôles à 3 rouleaux et à 4 rouleaux ?",
  "What is the difference between a gooseneck punch and a standard punch?": "Quelle est la différence entre un perforateur col de cygne et un perforateur standard ?",
  "What is the difference between bump forming and radius tooling?": "Quelle est la différence entre le formage de bosses et l'outillage à rayon ?",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "Quelle est la différence entre les presses plieuses électro-hydrauliques et hydrauliques ?",
  "What is the difference between guillotine and swing beam shears?": "Quelle est la différence entre les cisailles à guillotine et à poutre pivotante ?",
  "What is the difference between single table and dual table laser cutting machines?": "Quelle est la différence entre les machines de découpe laser à table unique et à table double ?",
  "What is the difference between single table and dual table punching machines?": "Quelle est la différence entre les poinçonneuses à table simple et à table double ?",
  "What is the difference between swing beam and guillotine shears?": "Quelle est la différence entre une cisaille à poutre pivotante et une cisaille guillotine ?",
  "What is the difference between torsion-synchro and hydraulic synchronization?": "Quelle est la différence entre la synchronisation par torsion et la synchronisation hydraulique ?",
  "What is the expected delivery time?": "Quel est le délai de livraison prévu ?",
  "What is the maximum radius I can achieve on a press brake?": "Quel est le rayon maximum que je peux atteindre sur une presse plieuse ?",
  "What is the maximum workpiece length a tandem system can handle?": "Quelle est la longueur maximale de la pièce à usiner qu’un système tandem peut gérer ?",
  "What is the typical delivery time?": "Quel est le délai de livraison habituel ?",
  "What is the typical lead time for custom blades?": "Quel est le délai de livraison typique pour les lames personnalisées ?",
  "What is the typical lead time for delivery?": "Quel est le délai de livraison habituel ?",
  "What is the typical lead time?": "Quel est le délai de livraison typique ?",
  "What is the warranty coverage?": "Quelle est la couverture de la garantie ?",
  "What maintenance does a fiber laser require?": "Quel entretien nécessite un laser fibre ?",
  "What maintenance does a hydraulic press require?": "Quel entretien nécessite une presse hydraulique ?",
  "What maintenance is required?": "Quel entretien est nécessaire ?",
  "What material is best for press brake tooling?": "Quel matériau est le meilleur pour l’outillage des presses plieuses ?",
  "What materials and applications are suitable for four-column hydraulic presses?": "Quels matériaux et applications conviennent aux presses hydrauliques à quatre colonnes ?",
  "What materials and hardness should gooseneck punches have?": "Quels matériaux et quelle dureté doivent avoir les poinçons à col de cygne ?",
  "What materials and thicknesses can be cut?": "Quels matériaux et épaisseurs peuvent être découpés ?",
  "What materials and thicknesses can be rolled?": "Quels matériaux et épaisseurs peuvent être laminés ?",
  "What materials can be bent with this machine?": "Quels matériaux peuvent être pliés avec cette machine ?",
  "What materials can be cut with the tube laser?": "Quels matériaux peuvent être découpés avec le laser à tube ?",
  "What materials can be cut with these blades?": "Quels matériaux peuvent être coupés avec ces lames ?",
  "What materials can be cut with this machine?": "Quels matériaux peuvent être découpés avec cette machine ?",
  "What materials can these blades cut?": "Quels matériaux ces lames peuvent-elles couper ?",
  "What materials can toothed blades perforate?": "Quels matériaux les lames dentées peuvent-elles perforer ?",
  "What maximum material thickness can heavy-duty press brakes handle?": "Quelle épaisseur maximale de matériau les presses plieuses robustes peuvent-elles gérer ?",
  "What space is required for installation?": "Quel espace est nécessaire pour l'installation ?",
  "What tube shapes and sizes can the machine cut?": "Quelles formes et tailles de tubes la machine peut-elle couper ?",
  "What warranty and support is provided?": "Quelle garantie et quelle assistance sont fournies ?",
  "What warranty is included?": "Quelle garantie est incluse ?",
  "What's the difference between European and American tooling standards?": "Quelle est la différence entre les normes d'outillage européennes et américaines ?",
  "When should I use urethane dies instead of steel?": "Quand dois-je utiliser des matrices en uréthane au lieu de l’acier ?",
  "Which blade type should I choose for my application?": "Quel type de lame dois-je choisir pour mon application ?",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly\n            without interrupting production. The AI system also learns from each bending operation to\n            optimize future programs automatically.": "Grâce à notre logiciel avancé de programmation hors ligne et à notre simulation 3D, de nouvelles pièces peuvent être programmées rapidement sans interrompre la production. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending\n            operations where deep relief clearance is required. These combine the interference-free benefits of\n            gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed\n            by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming\n            tooling.": "Oui, les poinçons à col de cygne à angle aigu (30°, 45°, 60°) sont spécialement conçus pour les opérations d'ourlage et de pliage aigu où un dégagement profond est requis. ",
  "Yes, chipper blades can be professionally sharpened multiple times before replacement. Most blades can be resharpened 3-6 times depending on wear severity and original blade thickness. Professional sharpening services restore proper bevel angle and edge geometry. Regular sharpening before severe dulling occurs maximizes total blade life and maintains optimal chip quality. We offer sharpening services with quick turnaround.": "Oui, les lames de déchiqueteuse peuvent être affûtées professionnellement plusieurs fois avant d’être remplacées. ",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "Oui, des instructions d'installation complètes sont fournies avec toutes les commandes de lames, y compris l'alignement correct de la lame, le réglage de l'écart et les spécifications de couple. ",
  "Yes, comprehensive installation instructions, torque specifications, and maintenance guidelines are provided with blade orders. We offer technical support for proper blade installation, adjustment, and troubleshooting. Safety information and best practices documentation are included. Our technical team is available to answer questions about blade installation, sharpening schedules, and performance optimization for your specific application.": "Oui, des instructions d'installation complètes, des spécifications de couple et des directives de maintenance sont fournies avec les commandes de lames. ",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "Oui, une assistance technique complète est incluse avec toutes les commandes de lames. ",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head,\n            and control system for both applications. The CNC system automatically optimizes parameters for each mode.\n            Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across\n            all operations.": "Oui, la qualité de découpe est identique dans les deux modes. ",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively\n            giving you two separate press brakes when tandem operation is not needed.": "Oui, chaque machine peut être commutée en mode de fonctionnement indépendant pour les pièces de longueur standard, vous offrant ainsi deux presses plieuses séparées lorsque le fonctionnement en tandem n'est pas nécessaire.",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature\n            oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation.\n            Regular maintenance schedules should be followed to ensure optimal performance.": "Oui, les presses plieuses robustes sont spécialement conçues pour une production industrielle continue. ",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "Oui, la plupart des lames de concasseur peuvent être réaffûtées professionnellement 2 à 4 fois en fonction de la gravité de l'usure et de la conception de la lame. ",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The\n            adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts\n            bending parameters for different materials including steel, stainless steel, and aluminum.": "Oui, notre système robotique est très flexible et peut gérer une large gamme de tailles de feuilles et de matériaux. ",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "Oui, nos lames de cisailles à rouleaux sont conçues pour plusieurs cycles de réaffûtage. ",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller\n            and straightforward operation make it easy to learn compared to more complex CNC systems.": "Oui, la presse plieuse à torsion synchronisée est idéale pour les opérateurs ayant une formation de base. ",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within\n            24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Oui, nous maintenons un inventaire complet de pièces de rechange et de consommables. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "Oui, nous proposons des services de production d’échantillons de lames et de tests pour des applications personnalisées. ",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will\n            ensure your machine is properly set up and your operators are fully trained to use it efficiently and\n            safely.": "Oui, nous fournissons des services d’installation complets et une formation complète des opérateurs. ",
  "Yes, we provide comprehensive installation guidelines, blade gap adjustment procedures, and setup recommendations with every blade order. Our technical support team is available to assist with installation questions, troubleshooting, and optimization. On-site installation services are available for large orders or complex applications.": "Oui, nous fournissons des directives d'installation complètes, des procédures de réglage de l'écartement des lames et des recommandations de configuration avec chaque commande de lame. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team\n            will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting.\n            Training materials and operation manuals are also provided.": "Oui, nous proposons une formation complète des opérateurs dans le cadre de notre service d’installation. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator\n            training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization,\n            basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Oui, nous fournissons une assistance complète comprenant l'installation sur site, la mise en service de la machine et la formation des opérateurs (généralement 3 à 5 jours). ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance,\n            and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment,\n            safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "Oui, nous fournissons une assistance complète comprenant l'installation sur site, la mise en service de la machine, des conseils sur les exigences en matière de fondation et la formation des opérateurs. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius\n            dimensions, material specifications, production volume, and part drawings. Our engineering team will\n            design custom arc molds optimized for your specific application. Custom tooling is particularly\n            cost-effective for high-volume production runs requiring consistent radius specifications not available\n            in standard tooling catalogs.": "Oui, nous sommes spécialisés dans les outils à rayon personnalisé pour des applications uniques. ",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings,\n            material specifications, and bend requirements. Our engineering team will design custom dies for U-channels,\n            Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results\n            for high-volume production runs.": "Oui, nous sommes spécialisés dans les outils personnalisés pour des applications de pliage uniques. ",
  "Yes, with the optional bevel cutting head upgrade, our tube laser can cut various bevel angles for pipe\n            welding preparation. The system can create V-grooves, K-grooves, and other weld joint configurations at\n            precise angles. This eliminates the need for secondary beveling operations and ensures perfect fit-up for\n            welding. The SmartCut AI system automatically calculates optimal cutting paths for complex bevel geometries.": "Oui, avec la mise à niveau facultative de la tête de coupe en biseau, notre laser à tube peut couper différents angles de biseau pour la préparation du soudage des tuyaux. ",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting\n            the roll positions to create a gradual taper. The CNC system calculates the required roll positions for\n            the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and\n            conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "Oui, avec l'accessoire de roulement conique en option, nos machines peuvent produire des formes coniques en ajustant les positions des rouleaux pour créer une conicité progressive. "
}