{
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar\n            sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel\n            formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both\n            deep relief clearance and offset capability for the most challenging box and channel forming operations.": "「シミター」または「サーベル」は、シミター剣の湾曲した刃に似た、オフセットされた湾曲した輪郭デザインを指します。",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the\n            leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and\n            efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They\n            produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision\n            work and thick plate rolling.": "3 ロール機はより経済的で一般的な用途に適していますが、前縁を個別に事前に曲げる必要があり、より長い直線エッジが残る場合があります。 ",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing\n            flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to\n            form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing\n            the punch from hitting previously formed flanges, making them essential for box forming, door frames,\n            and channel bending applications.": "グースネック パンチは、既存のフランジや深いボックス形状にクリアランスを提供する深いレリーフ設計 (オフセット プロファイル) を特徴としています。",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day.\n            Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to\n            switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production\n            orders without significant downtime.": "絶対に！",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications.\n            Provide part drawings showing flange dimensions, bend angles, material specifications, and production\n            volume. Our engineering team will design custom gooseneck tooling optimized for your specific application,\n            including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom\n            tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "絶対に。",
  "Are spare parts readily available?": "スペアパーツはすぐに入手できますか?",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "ブレードの寿命は、切断する材料、切断速度、メンテナンス方法によって異なります。",
  "Blade life depends on material being cut, thickness, frequency of use, and maintenance. With four usable edges, our blades can last 4 times longer than single-edge blades. Typical service life ranges from tens of thousands to hundreds of thousands of cuts. Proper blade gap adjustment and regular rotation extend blade life significantly.": "ブレードの寿命は、切断する材料、厚さ、使用頻度、メンテナンスによって異なります。 ",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "ブレードの寿命は、材料の種類、クラッシャー速度、ブレードの材質によって異なります。",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "ブレードの寿命は、加工される材料、生産速度、歯のデザインによって大きく異なります。 ",
  "Blade life varies significantly based on wood type, material diameter, presence of dirt/rocks, and maintenance practices. In clean wood applications, chromium steel blades typically last 150-300 hours of continuous operation. Carbide-inlay blades can last 800-1200 hours when avoiding metal contaminants. Proper blade maintenance, rotation, and avoiding dirt-contaminated wood maximize blade life.": "ブレードの寿命は、木材の種類、材料の直径、汚れや石の有無、メンテナンス方法によって大きく異なります。",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "ブレードの選択は、機械の仕様、材料の種類、切断要件によって異なります。",
  "Blades with minor wear can sometimes be professionally re-ground to restore cutting performance. However, deep nicks, cracks, or severe wear typically require replacement. Re-grinding reduces blade dimensions and may affect machine blade gap settings. We offer professional blade inspection services to determine if re-grinding is cost-effective for your situation.": "軽微な摩耗のあるブレードは、切断性能を回復するために専門的に再研磨される場合があります。",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through\n            multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling\n            uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump\n            forming is cost-effective for occasional large radius work, while dedicated radius tooling provides\n            superior surface finish and faster production for regular radius bending applications.": "バンプ成形では、CNC プログラミングによる標準の V ダイとパンチを使用して、複数の小さな段階的な曲げ (直線セグメントで円弧を近似) を通じて大きな半径の円弧を作成します。",
  "Can I process both plates and tubes in the same production run?": "同じ生産工程でプレートとチューブの両方を処理できますか?",
  "Can chipper blades be sharpened and reused?": "チッパーの刃は研いで再利用できますか?",
  "Can crusher blades be sharpened and reused?": "クラッシャーの刃は研いで再利用できますか？",
  "Can damaged blades be repaired or re-sharpened?": "傷んだ刃物を修理したり、研ぎ直したりすることはできますか?",
  "Can gooseneck punches be used for hemming operations?": "グースネックパンチは裾上げ作業に使用できますか?",
  "Can the machine cut bevels for pipe welding?": "パイプ溶接用のベベルカットはできますか?",
  "Can the machine roll conical shapes?": "機械は円錐形を転がすことができますか?",
  "Can the machines operate independently?": "機械は独立して動作できますか?",
  "Can the system handle different sheet sizes and materials?": "さまざまなシートサイズや材質に対応できますか?",
  "Can these blades be re-sharpened?": "これらの刃は研ぎ直すことができますか?",
  "Can these machines run 24/7?": "これらのマシンは 24 時間年中無休で稼働できますか?",
  "Can toothed blades be re-sharpened?": "歯付きの刃は研ぎ直すことができますか?",
  "Can you manufacture custom profile dies?": "カスタムプロファイルの金型を製造できますか?",
  "Can you manufacture custom radius profiles?": "カスタム半径プロファイルを製造できますか?",
  "Check your chipper's operator manual for blade specifications including length, width, thickness, and bolt hole pattern. Measure existing blades if manual is unavailable. Provide chipper brand and model number - we maintain specifications for most major brands (Vermeer, Bandit, Morbark, etc.). Send us photos or measurements of existing blades for confirmation. We can cross-reference and provide exact replacement blades.": "長さ、幅、厚さ、ボルト穴のパターンなどのブレードの仕様については、チッパーの取扱説明書を確認してください。",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength,\n            wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium\n            HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production\n            volume, material being bent, and required tool life.": "クロムモリブデン鋼 (42CrMo、Cr12MoV) は業界標準であり、優れた強度、耐摩耗性、腐食保護を提供します。",
  "Common questions about our": "弊社に関するよくある質問",
  "Contact our support team": "サポートチームにお問い合わせください",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick,\n            stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage,\n            working length, and material properties.": "トン数と材料の種類に応じて、大型プレス ブレーキは厚さ 50 mm までの軟鋼、厚さ 30 mm までのステンレス鋼、および 40 mm までのアルミニウムを曲げることができます。",
  "Do I need special skills to operate a robotic system?": "ロボットシステムを操作するには特別なスキルが必要ですか?",
  "Do you manufacture custom gooseneck profiles?": "カスタムのグースネックプロファイルを製造していますか?",
  "Do you offer sample testing before production orders?": "生産注文の前にサンプルテストを提供できますか?",
  "Do you offer technical support and installation guidance?": "技術サポートや設置ガイダンスは提供されますか?",
  "Do you provide installation and maintenance guidance?": "設置やメンテナンスの指導はしてもらえますか?",
  "Do you provide installation and setup guidance?": "インストールとセットアップのガイダンスは提供されますか?",
  "Do you provide installation and setup support?": "インストールとセットアップのサポートは提供されますか?",
  "Do you provide installation and training?": "設置とトレーニングは提供されますか?",
  "Double table machines typically achieve 40-50% higher productivity than single table machines. The automatic\n            table exchange takes only rapid, and while one table is cutting, the operator can load/unload the other\n            table simultaneously. This eliminates material loading downtime and enables continuous 24/7 operation, making\n            it ideal for high-volume production environments.": "ダブルテーブルマシンは通常、シングルテーブルマシンよりも 40 ～ 50% 高い生産性を達成します。",
  "Download PDF": "PDFをダウンロード",
  "Download Technical Brochure": "技術パンフレットをダウンロード",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between\n            cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also\n            consume less energy and provide faster response times.": "電気油圧プレス ブレーキは、電子制御システムを使用してシリンダ間の正確な同期を実現し、従来の油圧システムと比較して精度と再現性が向上します。",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized\n            clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical\n            or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American\n            systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "ヨーロッパのツーリング (Wila、Amada、Trumpf システム) は、標準化されたクランプ システムを備えたセグメント化されたクイックチェンジ ツーリングを使用して、迅速なセットアップを実現します。",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning\n            protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction\n            filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser\n            gas refills or mirror alignments are needed.": "ファイバー レーザーは、CO2 レーザーと比べてメンテナンスがほとんど不要です。",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "フラットブレードはボトルやフィルムなどの薄肉製品 (3mm 未満) に最適で、より高い生産量を提供します。",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "正確なカスタム見積もりを得るには、ブレードの外径、内径 (ボア サイズ)、ハブの厚さ、希望の歯のピッチ、既知の場合は歯形のタイプ、加工される材料、材料の厚さ、生産速度、および特別な要件を提供してください。",
  "For general mild steel cutting, Cr12MoV or 6CrW2Si provides excellent performance and value. For stainless steel and harder materials, consider high-speed steel (HSS) or tungsten carbide. For high-volume production, premium materials offer better long-term cost-effectiveness despite higher initial cost. Our technical team can recommend optimal materials based on your specific application.": "一般的な軟鋼の切断には、Cr12MoV または 6CrW2Si が優れた性能と価値を提供します。",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "時々使用する場合や柔らかいプラスチックの場合は、高炭素鋼が適しています。",
  "For occasional use with clean wood, carbon steel offers good value. For professional/commercial operations, chromium steel (8%+ Cr) provides the best balance of performance and cost. For high-volume production or abrasive applications, consider premium tool steels. Carbide-inlay blades are recommended for maximum productivity in continuous operations despite higher initial cost. Our team can recommend optimal materials based on your specific usage patterns.": "きれいな木材を時々使用する場合には、炭素鋼が最適です。",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece,\n            eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing,\n            metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also\n            provides superior stability and precision for high-tonnage applications.": "4 コラム油圧プレスには 4 つのガイド ポストが備わっており、ワークピース全体に均一な力の分散を保証し、シングルコラム プレスや C フレーム プレスによく見られるたわみや傾きを排除します。",
  "Frequently Asked Questions": "よくある質問",
  "Get detailed technical specifications, dimensions, and performance data": "詳細な技術仕様、寸法、性能データを入手する",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and\n            the ability to cut thicker materials. They produce minimal material waste and are ideal for\n            applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller\n            footprint, and are better suited for thinner materials.": "ギロチンはさみは、まっすぐ下に降りる垂直の刃の動きを使用するため、より高い精度と厚い材料の切断能力を実現します。",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days\n            depending on tonnage, configuration, and optional features. Rush delivery may be available for certain\n            configurations.": "大型プレス ブレーキは通常、仕様に合わせてカスタム設計されています。",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and\n            operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick\n            concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "頑丈なプレスブレーキは、その重量と操作力が大きいため、鉄筋コンクリート基礎が必要です。",
  "How accurate is the bending process?": "曲げ加工の精度はどの程度ですか?",
  "How accurate is the synchronization between the two machines?": "2 台のマシン間の同期はどの程度正確ですか?",
  "How do I find the right blade size for my chipper?": "チッパーに適したブレードのサイズを見つけるにはどうすればよいですか?",
  "How do I know when blades need replacement?": "ブレードの交換が必要な時期をどうやって知ることができますか?",
  "How do I know when blades need to be replaced or sharpened?": "刃の交換や研ぎの必要性をどうやって知ることができますか?",
  "How do I know when to rotate or replace blades?": "ブレードの回転や交換時期を知るにはどうすればよいですか?",
  "How do I minimize springback in radius bending?": "半径曲げ時のスプリングバックを最小限に抑えるにはどうすればよいですか?",
  "How do I select the correct V-die opening?": "正しい V ダイ開口部を選択するにはどうすればよいですか?",
  "How do I select the correct blade size?": "正しい刃のサイズを選択するにはどうすればよいですか?",
  "How do I select the correct radius for my application?": "アプリケーションに適した半径を選択するにはどうすればよいですか?",
  "How do I select the correct throat depth for my gooseneck punch?": "グースネック パンチの適切なスロートの深さを選択するにはどうすればよいですか?",
  "How do I select the correct tooth pitch for my application?": "アプリケーションに適した歯のピッチを選択するにはどうすればよいですか?",
  "How does the 10-second exchange platform work?": "10 秒交換プラットフォームはどのように機能しますか?",
  "How does the automatic tube feeding system work?": "自動チューブ供給システムはどのように機能しますか?",
  "How does the crowning system work?": "クラウニングシステムはどのように機能しますか?",
  "How long do chipper blades typically last?": "チッパーブレードの寿命は通常どのくらいですか?",
  "How long do crusher blades typically last?": "クラッシャーブレードの寿命は通常どのくらいですか?",
  "How long do rolling shear blades typically last?": "ローリングシャーブレードの寿命は通常どのくらいですか?",
  "How long do shearing machine blades last?": "シャーリングマシンの刃の寿命はどれくらいですか？",
  "How long do toothed blades last?": "歯付き刃の寿命はどのくらいですか?",
  "How long does installation and commissioning take?": "設置と試運転にはどのくらい時間がかかりますか?",
  "How long does it take to program new parts?": "新しい部品をプログラムするにはどのくらい時間がかかりますか?",
  "How long does press brake tooling last?": "プレスブレーキ工具の寿命はどのくらいですか?",
  "How long is the warranty period?": "保証期間はどれくらいですか?",
  "How much faster is a double table machine compared to single table?": "ダブルテーブルマシンはシングルテーブルと比べてどれくらい高速ですか?",
  "How much maintenance does it require?": "どれくらいのメンテナンスが必要ですか?",
  "How often do the blades need to be replaced?": "刃はどれくらいの頻度で交換する必要がありますか?",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and\n            synchronization testing. We provide comprehensive on-site commissioning and operator training.": "設置には通常、マシンの位置決め、ネットワークのセットアップ、校正、同期テストを含めて 2 ～ 3 週間かかります。",
  "Is cutting quality the same in both modes?": "どちらのモードでも切断品質は同じですか?",
  "Is it suitable for beginners?": "初心者にも適していますか？",
  "Is operator training more complex for the integrated machine?": "統合マシンの場合、オペレーターのトレーニングはより複雑ですか?",
  "Is training and installation support provided?": "トレーニングと導入サポートは提供されますか?",
  "Is training provided for operators?": "オペレーター向けのトレーニングは提供されていますか?",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches\n            typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii\n            exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending.\n            Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "達成可能な最大半径は、プレス ブレーキ テーブルの幅とツーリング システムによって異なります。",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap\n            rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part\n            complexity, and current labor costs.": "ほとんどのお客様は、労働力の節約、生産性の向上、スクラップ率の削減、無人シフトの実行機能によって ROI がすぐに得られることを実感しています。",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion),\n            assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables\n            (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power\n            consumption and minimal maintenance requirements.": "運用コストには、電気 (ファイバー レーザーは約 30% の電気光学変換で高効率です)、アシスト ガス (窒素、酸素、または圧縮空気)、冷水器の電気、および場合によっては消耗品 (保護レンズ、ノズル) が含まれます。",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil\n            (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column\n            hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle\n            while consuming minimal energy during fast approach and return strokes.": "運転コストには、油圧ポンプ モーターの電気代 (必要な電力はトン数によって異なります)、作動油 (定期交換)、フィルターの交換、潤滑、および時々のシールの交換が含まれます。",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum,\n            copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "当社の CNC 曲げ機は、軟鋼、ステンレス鋼、アルミニウム、銅、その他の合金を含むさまざまな材料を加工できます。",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency.\n            The CNC system allows precise control of roll positions and automatically calculates the correct settings\n            based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in\n            real-time to maintain consistent quality throughout the operation.": "当社の CNC 制御プレートローリングマシンは、直径の一貫性を維持するための高い曲げ精度を実現します。 ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and\n            12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and titanium.": "当社のファイバー レーザー切断機は、さまざまな厚さの炭素鋼、ステンレス鋼、アルミニウム、12 mm、および最大 8 mm の銅/真鍮を切断できます (厚さはレーザー出力によって異なります)。",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "当社のギロチンシャーリングは、軟鋼、ステンレス鋼、アルミニウム、銅、真鍮などの金属板を含むさまざまな金属材料を加工できます。",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass,\n            plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking,\n            powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based\n            on material type, thickness, and forming operation requirements.": "当社の油圧プレスは、鉄鋼、ステンレス鋼、アルミニウム、銅、真鍮、プラスチック、ゴム、複合材料など幅広い材料に対応します。",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile\n            metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength.\n            Softer materials and those with higher ductility are easier to roll to smaller diameters.": "当社のプレートローリングマシンは、炭素鋼、ステンレス鋼、アルミニウム合金、およびその他の延性金属を加工できます。",
  "Our punching machines can process various thicknesses of carbon steel, stainless steel, aluminum,\n            and copper/brass (thicknesses vary based on machine capacity). Higher tonnage machines can process\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and other sheet metals.": "当社のパンチングマシンは、さまざまな厚さの炭素鋼、ステンレス鋼、アルミニウム、銅/真鍮を加工できます (厚さは機械の能力によって異なります)。",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "当社のローリングシャーブレードは、鋼鉄、ステンレス鋼、アルミニウム、銅、真鍮、プラスチックフィルム、紙、ボール紙、ゴム、フォーム、繊維、複合材料など、幅広い材料を処理します。",
  "Our shearing blades can cut mild steel, stainless steel, aluminum, copper, brass, and other metal alloys. The maximum cutting thickness depends on material hardness and machine capacity. Standard blades handle materials up to 50mm thick in mild steel. For harder materials like stainless steel, specialized blade materials are recommended.": "当社のシャーリングブレードは、軟鋼、ステンレス鋼、アルミニウム、銅、真鍮、その他の合金を切断できます。",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "当社のスイングビームシャーリングマシンは、軟鋼、ステンレス鋼、アルミニウム、銅板、その他の金属板など、さまざまな金属材料を加工できます。",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide\n            comprehensive training for operators and programmers. Most operators become proficient with basic operations\n            within a short training period.": "当社のシステムは、最小限のロボット工学の知識を必要とする直感的なインターフェイスを備えています。",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced\n            sensors continuously monitor and adjust for perfect coordination between both machines.": "当社のタンデム システムは、曲げプロセス全体を通じて優れた同期精度を維持します。",
  "Our tube laser cutting machines can process round, square, rectangular, and oval tubes. Standard capacity\n            ranges from customizable diameter, with optional upgrades available for tubes larger diameter options. The machine\n            can handle tube lengths up to Customizable length (standard) with extended options up to 12000mm. Wall thicknesses depend\n            on laser power and material type.": "当社のチューブレーザー切断機は、円形、正方形、長方形、楕円形のチューブを加工できます。",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling\n            operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our\n            4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing\n            and reinserting the plate, which saves time and improves quality.": "予備曲げは、主な圧延操作の前にプレートの前縁と後縁を曲げるプロセスです。",
  "Q:": "質問:",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear,\n            lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system\n            should be serviced annually with oil changes and filter replacements. With proper maintenance, our\n            machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and\n            training with each machine.": "定期的なメンテナンスには、油圧オイルのレベルと品質のチェック、ロール表面の摩耗の検査、ベアリングと可動部品の潤滑、ロール システムのアライメントの確認が含まれます。",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting\n            hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings,\n            checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper\n            maintenance ensures reliable operation and extends machine lifespan for many years.": "定期的なメンテナンスには、作動油のレベルと品質のチェック (定期的なオイル交換)、油圧ホースと接続部の漏れの検査、フィルターの洗浄または交換、ガイド ポストとリニア ベアリングの潤滑、圧力計と制御バルブのチェックが含まれます。",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine\n            daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide\n            a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "定期的なメンテナンスはシンプルで簡単です。作動油レベルを毎週チェックし、機械を毎日清掃し、スケジュールに従って可動部品に注油し、ブレードの状態を定期的に検査します。",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality,\n            significantly increased productivity, reduced labor costs, enhanced safety by removing operators from\n            hazardous zones, and the ability to automate complex multi-bend sequences.": "ロボットプレスブレーキには、年中無休の無人操作、安定した品質、生産性の大幅な向上、人件費の削減、オペレーターを危険区域から排除することによる安全性の向上、複雑な複数の曲げシーケンスを自動化する機能など、大きな利点があります。",
  "Signs include increased burring, rough cut edges, visible nicks or chips in the cutting edge, increased cutting force required, or material deformation. When these occur, rotate the blade to use a fresh edge. Replace when all four edges show significant wear. Regular visual inspection after every shift helps maintain optimal cutting quality.": "兆候には、バリの増加、切断エッジの粗さ、刃先に目に見える傷や欠け、必要な切削力の増加、または材料の変形が含まれます。",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "兆候としては、粒子サイズの増加、不均一な造粒、消費電力の増加、過度の騒音、目に見えるブレードの損傷や丸み、スループットの低下などが挙げられます。 ",
  "Signs include larger chip sizes, increased power consumption, excessive fines or dust, visible edge rounding or nicks, and increased feeding force required. Inspect blades every 50-100 operating hours for wear. Replace or sharpen when cutting edge shows significant rounding or if nicks exceed 3mm depth. Rotating blade positions during inspection helps ensure even wear across all cutting edges.": "兆候としては、チップ サイズの拡大、消費電力の増加、過剰な微粉や塵、目に見えるエッジの丸みや傷、必要な送り力の増加などが挙げられます。 ",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "シングルテーブルレーザー切断機には 1 つの固定作業テーブルがあり、低生産量から中生産量に適したより経済的なソリューションを提供します。",
  "Single table punching machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "シングルテーブルパンチングマシンには 1 つの固定作業テーブルがあり、低生産量から中生産量に適したより経済的なソリューションを提供します。",
  "SmartCut AI is our intelligent control system that automatically optimizes cutting parameters in real-time.\n            It analyzes tube geometry, material characteristics, and wall thickness to adjust laser power, cutting\n            speed,\n            and focal position. This reduces material waste by up to 18%, improves edge quality, and minimizes operator\n            skill requirements. The system also includes automatic nesting software to maximize material utilization.": "SmartCut AI は、リアルタイムで切断パラメータを自動的に最適化する当社のインテリジェントな制御システムです。",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "歯付きブレードのデザインの中には、再研磨できるものもあれば、交換用に設計されているものもあります。",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback:\n            use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom\n            bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening\n            to reduce stress, and consider coining for zero springback applications. Material-specific springback\n            tables help predict and compensate for springback in production.": "スプリングバックは材料の硬度とともに増加し、曲げ半径が大きくなるほど減少します。",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications\n            or higher power configurations may require 45-60 days. We provide regular production updates and coordinate\n            logistics to ensure smooth delivery and installation.": "標準構成のマシンは通常、注文確認後 30 ～ 45 日以内に出荷されます。",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage\n            machines or custom specifications may require additional time due to larger component manufacturing requirements.\n            We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "標準構成のマシンは通常、注文確認後、妥当な期間内に出荷されます。",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations\n            may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your\n            order and keep you updated throughout the manufacturing process.": "標準構成は通常、注文確認から 30 ～ 45 日以内に発送されます。",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days.\n            We'll provide a specific timeline when you place your order.": "標準構成は通常 30 ～ 45 日以内に出荷されます。",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching\n            hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to\n            prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless\n            steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface\n            hardness while maintaining core toughness.": "標準グースネックパンチは、焼き入れ硬度 HRC 47±2 の T10A、42CrMo、または Cr12MoV 合金鋼から製造されています。",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us\n            for specific delivery timelines.": "標準モデルは通常 20 ～ 30 日以内に発送されます。",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear\n            resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials\n            (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness\n            extends tool life but requires careful handling to avoid chipping.": "標準的なプレス ブレーキ ツールの硬度は通常 HRC 45 ～ 52 で、亀裂を防ぐ靭性を維持しながら優れた耐摩耗性を実現します。",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "標準サイズのブレードは通常 7 ～ 10 営業日以内に発送されます。",
  "Still have questions?": "まだ質問がありますか?",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like\n            a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials.\n            Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher\n            precision.": "スイングビームシャーは、円弧状の切断動作を備えた振り子アーム設計を採用しており、設置面積が小さく、安定性が高く、作業速度が速いなどの利点があります。",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations\n            can be designed for various length requirements based on your specific applications.": "タンデム構成では、標準的な単一マシンの処理能力をはるかに超える非常に長いワークピースを処理できます。",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses\n            CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting\n            the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "自動クラウニング システムは、テーブルの曲率を調整することでフレームのたわみを補正します。 ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life.\n            Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions,\n            blades can last for tens of thousands of cuts before requiring rotation or replacement.": "ブレードは 4 つの使用可能な刃先を備えて設計されており、耐用年数が大幅に延長されます。",
  "The bundle feeder system can hold up to 1800kg of raw tube stock arranged in bundles. Tubes are\n            automatically separated and fed one by one into the four-chuck clamping system. The system is programmable\n            for different tube sizes and can operate continuously without manual intervention. This dramatically\n            increases productivity by eliminating manual loading time and allowing operators to focus on other tasks.": "バンドルフィーダーシステムは、最大 1800kg の生チューブストックを束に配置して保持できます。",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the\n            desired mode (plate or tube) on the control panel, and the machine automatically releases the current\n            platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and\n            installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "交換プラットフォームには、正確な位置決めを備えた自動クイックチェンジ システムが使用されています。",
  "The fiber laser tube cutter can process carbon steel, stainless steel, aluminum, copper, brass, and titanium\n            tubes. Maximum cutting thickness varies by material: carbon steel up to 8mm, stainless steel up to 6mm,\n            aluminum up to 5mm (thicknesses depend on laser power). The machine handles both coated and uncoated tubes,\n            including galvanized and powder-coated materials.": "ファイバーレーザーチューブカッターは、炭素鋼、ステンレス鋼、アルミニウム、銅、真鍮、チタンのチューブを加工できます。",
  "The four-chuck clamping system provides superior stability compared to three-chuck systems. It minimizes\n            vibration during cutting, prevents tube displacement, and ensures consistent positioning accuracy of\n            High precision.\n            This is especially important for thin-walled tubes and complex cutting patterns. The pneumatic system allows\n            for quick tube changes while maintaining precise clamping force across different tube sizes.": "4 チャッククランプシステムは 3 チャックシステムと比較して優れた安定性を提供します。",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example,\n            2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents\n            cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider\n            die openings.": "一般的なルールは、材料の厚さの 8 倍の V ダイ開口部を使用することです (8T ルール)。",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines.\n            Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it\n            ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and\n            dust extractors, which are shared between both modes.": "統合された機械は、別個のプレートアンドチューブ機械よりも約 50% 少ない床面積を必要とします。",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines.\n            Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility\n            expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most\n            customers see ROI within 18-24 months compared to buying two separate systems.": "統合された機械は通常、プレートとチューブの切断機械を個別に購入するよりもコストが 30 ～ 40% 低くなります。",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air\n            bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch\n            tip radius to the natural internal radius created by the die opening for consistent angles. Consider\n            material springback (stainless steel requires 1-2° compensation). Consult our technical team with your\n            material specifications for optimal radius selection.": "応力集中を防ぐために、パンチ半径は材料の厚さの少なくとも 63% である必要があります。",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines\n            automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both\n            controllers.": "このシステムには、包括的なエラー処理が含まれています。",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine\n            maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press\n            brake maintenance. We provide remote diagnostics and support.": "このシステムには、問題が発生する前に警告を発する予知メンテナンス機能が含まれています。",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal\n            alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "トーションシンクロプレスブレーキは、軟鋼、ステンレス鋼、アルミニウム、その他の一般的な合金を加工できます。",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from\n            the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels\n            formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part\n            drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and\n            face width for your application.": "スロートの深さは、形成する必要があるリターン フランジの長さによって決定する必要があります。",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality\n            heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials\n            reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection\n            maximize longevity. Worn tooling can be reground to restore performance.": "工具寿命は、曲げられる材料、曲げの頻度、適用トン数、およびメンテナンスによって異なります。",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "歯ピッチの選択は、希望する引裂強度と穿孔の品質によって異なります。",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "歯付きブレードは、紙、ボール紙、プラスチックフィルム、ラミネート、フォイル、織物、および特殊素材に穴を開けることができます。",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more\n            economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than\n            electro-hydraulic systems, it's more reliable and requires less maintenance.": "トーションシンクロは、機械式トーションバーを使用してラムの動きを同期させるため、油圧システムや電気油圧システムよりもシンプルで経済的です。",
  "Training is actually simplified because operators learn one control system for both functions. The interface\n            is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient\n            in both modes within 3-5 days of training. The unified control system means operators don't need to learn\n            two different machines, reducing the overall training burden.": "オペレータは両方の機能に対して 1 つの制御システムを学習するため、トレーニングは実際に簡素化されます。",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking\n            is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative\n            metalwork, and any application where surface quality is critical. Steel dies are preferred for higher\n            production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane\n            combines both benefits.": "表面マーキングが許容できない、仕上げ済み、塗装済み、または研磨済みの材料を曲げる場合は、ウレタン ダイスを使用します。",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and\n            occasional inspection of the torsion bar are typically all that's needed. The mechanical design is\n            inherently reliable.": "最小限のメンテナンスが必要です。",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty\n            options are available. Lifetime technical support is included with all machines.": "すべての主要コンポーネントとシステムをカバーする包括的な 2 年間の保証を提供します。",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization\n            system. Extended warranty packages and dedicated support programs are available.": "当社は、同期システムを含むすべての主要コンポーネントをカバーする包括的な 2 年間の保証を提供します。",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This\n            includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended\n            warranty packages and preventive maintenance programs are available.": "当社は、すべての主要コンポーネントをカバーする大型機械に対して、包括的な 3 年間の保証を提供します。",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are\n            available. Technical support is provided for the life of the machine.": "すべての主要コンポーネントをカバーする標準 1 年間保証を提供します。",
  "What are the cost savings compared to buying two separate machines?": "2 台の別々のマシンを購入する場合と比較して、どれくらいのコスト削減になりますか?",
  "What are the main advantages of a robotic press brake?": "ロボットプレスブレーキの主な利点は何ですか?",
  "What are the operating costs?": "運営費はいくらですか?",
  "What blade material offers the best value?": "最高の価値を提供するブレードの材質は何ですか?",
  "What blade material should I choose for my application?": "自分の用途にはどのようなブレード材質を選択すればよいですか?",
  "What does \"scimitar\" mean in press brake tooling?": "プレスブレーキ工具における「シミター」とは何を意味しますか?",
  "What foundation requirements are needed?": "どのような基礎要件が必要ですか?",
  "What happens if one machine encounters an error?": "1 台のマシンでエラーが発生した場合はどうなりますか?",
  "What hardness should press brake tooling have?": "プレスブレーキ工具の硬度はどのくらいですか?",
  "What information do I need to provide for a custom blade quote?": "カスタムブレードの見積もりにはどのような情報を提供する必要がありますか?",
  "What is SmartCut AI and how does it improve cutting?": "SmartCut AI とは何ですか?また、どのように切断を改善しますか?",
  "What is pre-bending and why is it important?": "プリベンディングとは何ですか?なぜ重要ですか?",
  "What is the ROI for a robotic press brake system?": "ロボットプレスブレーキシステムの ROI はどれくらいですか?",
  "What is the advantage of a four-column hydraulic press over other press types?": "他のタイプのプレスと比較した 4 コラム油圧プレスの利点は何ですか?",
  "What is the advantage of the four-chuck clamping system?": "4チャッククランプシステムの利点は何ですか?",
  "What is the difference between 3-roll and 4-roll plate rolling machines?": "3ロールプレート圧延機と4ロールプレート圧延機の違いは何ですか?",
  "What is the difference between a gooseneck punch and a standard punch?": "グースネックパンチと通常のパンチの違いは何ですか？",
  "What is the difference between bump forming and radius tooling?": "バンプ形成とラジアスツーリングの違いは何ですか?",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "電気油圧プレスブレーキと油圧プレスブレーキの違いは何ですか?",
  "What is the difference between guillotine and swing beam shears?": "ギロチンハサミとスイングビームハサミの違いは何ですか?",
  "What is the difference between single table and dual table laser cutting machines?": "シングルテーブルレーザー切断機とデュアルテーブルレーザー切断機の違いは何ですか?",
  "What is the difference between single table and dual table punching machines?": "シングルテーブルパンチングマシンとデュアルテーブルパンチングマシンの違いは何ですか?",
  "What is the difference between swing beam and guillotine shears?": "スイングビームとギロチンハサミの違いは何ですか?",
  "What is the difference between torsion-synchro and hydraulic synchronization?": "トーションシンクロと油圧シンクロの違いは何ですか?",
  "What is the expected delivery time?": "配達予定時間はどれくらいですか?",
  "What is the maximum radius I can achieve on a press brake?": "プレスブレーキで達成できる最大半径はどれくらいですか?",
  "What is the maximum workpiece length a tandem system can handle?": "タンデムシステムで扱えるワークの最大長はどれくらいですか?",
  "What is the typical delivery time?": "通常の納期はどれくらいですか?",
  "What is the typical lead time for custom blades?": "カスタムブレードの一般的なリードタイムはどれくらいですか?",
  "What is the typical lead time for delivery?": "配達までの通常のリードタイムはどれくらいですか?",
  "What is the typical lead time?": "一般的なリードタイムはどれくらいですか?",
  "What is the warranty coverage?": "保証範囲は何ですか?",
  "What maintenance does a fiber laser require?": "ファイバーレーザーにはどのようなメンテナンスが必要ですか?",
  "What maintenance does a hydraulic press require?": "油圧プレスにはどのようなメンテナンスが必要ですか?",
  "What maintenance is required?": "どのようなメンテナンスが必要ですか?",
  "What material is best for press brake tooling?": "プレスブレーキ工具に最適な材質は何ですか?",
  "What materials and applications are suitable for four-column hydraulic presses?": "4列油圧プレスに適した材質や用途は何ですか?",
  "What materials and hardness should gooseneck punches have?": "グースネックパンチの材質と硬さはどのようなものでしょうか？",
  "What materials and thicknesses can be cut?": "切断可能な材質と厚さは何ですか?",
  "What materials and thicknesses can be rolled?": "圧延可能な材質と厚さは何ですか?",
  "What materials can be bent with this machine?": "この機械で曲げられる材料は何ですか?",
  "What materials can be cut with the tube laser?": "チューブレーザーで切断できる材料は何ですか?",
  "What materials can be cut with these blades?": "この刃で切れる素材は何ですか?",
  "What materials can be cut with this machine?": "この機械で切断できる材料は何ですか?",
  "What materials can these blades cut?": "これらの刃はどのような材料を切断できますか?",
  "What materials can toothed blades perforate?": "歯付きブレードはどのような材料に穴を開けることができますか?",
  "What maximum material thickness can heavy-duty press brakes handle?": "大型プレスブレーキで扱える材料の最大厚さはどれくらいですか?",
  "What space is required for installation?": "設置にはどのくらいのスペースが必要ですか？",
  "What tube shapes and sizes can the machine cut?": "この機械はどのようなチューブの形状とサイズを切断できますか?",
  "What warranty and support is provided?": "どのような保証とサポートが提供されますか?",
  "What warranty is included?": "どのような保証が含まれていますか?",
  "What's the difference between European and American tooling standards?": "ヨーロッパとアメリカの工具規格の違いは何ですか?",
  "When should I use urethane dies instead of steel?": "スチール金型の代わりにウレタン金型を使用する必要があるのはどのような場合ですか?",
  "Which blade type should I choose for my application?": "自分の用途にはどのブレードタイプを選択すればよいですか?",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly\n            without interrupting production. The AI system also learns from each bending operation to\n            optimize future programs automatically.": "当社の高度なオフライン プログラミング ソフトウェアと 3D シミュレーションを使用すると、生産を中断することなく新しい部品を迅速にプログラムできます。",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending\n            operations where deep relief clearance is required. These combine the interference-free benefits of\n            gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed\n            by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming\n            tooling.": "はい、鋭角グースネック パンチ (30°、45°、60°) は、深い逃げクリアランスが必要なヘミング加工や鋭角曲げ加工用に特別に設計されています。",
  "Yes, chipper blades can be professionally sharpened multiple times before replacement. Most blades can be resharpened 3-6 times depending on wear severity and original blade thickness. Professional sharpening services restore proper bevel angle and edge geometry. Regular sharpening before severe dulling occurs maximizes total blade life and maintains optimal chip quality. We offer sharpening services with quick turnaround.": "はい、チッパーのブレードは交換前に専門家によって複数回研ぐことができます。",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "はい、すべてのブレードの注文には、適切なブレードの位置合わせ、ギャップ調整、トルク仕様を含む包括的な取り付け手順が提供されます。",
  "Yes, comprehensive installation instructions, torque specifications, and maintenance guidelines are provided with blade orders. We offer technical support for proper blade installation, adjustment, and troubleshooting. Safety information and best practices documentation are included. Our technical team is available to answer questions about blade installation, sharpening schedules, and performance optimization for your specific application.": "はい、ブレードの注文には、包括的な取り付け手順、トルク仕様、およびメンテナンスのガイドラインが提供されます。",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "はい、すべてのブレードの注文には包括的な技術サポートが含まれています。",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head,\n            and control system for both applications. The CNC system automatically optimizes parameters for each mode.\n            Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across\n            all operations.": "はい、どちらのモードでも切断品質は同じです。",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively\n            giving you two separate press brakes when tandem operation is not needed.": "はい、各機械は標準長さのワークピースに対して独立した動作モードに切り替えることができ、タンデム動作が必要ない場合には 2 つの別々のプレス ブレーキを効果的に提供できます。",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature\n            oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation.\n            Regular maintenance schedules should be followed to ensure optimal performance.": "はい、頑丈なプレス ブレーキは、継続的な工業生産向けに特別に設計されています。",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "はい、ほとんどのクラッシャーブレードは、摩耗の度合いとブレードの設計に応じて、専門的に2〜4回研ぎ直すことができます。",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The\n            adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts\n            bending parameters for different materials including steel, stainless steel, and aluminum.": "はい、当社のロボット システムは柔軟性が高く、幅広いシート サイズや素材を処理できます。",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "はい、当社のローリングシャーブレードは複数回の再研磨サイクル向けに設計されています。",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller\n            and straightforward operation make it easy to learn compared to more complex CNC systems.": "はい、トーションシンクロプレスブレーキは基礎訓練を受けたオペレーターに最適です。",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within\n            24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "はい、当社はスペアパーツと消耗品の包括的な在庫を維持しています。",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "はい、カスタム アプリケーション向けにサンプル ブレードの製造およびテスト サービスを提供しています。",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will\n            ensure your machine is properly set up and your operators are fully trained to use it efficiently and\n            safely.": "はい、完全な設置サービスと包括的なオペレータートレーニングを提供します。",
  "Yes, we provide comprehensive installation guidelines, blade gap adjustment procedures, and setup recommendations with every blade order. Our technical support team is available to assist with installation questions, troubleshooting, and optimization. On-site installation services are available for large orders or complex applications.": "はい、ブレードの注文ごとに、包括的な取り付けガイドライン、ブレードギャップ調整手順、セットアップに関する推奨事項を提供します。",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team\n            will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting.\n            Training materials and operation manuals are also provided.": "はい、設置サービスの一環として、包括的なオペレータートレーニングを提供しています。",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator\n            training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization,\n            basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "はい、オンサイトでの設置、機械の試運転、オペレーターのトレーニング (通常 3 ～ 5 日) を含む包括的なサポートを提供します。",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance,\n            and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment,\n            safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "はい、当社はオンサイト設置、機械の試運転、基礎要件のガイダンス、オペレーターのトレーニングを含む包括的なサポートを提供します。",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius\n            dimensions, material specifications, production volume, and part drawings. Our engineering team will\n            design custom arc molds optimized for your specific application. Custom tooling is particularly\n            cost-effective for high-volume production runs requiring consistent radius specifications not available\n            in standard tooling catalogs.": "はい、当社は独自の用途向けのカスタム半径ツールを専門としています。",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings,\n            material specifications, and bend requirements. Our engineering team will design custom dies for U-channels,\n            Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results\n            for high-volume production runs.": "はい、当社は独自の曲げ用途向けのカスタム ツールを専門としています。",
  "Yes, with the optional bevel cutting head upgrade, our tube laser can cut various bevel angles for pipe\n            welding preparation. The system can create V-grooves, K-grooves, and other weld joint configurations at\n            precise angles. This eliminates the need for secondary beveling operations and ensures perfect fit-up for\n            welding. The SmartCut AI system automatically calculates optimal cutting paths for complex bevel geometries.": "はい、オプションのベベル切断ヘッドのアップグレードにより、当社のチューブレーザーはパイプ溶接の準備のためにさまざまなベベル角度を切断できます。",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting\n            the roll positions to create a gradual taper. The CNC system calculates the required roll positions for\n            the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and\n            conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "はい、オプションのコニカルローリングアタッチメントを使用すると、当社の機械はロール位置を調整して緩やかなテーパーを作成することにより、円錐形状を生成できます。 "
}