{
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar\n            sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel\n            formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both\n            deep relief clearance and offset capability for the most challenging box and channel forming operations.": "«Ятаган» или «сабля» относится к смещенной изогнутой конструкции профиля, похожей на изогнутое лезвие ятагана. ",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the\n            leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and\n            efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They\n            produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision\n            work and thick plate rolling.": "Трехвалковые станки более экономичны и подходят для общего применения, но требуют предварительного изгиба передней кромки отдельно и могут оставить более длинные прямые кромки. ",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing\n            flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to\n            form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing\n            the punch from hitting previously formed flanges, making them essential for box forming, door frames,\n            and channel bending applications.": "Пуансон на гибкой шейке имеет конструкцию с глубоким рельефом (смещенный профиль), который обеспечивает зазор для существующих фланцев и геометрий глубокой коробки. ",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day.\n            Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to\n            switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production\n            orders without significant downtime.": "Абсолютно! ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications.\n            Provide part drawings showing flange dimensions, bend angles, material specifications, and production\n            volume. Our engineering team will design custom gooseneck tooling optimized for your specific application,\n            including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom\n            tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "Абсолютно. ",
  "Are spare parts readily available?": "Доступны ли запасные части?",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "Срок службы лезвия зависит от разрезаемого материала, скорости резки и методов технического обслуживания. ",
  "Blade life depends on material being cut, thickness, frequency of use, and maintenance. With four usable edges, our blades can last 4 times longer than single-edge blades. Typical service life ranges from tens of thousands to hundreds of thousands of cuts. Proper blade gap adjustment and regular rotation extend blade life significantly.": "Срок службы лезвия зависит от разрезаемого материала, толщины, частоты использования и технического обслуживания. ",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "Срок службы лезвия зависит от типа материала, скорости дробилки и материала лезвия. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "Срок службы лезвия значительно варьируется в зависимости от обрабатываемого материала, скорости производства и конструкции зубьев. ",
  "Blade life varies significantly based on wood type, material diameter, presence of dirt/rocks, and maintenance practices. In clean wood applications, chromium steel blades typically last 150-300 hours of continuous operation. Carbide-inlay blades can last 800-1200 hours when avoiding metal contaminants. Proper blade maintenance, rotation, and avoiding dirt-contaminated wood maximize blade life.": "Срок службы лезвия значительно варьируется в зависимости от типа древесины, диаметра материала, наличия грязи/камней и методов технического обслуживания. ",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "Выбор лезвия зависит от характеристик вашей машины, типа материала и требований к резке. ",
  "Blades with minor wear can sometimes be professionally re-ground to restore cutting performance. However, deep nicks, cracks, or severe wear typically require replacement. Re-grinding reduces blade dimensions and may affect machine blade gap settings. We offer professional blade inspection services to determine if re-grinding is cost-effective for your situation.": "Лезвия с незначительным износом иногда можно профессионально заточить, чтобы восстановить производительность резки. ",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through\n            multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling\n            uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump\n            forming is cost-effective for occasional large radius work, while dedicated radius tooling provides\n            superior surface finish and faster production for regular radius bending applications.": "Для формирования рельефа используются стандартные V-образные штампы и пуансоны с программным управлением ЧПУ для создания дуг большого радиуса посредством множества небольших постепенных изгибов (аппроксимация дуги линейными сегментами). ",
  "Can I process both plates and tubes in the same production run?": "Могу ли я обрабатывать как пластины, так и трубки в одном производственном цикле?",
  "Can chipper blades be sharpened and reused?": "Можно ли заточить и использовать повторно лезвия измельчителя?",
  "Can crusher blades be sharpened and reused?": "Можно ли заточить и использовать повторно лезвия дробилки?",
  "Can damaged blades be repaired or re-sharpened?": "Можно ли отремонтировать или заточить поврежденные лезвия?",
  "Can gooseneck punches be used for hemming operations?": "Можно ли использовать пуансоны для подшивки?",
  "Can the machine cut bevels for pipe welding?": "Может ли машина резать фаски для сварки труб?",
  "Can the machine roll conical shapes?": "Может ли машина раскатывать конические формы?",
  "Can the machines operate independently?": "Могут ли машины работать независимо?",
  "Can the system handle different sheet sizes and materials?": "Может ли система обрабатывать листы разных размеров и материалов?",
  "Can these blades be re-sharpened?": "Можно ли затачивать эти лезвия?",
  "Can these machines run 24/7?": "Могут ли эти машины работать круглосуточно?",
  "Can toothed blades be re-sharpened?": "Можно ли затачивать зубчатые лезвия?",
  "Can you manufacture custom profile dies?": "Можете ли вы изготовить штампы с индивидуальным профилем?",
  "Can you manufacture custom radius profiles?": "Можете ли вы изготовить профили радиуса по индивидуальному заказу?",
  "Check your chipper's operator manual for blade specifications including length, width, thickness, and bolt hole pattern. Measure existing blades if manual is unavailable. Provide chipper brand and model number - we maintain specifications for most major brands (Vermeer, Bandit, Morbark, etc.). Send us photos or measurements of existing blades for confirmation. We can cross-reference and provide exact replacement blades.": "Ознакомьтесь с руководством по эксплуатации вашего измельчителя, чтобы узнать характеристики лезвия, включая длину, ширину, толщину и расположение отверстий для болтов. ",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength,\n            wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium\n            HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production\n            volume, material being bent, and required tool life.": "Хромомолибденовая сталь (42CrMo, Cr12MoV) является отраслевым стандартом, обеспечивающим исключительную прочность, износостойкость и защиту от коррозии. ",
  "Common questions about our": "Частые вопросы о нашем",
  "Contact our support team": "Свяжитесь с нашей службой поддержки",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick,\n            stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage,\n            working length, and material properties.": "В зависимости от тоннажа и типа материала, листогибочные прессы для тяжелых условий эксплуатации могут сгибать мягкую сталь толщиной до 50 мм, нержавеющую сталь до 30 мм и алюминий до 40 мм. ",
  "Do I need special skills to operate a robotic system?": "Нужны ли мне специальные навыки для работы с роботизированной системой?",
  "Do you manufacture custom gooseneck profiles?": "Вы производите профили «гусиная шея» по индивидуальному заказу?",
  "Do you offer sample testing before production orders?": "Предлагаете ли вы тестирование образцов перед производственными заказами?",
  "Do you offer technical support and installation guidance?": "Предлагаете ли вы техническую поддержку и рекомендации по установке?",
  "Do you provide installation and maintenance guidance?": "Предоставляете ли вы рекомендации по установке и техническому обслуживанию?",
  "Do you provide installation and setup guidance?": "Предоставляете ли вы рекомендации по установке и настройке?",
  "Do you provide installation and setup support?": "Предоставляете ли вы поддержку по установке и настройке?",
  "Do you provide installation and training?": "Предоставляете ли вы установку и обучение?",
  "Double table machines typically achieve 40-50% higher productivity than single table machines. The automatic\n            table exchange takes only rapid, and while one table is cutting, the operator can load/unload the other\n            table simultaneously. This eliminates material loading downtime and enables continuous 24/7 operation, making\n            it ideal for high-volume production environments.": "Машины с двойным столом обычно обеспечивают производительность на 40-50% выше, чем машины с одним столом. ",
  "Download PDF": "Скачать PDF",
  "Download Technical Brochure": "Загрузить техническую брошюру",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between\n            cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also\n            consume less energy and provide faster response times.": "В электрогидравлических листогибочных прессах используется электронная система управления для точной синхронизации между цилиндрами, обеспечивающая лучшую точность и повторяемость по сравнению с традиционными гидравлическими системами. ",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized\n            clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical\n            or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American\n            systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "В европейской оснастке (системы Wila, Amada, Trumpf) используется сегментированный быстросменный инструмент со стандартизированными системами зажима для быстрой установки. ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning\n            protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction\n            filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser\n            gas refills or mirror alignments are needed.": "Волоконные лазеры практически не требуют обслуживания по сравнению с CO2-лазерами. ",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "Плоские лезвия лучше всего подходят для тонкостенных продуктов (менее 3 мм), таких как бутылки и пленки, обеспечивая более высокую производительность. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "Для получения точного индивидуального предложения укажите: внешний диаметр лезвия, внутренний диаметр (размер отверстия), толщину ступицы, желаемый шаг зубьев, тип профиля зуба, если известен, обрабатываемый материал, толщину материала, скорость производства и любые особые требования. ",
  "For general mild steel cutting, Cr12MoV or 6CrW2Si provides excellent performance and value. For stainless steel and harder materials, consider high-speed steel (HSS) or tungsten carbide. For high-volume production, premium materials offer better long-term cost-effectiveness despite higher initial cost. Our technical team can recommend optimal materials based on your specific application.": "Для общей резки мягкой стали Cr12MoV или 6CrW2Si обеспечивают превосходную производительность и ценность. ",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "Для нерегулярного использования или работы с мягкими пластиками хорошо подойдет высокоуглеродистая сталь. ",
  "For occasional use with clean wood, carbon steel offers good value. For professional/commercial operations, chromium steel (8%+ Cr) provides the best balance of performance and cost. For high-volume production or abrasive applications, consider premium tool steels. Carbide-inlay blades are recommended for maximum productivity in continuous operations despite higher initial cost. Our team can recommend optimal materials based on your specific usage patterns.": "Для периодического использования с чистой древесиной углеродистая сталь предлагает хорошее соотношение цены и качества. ",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece,\n            eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing,\n            metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also\n            provides superior stability and precision for high-tonnage applications.": "Четырехколонные гидравлические прессы оснащены четырьмя направляющими стойками, которые обеспечивают равномерное распределение усилия по всей заготовке, устраняя прогибы и наклоны, характерные для одноколонных прессов или прессов с С-образной рамой. ",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Get detailed technical specifications, dimensions, and performance data": "Получите подробные технические характеристики, размеры и данные о производительности.",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and\n            the ability to cut thicker materials. They produce minimal material waste and are ideal for\n            applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller\n            footprint, and are better suited for thinner materials.": "Гильотинные ножницы используют вертикальное движение лезвия, которое опускается прямо вниз, обеспечивая более высокую точность и возможность резать более толстые материалы. ",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days\n            depending on tonnage, configuration, and optional features. Rush delivery may be available for certain\n            configurations.": "Листогибочные прессы для тяжелых условий эксплуатации обычно изготавливаются по индивидуальному заказу в соответствии со спецификациями. ",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and\n            operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick\n            concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "Гибочные прессы для тяжелых условий эксплуатации требуют железобетонных фундаментов из-за их значительного веса и эксплуатационных усилий. ",
  "How accurate is the bending process?": "Насколько точен процесс гибки?",
  "How accurate is the synchronization between the two machines?": "Насколько точна синхронизация между двумя машинами?",
  "How do I find the right blade size for my chipper?": "Как подобрать лезвие подходящего размера для измельчителя?",
  "How do I know when blades need replacement?": "Как узнать, что лезвия нуждаются в замене?",
  "How do I know when blades need to be replaced or sharpened?": "Как узнать, что лезвия необходимо заменить или заточить?",
  "How do I know when to rotate or replace blades?": "Как узнать, когда следует повернуть или заменить лезвия?",
  "How do I minimize springback in radius bending?": "Как минимизировать упругую отдачу при радиусном изгибе?",
  "How do I select the correct V-die opening?": "Как выбрать правильное отверстие V-образной матрицы?",
  "How do I select the correct blade size?": "Как выбрать правильный размер лезвия?",
  "How do I select the correct radius for my application?": "Как выбрать правильный радиус для моего применения?",
  "How do I select the correct throat depth for my gooseneck punch?": "Как выбрать правильную глубину горла для ударника «гусиная шея»?",
  "How do I select the correct tooth pitch for my application?": "Как выбрать правильный шаг зубьев для моего применения?",
  "How does the 10-second exchange platform work?": "Как работает платформа обмена «10 секунд»?",
  "How does the automatic tube feeding system work?": "Как работает автоматическая система кормления через зонд?",
  "How does the crowning system work?": "Как работает система коронации?",
  "How long do chipper blades typically last?": "Как долго обычно служат лезвия измельчителя?",
  "How long do crusher blades typically last?": "Как долго обычно служат лезвия дробилки?",
  "How long do rolling shear blades typically last?": "Как долго обычно служат прокатные ножи?",
  "How long do shearing machine blades last?": "Как долго служат лезвия ножниц?",
  "How long do toothed blades last?": "Как долго служат зубчатые лезвия?",
  "How long does installation and commissioning take?": "Сколько времени занимает монтаж и пуско-наладка?",
  "How long does it take to program new parts?": "Сколько времени занимает программирование новых деталей?",
  "How long does press brake tooling last?": "Как долго служат гибочные инструменты?",
  "How long is the warranty period?": "Каков срок гарантии?",
  "How much faster is a double table machine compared to single table?": "Насколько быстрее машина с двумя столами по сравнению с машиной с одним столом?",
  "How much maintenance does it require?": "Сколько он требует обслуживания?",
  "How often do the blades need to be replaced?": "Как часто необходимо менять лезвия?",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and\n            synchronization testing. We provide comprehensive on-site commissioning and operator training.": "Установка обычно занимает 2–3 недели, включая позиционирование машины, настройку сети, калибровку и тестирование синхронизации. ",
  "Is cutting quality the same in both modes?": "Качество резки одинаковое в обоих режимах?",
  "Is it suitable for beginners?": "Подходит ли он для новичков?",
  "Is operator training more complex for the integrated machine?": "Является ли обучение операторов интегрированной машины более сложным?",
  "Is training and installation support provided?": "Предоставляется ли обучение и поддержка при установке?",
  "Is training provided for operators?": "Проводится ли обучение операторов?",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches\n            typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii\n            exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending.\n            Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "Максимально достижимый радиус зависит от ширины листогибочного стола и системы инструментов. ",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap\n            rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part\n            complexity, and current labor costs.": "Большинство клиентов быстро видят окупаемость инвестиций за счет экономии трудозатрат, повышения производительности, снижения процента брака и возможности работать в беспилотные смены. ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion),\n            assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables\n            (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power\n            consumption and minimal maintenance requirements.": "Эксплуатационные затраты включают электроэнергию (волоконные лазеры высокоэффективны с электрооптическим преобразованием ~30%), вспомогательный газ (азот, кислород или сжатый воздух), электроэнергию для водяного охлаждения и периодические расходные материалы (защитные линзы, насадки). ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil\n            (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column\n            hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle\n            while consuming minimal energy during fast approach and return strokes.": "Эксплуатационные расходы включают электроэнергию для двигателя гидравлического насоса (требования к мощности зависят от тоннажа), гидравлическое масло (периодическая замена), замену фильтров, смазку и периодическую замену уплотнений. ",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum,\n            copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Наши гибочные станки с ЧПУ могут обрабатывать различные материалы, включая мягкую сталь, нержавеющую сталь, алюминий, медь и другие металлические сплавы. ",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency.\n            The CNC system allows precise control of roll positions and automatically calculates the correct settings\n            based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in\n            real-time to maintain consistent quality throughout the operation.": "Наши листопрокатные станки с ЧПУ обеспечивают высокую точность гибки и постоянство диаметра. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and\n            12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and titanium.": "Наши станки для резки волоконным лазером могут резать углеродистую сталь, нержавеющую сталь, алюминий толщиной до 12 мм, а также медь/латунь толщиной до 8 мм (толщина варьируется в зависимости от мощности лазера). ",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "Наши гильотинные ножницы могут обрабатывать различные металлические материалы, включая мягкую сталь, нержавеющую сталь, алюминий, медь, латунь и другие металлические листы. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass,\n            plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking,\n            powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based\n            on material type, thickness, and forming operation requirements.": "Наши гидравлические прессы обрабатывают широкий спектр материалов, включая сталь, нержавеющую сталь, алюминий, медь, латунь, пластик, резину и композитные материалы. ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile\n            metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength.\n            Softer materials and those with higher ductility are easier to roll to smaller diameters.": "Наши листопрокатные станки могут обрабатывать углеродистую сталь, нержавеющую сталь, алюминиевые сплавы и другие пластичные металлы. ",
  "Our punching machines can process various thicknesses of carbon steel, stainless steel, aluminum,\n            and copper/brass (thicknesses vary based on machine capacity). Higher tonnage machines can process\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and other sheet metals.": "Наши штамповочные станки могут обрабатывать углеродистую сталь, нержавеющую сталь, алюминий и медь/латунь различной толщины (толщина варьируется в зависимости от мощности станка). ",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "Наши роликовые ножницы работают с широким спектром материалов, включая сталь, нержавеющую сталь, алюминий, медь, латунь, пластиковую пленку, бумагу, картон, резину, пенопласт, текстиль и композитные материалы. ",
  "Our shearing blades can cut mild steel, stainless steel, aluminum, copper, brass, and other metal alloys. The maximum cutting thickness depends on material hardness and machine capacity. Standard blades handle materials up to 50mm thick in mild steel. For harder materials like stainless steel, specialized blade materials are recommended.": "Наши режущие лезвия могут резать мягкую сталь, нержавеющую сталь, алюминий, медь, латунь и другие металлические сплавы. ",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "Наши ножницы с поворотной балкой могут обрабатывать различные металлические материалы, включая мягкую сталь, нержавеющую сталь, алюминий, медные пластины и другие металлические листы. ",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide\n            comprehensive training for operators and programmers. Most operators become proficient with basic operations\n            within a short training period.": "Наша система имеет интуитивно понятный интерфейс, требующий минимальных знаний в области робототехники. ",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced\n            sensors continuously monitor and adjust for perfect coordination between both machines.": "Наши тандемные системы обеспечивают исключительную точность синхронизации на протяжении всего процесса гибки. ",
  "Our tube laser cutting machines can process round, square, rectangular, and oval tubes. Standard capacity\n            ranges from customizable diameter, with optional upgrades available for tubes larger diameter options. The machine\n            can handle tube lengths up to Customizable length (standard) with extended options up to 12000mm. Wall thicknesses depend\n            on laser power and material type.": "Наши станки для лазерной резки труб могут обрабатывать круглые, квадратные, прямоугольные и овальные трубы. ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling\n            operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our\n            4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing\n            and reinserting the plate, which saves time and improves quality.": "Предварительная гибка — это процесс гибки передней и задней кромок листа перед основной операцией прокатки. ",
  "Q:": "Вопрос:",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear,\n            lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system\n            should be serviced annually with oil changes and filter replacements. With proper maintenance, our\n            machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and\n            training with each machine.": "Регулярное техническое обслуживание включает проверку уровня и качества гидравлического масла, проверку поверхностей валков на предмет износа, смазку подшипников и движущихся частей, а также проверку центровки системы валков. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting\n            hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings,\n            checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper\n            maintenance ensures reliable operation and extends machine lifespan for many years.": "Регулярное техническое обслуживание включает: проверку уровня и качества гидравлического масла (периодическая замена масла), проверку гидравлических шлангов и соединений на предмет утечек, очистку или замену фильтров, смазку направляющих стоек и линейных подшипников, проверку манометров и регулирующих клапанов. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine\n            daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide\n            a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "Регулярное техническое обслуживание простое и понятное: еженедельно проверяйте уровень гидравлического масла, ежедневно очищайте машину, смазывайте движущиеся части в соответствии с графиком и регулярно проверяйте состояние ножей. ",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality,\n            significantly increased productivity, reduced labor costs, enhanced safety by removing operators from\n            hazardous zones, and the ability to automate complex multi-bend sequences.": "Роботизированные листогибочные прессы обладают значительными преимуществами, включая круглосуточную работу без участия человека, стабильное качество, значительное повышение производительности, снижение затрат на рабочую силу, повышение безопасности за счет удаления операторов из опасных зон и возможность автоматизации сложных последовательностей с несколькими изгибами.",
  "Signs include increased burring, rough cut edges, visible nicks or chips in the cutting edge, increased cutting force required, or material deformation. When these occur, rotate the blade to use a fresh edge. Replace when all four edges show significant wear. Regular visual inspection after every shift helps maintain optimal cutting quality.": "Признаки включают повышенные заусенцы, неровные кромки среза, видимые зазубрины или сколы на режущей кромке, повышенную требуемую силу резания или деформацию материала. ",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "Признаки включают увеличенный размер частиц, неравномерное гранулирование, повышенное энергопотребление, чрезмерный шум, видимые повреждения или закругления лезвий, а также снижение производительности. ",
  "Signs include larger chip sizes, increased power consumption, excessive fines or dust, visible edge rounding or nicks, and increased feeding force required. Inspect blades every 50-100 operating hours for wear. Replace or sharpen when cutting edge shows significant rounding or if nicks exceed 3mm depth. Rotating blade positions during inspection helps ensure even wear across all cutting edges.": "Признаки включают больший размер стружки, повышенное энергопотребление, чрезмерное количество мелких частиц или пыли, видимые закругления кромок или зазубрины, а также повышенное усилие подачи. ",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "Станки для лазерной резки с одним столом имеют один фиксированный рабочий стол, что является более экономичным решением, подходящим для небольших и средних объемов производства. ",
  "Single table punching machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "Вырубные машины с одним столом имеют один фиксированный рабочий стол, что является более экономичным решением, подходящим для небольших и средних объемов производства. ",
  "SmartCut AI is our intelligent control system that automatically optimizes cutting parameters in real-time.\n            It analyzes tube geometry, material characteristics, and wall thickness to adjust laser power, cutting\n            speed,\n            and focal position. This reduces material waste by up to 18%, improves edge quality, and minimizes operator\n            skill requirements. The system also includes automatic nesting software to maximize material utilization.": "SmartCut AI — это наша интеллектуальная система управления, которая автоматически оптимизирует параметры резки в режиме реального времени. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "Некоторые конструкции зубчатых лезвий можно затачивать повторно, а другие предназначены для замены. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback:\n            use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom\n            bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening\n            to reduce stress, and consider coining for zero springback applications. Material-specific springback\n            tables help predict and compensate for springback in production.": "Упругость увеличивается с увеличением твердости материала и уменьшается с увеличением радиуса изгиба. ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications\n            or higher power configurations may require 45-60 days. We provide regular production updates and coordinate\n            logistics to ensure smooth delivery and installation.": "Машины стандартной конфигурации обычно отправляются в течение 30–45 дней после подтверждения заказа. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage\n            machines or custom specifications may require additional time due to larger component manufacturing requirements.\n            We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Машины стандартной конфигурации обычно поставляются в течение разумного периода времени после подтверждения заказа. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations\n            may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your\n            order and keep you updated throughout the manufacturing process.": "Стандартные конфигурации обычно доставляются в течение 30–45 дней с момента подтверждения заказа. ",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days.\n            We'll provide a specific timeline when you place your order.": "Стандартные конфигурации обычно доставляются в течение 30–45 дней. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching\n            hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to\n            prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless\n            steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface\n            hardness while maintaining core toughness.": "Стандартные пуансоны на гибкой шейке изготавливаются из легированной стали Т10А, 42CrMo или Cr12MoV с твердостью закалки HRC 47±2. ",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us\n            for specific delivery timelines.": "Стандартные модели обычно доставляются в течение 20-30 дней. ",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear\n            resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials\n            (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness\n            extends tool life but requires careful handling to avoid chipping.": "Стандартный листогибочный пресс обычно имеет твердость 45–52 HRC, что обеспечивает превосходную износостойкость, сохраняя при этом прочность и предотвращая растрескивание. ",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "Лезвия стандартного размера обычно доставляются в течение 7–10 рабочих дней. ",
  "Still have questions?": "Остались вопросы?",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like\n            a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials.\n            Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher\n            precision.": "В ножницах с поворотной балкой используется конструкция маятникового рычага с дугообразным режущим движением, что дает такие преимущества, как меньшая занимаемая площадь, хорошая устойчивость и высокая рабочая скорость. ",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations\n            can be designed for various length requirements based on your specific applications.": "Тандемные конфигурации позволяют обрабатывать сверхдлинные детали, значительно превышающие стандартную производительность одного станка. ",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses\n            CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting\n            the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "Автоматическая система выравнивания компенсирует прогиб рамы, регулируя кривизну стола. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life.\n            Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions,\n            blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Лезвия имеют четыре полезные режущие кромки, что значительно продлевает срок их службы. ",
  "The bundle feeder system can hold up to 1800kg of raw tube stock arranged in bundles. Tubes are\n            automatically separated and fed one by one into the four-chuck clamping system. The system is programmable\n            for different tube sizes and can operate continuously without manual intervention. This dramatically\n            increases productivity by eliminating manual loading time and allowing operators to focus on other tasks.": "Система подачи пачек может вмещать до 1800 кг необработанных труб, уложенных в пачки. ",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the\n            desired mode (plate or tube) on the control panel, and the machine automatically releases the current\n            platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and\n            installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "Платформа обмена использует автоматизированную систему быстрой смены с точным позиционированием. ",
  "The fiber laser tube cutter can process carbon steel, stainless steel, aluminum, copper, brass, and titanium\n            tubes. Maximum cutting thickness varies by material: carbon steel up to 8mm, stainless steel up to 6mm,\n            aluminum up to 5mm (thicknesses depend on laser power). The machine handles both coated and uncoated tubes,\n            including galvanized and powder-coated materials.": "Волоконный лазерный труборез может обрабатывать трубы из углеродистой стали, нержавеющей стали, алюминия, меди, латуни и титана. ",
  "The four-chuck clamping system provides superior stability compared to three-chuck systems. It minimizes\n            vibration during cutting, prevents tube displacement, and ensures consistent positioning accuracy of\n            High precision.\n            This is especially important for thin-walled tubes and complex cutting patterns. The pneumatic system allows\n            for quick tube changes while maintaining precise clamping force across different tube sizes.": "Система зажима с четырьмя патронами обеспечивает превосходную стабильность по сравнению с системами с тремя патронами. ",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example,\n            2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents\n            cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider\n            die openings.": "Общее правило заключается в использовании V-образного отверстия, размер которого в 8 раз превышает толщину материала (правило 8T). ",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines.\n            Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it\n            ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and\n            dust extractors, which are shared between both modes.": "Интегрированная машина требует примерно на 50% меньше площади, чем отдельные машины для производства пластин и труб. ",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines.\n            Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility\n            expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most\n            customers see ROI within 18-24 months compared to buying two separate systems.": "Интегрированный станок обычно стоит на 30-40% дешевле, чем покупка отдельных станков для резки листов и труб. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air\n            bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch\n            tip radius to the natural internal radius created by the die opening for consistent angles. Consider\n            material springback (stainless steel requires 1-2° compensation). Consult our technical team with your\n            material specifications for optimal radius selection.": "Радиус пуансона должен составлять не менее 63% толщины материала, чтобы предотвратить концентрацию напряжений. ",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines\n            automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both\n            controllers.": "Система включает комплексную обработку ошибок. ",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine\n            maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press\n            brake maintenance. We provide remote diagnostics and support.": "Система включает возможности профилактического обслуживания, которые предупреждают вас о возникновении проблем. ",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal\n            alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "Торсионно-синхронный листогибочный пресс может обрабатывать мягкую сталь, нержавеющую сталь, алюминий и другие распространенные металлические сплавы. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from\n            the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels\n            formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part\n            drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and\n            face width for your application.": "Глубина горловины должна определяться длиной возвратного фланца, который вам необходимо сформировать. ",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality\n            heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials\n            reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection\n            maximize longevity. Worn tooling can be reground to restore performance.": "Срок службы инструмента зависит от сгибаемого материала, частоты изгиба, применяемого тоннажа и технического обслуживания. ",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "Выбор шага зубьев зависит от желаемой прочности на разрыв и качества перфорации. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "Зубчатые лезвия могут перфорировать бумагу, картон, пластиковую пленку, ламинат, фольгу, текстиль и специальные материалы. ",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more\n            economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than\n            electro-hydraulic systems, it's more reliable and requires less maintenance.": "Торсион-синхронизатор использует механический торсион для синхронизации движения плунжера, что делает его более простым и экономичным, чем гидравлические или электрогидравлические системы. ",
  "Training is actually simplified because operators learn one control system for both functions. The interface\n            is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient\n            in both modes within 3-5 days of training. The unified control system means operators don't need to learn\n            two different machines, reducing the overall training burden.": "Обучение фактически упрощается, поскольку операторы изучают одну систему управления для обеих функций. ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking\n            is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative\n            metalwork, and any application where surface quality is critical. Steel dies are preferred for higher\n            production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane\n            combines both benefits.": "Используйте уретановые матрицы при гибке предварительно обработанных, окрашенных или полированных материалов, где маркировка поверхности недопустима. ",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and\n            occasional inspection of the torsion bar are typically all that's needed. The mechanical design is\n            inherently reliable.": "Требует минимального обслуживания. ",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty\n            options are available. Lifetime technical support is included with all machines.": "Мы предлагаем комплексную 2-летнюю гарантию на все основные компоненты и системы. ",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization\n            system. Extended warranty packages and dedicated support programs are available.": "Мы предоставляем комплексную двухлетнюю гарантию на все основные компоненты, включая систему синхронизации. ",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This\n            includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended\n            warranty packages and preventive maintenance programs are available.": "Мы предоставляем комплексную трехлетнюю гарантию на машины для тяжелых условий эксплуатации, охватывающую все основные компоненты. ",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are\n            available. Technical support is provided for the life of the machine.": "Мы предоставляем стандартную гарантию сроком 1 год на все основные компоненты. ",
  "What are the cost savings compared to buying two separate machines?": "Какова экономия средств по сравнению с покупкой двух отдельных машин?",
  "What are the main advantages of a robotic press brake?": "Каковы основные преимущества роботизированного листогибочного пресса?",
  "What are the operating costs?": "Каковы эксплуатационные расходы?",
  "What blade material offers the best value?": "Какой материал лезвия предлагает наилучшее соотношение цены и качества?",
  "What blade material should I choose for my application?": "Какой материал лезвия мне следует выбрать для своего применения?",
  "What does \"scimitar\" mean in press brake tooling?": "Что означает «ятаган» в инструментах листогибочного пресса?",
  "What foundation requirements are needed?": "Какие требования к фундаменту необходимы?",
  "What happens if one machine encounters an error?": "Что произойдет, если на одной машине возникнет ошибка?",
  "What hardness should press brake tooling have?": "Какую твердость должен иметь инструмент для листогибочного пресса?",
  "What information do I need to provide for a custom blade quote?": "Какую информацию мне нужно предоставить для расчета стоимости индивидуального лезвия?",
  "What is SmartCut AI and how does it improve cutting?": "Что такое SmartCut AI и как он улучшает резку?",
  "What is pre-bending and why is it important?": "Что такое предварительная гибка и почему это важно?",
  "What is the ROI for a robotic press brake system?": "Какова рентабельность инвестиций в роботизированную систему листогибочного пресса?",
  "What is the advantage of a four-column hydraulic press over other press types?": "В чем преимущество четырехколонного гидравлического пресса перед другими типами прессов?",
  "What is the advantage of the four-chuck clamping system?": "В чем преимущество системы зажима с четырьмя патронами?",
  "What is the difference between 3-roll and 4-roll plate rolling machines?": "В чем разница между 3-валковыми и 4-валковыми листопрокатными машинами?",
  "What is the difference between a gooseneck punch and a standard punch?": "В чем разница между пуансоном и стандартным пуансоном?",
  "What is the difference between bump forming and radius tooling?": "В чем разница между формированием выпуклостей и радиусной оснасткой?",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "В чем разница между электрогидравлическими и гидравлическими листогибочными прессами?",
  "What is the difference between guillotine and swing beam shears?": "В чем разница между гильотинными ножницами и ножницами с поворотной балкой?",
  "What is the difference between single table and dual table laser cutting machines?": "В чем разница между одностоловыми и двухстоловыми станками для лазерной резки?",
  "What is the difference between single table and dual table punching machines?": "В чем разница между штамповочными станками с одним и двумя столами?",
  "What is the difference between swing beam and guillotine shears?": "В чем разница между поворотной балкой и гильотинными ножницами?",
  "What is the difference between torsion-synchro and hydraulic synchronization?": "В чем разница между торсионным синхронизатором и гидросинхронизатором?",
  "What is the expected delivery time?": "Каково ожидаемое время доставки?",
  "What is the maximum radius I can achieve on a press brake?": "Какого максимального радиуса я могу достичь на листогибочном прессе?",
  "What is the maximum workpiece length a tandem system can handle?": "Какую максимальную длину заготовки может обрабатывать тандемная система?",
  "What is the typical delivery time?": "Каков типичный срок доставки?",
  "What is the typical lead time for custom blades?": "Каков типичный срок изготовления нестандартных лезвий?",
  "What is the typical lead time for delivery?": "Каков типичный срок доставки?",
  "What is the typical lead time?": "Каково типичное время выполнения?",
  "What is the warranty coverage?": "Какова гарантия?",
  "What maintenance does a fiber laser require?": "Какое обслуживание требует волоконный лазер?",
  "What maintenance does a hydraulic press require?": "Какое обслуживание требует гидравлический пресс?",
  "What maintenance is required?": "Какое обслуживание требуется?",
  "What material is best for press brake tooling?": "Какой материал лучше всего подходит для изготовления гибочных инструментов?",
  "What materials and applications are suitable for four-column hydraulic presses?": "Какие материалы и области применения подходят для четырехколонных гидравлических прессов?",
  "What materials and hardness should gooseneck punches have?": "Какие материалы и твердость должны быть у пуансонов с гибкой шеей?",
  "What materials and thicknesses can be cut?": "Какие материалы и толщины можно резать?",
  "What materials and thicknesses can be rolled?": "Какие материалы и толщины можно прокатывать?",
  "What materials can be bent with this machine?": "Какие материалы можно гнуть на этом станке?",
  "What materials can be cut with the tube laser?": "Какие материалы можно резать трубочным лазером?",
  "What materials can be cut with these blades?": "Какие материалы можно резать этими лезвиями?",
  "What materials can be cut with this machine?": "Какие материалы можно резать на этом станке?",
  "What materials can these blades cut?": "Какие материалы можно резать этими лезвиями?",
  "What materials can toothed blades perforate?": "Какие материалы можно перфорировать зубчатыми лезвиями?",
  "What maximum material thickness can heavy-duty press brakes handle?": "Какую максимальную толщину материала могут обрабатывать листогибочные прессы для тяжелых условий эксплуатации?",
  "What space is required for installation?": "Какое место требуется для установки?",
  "What tube shapes and sizes can the machine cut?": "Какие формы и размеры труб может разрезать станок?",
  "What warranty and support is provided?": "Какая гарантия и поддержка предоставляется?",
  "What warranty is included?": "Какая гарантия включена?",
  "What's the difference between European and American tooling standards?": "В чем разница между европейскими и американскими стандартами инструментов?",
  "When should I use urethane dies instead of steel?": "Когда следует использовать уретановые штампы вместо стальных?",
  "Which blade type should I choose for my application?": "Какой тип лезвия мне следует выбрать для своего применения?",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly\n            without interrupting production. The AI system also learns from each bending operation to\n            optimize future programs automatically.": "Благодаря нашему передовому программному обеспечению для автономного программирования и 3D-моделированию новые детали можно программировать быстро, не останавливая производство. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending\n            operations where deep relief clearance is required. These combine the interference-free benefits of\n            gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed\n            by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming\n            tooling.": "Да, пуансоны с острым углом (30°, 45°, 60°) специально разработаны для операций подшивки и острой гибки, где требуется глубокий рельефный зазор. ",
  "Yes, chipper blades can be professionally sharpened multiple times before replacement. Most blades can be resharpened 3-6 times depending on wear severity and original blade thickness. Professional sharpening services restore proper bevel angle and edge geometry. Regular sharpening before severe dulling occurs maximizes total blade life and maintains optimal chip quality. We offer sharpening services with quick turnaround.": "Да, лезвия измельчителя можно несколько раз заточить перед заменой. ",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "Да, ко всем заказам на лезвия прилагаются подробные инструкции по установке, включая правильное выравнивание лезвия, регулировку зазора и характеристики крутящего момента. ",
  "Yes, comprehensive installation instructions, torque specifications, and maintenance guidelines are provided with blade orders. We offer technical support for proper blade installation, adjustment, and troubleshooting. Safety information and best practices documentation are included. Our technical team is available to answer questions about blade installation, sharpening schedules, and performance optimization for your specific application.": "Да, подробные инструкции по установке, характеристики крутящего момента и рекомендации по техническому обслуживанию прилагаются к заказам на лезвия. ",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "Да, комплексная техническая поддержка включена во все заказы на лезвия. ",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head,\n            and control system for both applications. The CNC system automatically optimizes parameters for each mode.\n            Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across\n            all operations.": "Да, качество резки одинаковое в обоих режимах. ",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively\n            giving you two separate press brakes when tandem operation is not needed.": "Да, каждый станок можно переключить в независимый режим работы для заготовок стандартной длины, что фактически дает вам два отдельных листогибочных пресса, когда тандемная работа не требуется.",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature\n            oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation.\n            Regular maintenance schedules should be followed to ensure optimal performance.": "Да, листогибочные прессы для тяжелых условий эксплуатации специально разработаны для непрерывного промышленного производства. ",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "Да, большинство лезвий дробилок можно профессионально заточить 2–4 раза в зависимости от степени износа и конструкции лезвия. ",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The\n            adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts\n            bending parameters for different materials including steel, stainless steel, and aluminum.": "Да, наша роботизированная система отличается высокой гибкостью и может обрабатывать листы самых разных размеров и материалов. ",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "Да, наши роликовые ножницы рассчитаны на несколько циклов заточки. ",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller\n            and straightforward operation make it easy to learn compared to more complex CNC systems.": "Да, торсионно-синхронный листогибочный пресс идеально подходит для операторов с базовой подготовкой. ",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within\n            24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Да, у нас имеется полный склад запасных частей и расходных материалов. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "Да, мы предлагаем услуги по изготовлению и тестированию образцов лезвий для индивидуальных применений. ",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will\n            ensure your machine is properly set up and your operators are fully trained to use it efficiently and\n            safely.": "Да, мы предоставляем полный комплекс услуг по установке и всестороннее обучение операторов. ",
  "Yes, we provide comprehensive installation guidelines, blade gap adjustment procedures, and setup recommendations with every blade order. Our technical support team is available to assist with installation questions, troubleshooting, and optimization. On-site installation services are available for large orders or complex applications.": "Да, мы предоставляем подробные инструкции по установке, процедуры регулировки зазора между лезвиями и рекомендации по настройке при каждом заказе лезвия. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team\n            will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting.\n            Training materials and operation manuals are also provided.": "Да, мы обеспечиваем комплексное обучение операторов в рамках наших услуг по установке. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator\n            training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization,\n            basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Да, мы предоставляем комплексную поддержку, включая установку на месте, ввод машины в эксплуатацию и обучение операторов (обычно 3–5 дней). ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance,\n            and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment,\n            safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "Да, мы предоставляем комплексную поддержку, включая установку на месте, ввод в эксплуатацию машины, рекомендации по фундаментальным требованиям и обучение операторов. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius\n            dimensions, material specifications, production volume, and part drawings. Our engineering team will\n            design custom arc molds optimized for your specific application. Custom tooling is particularly\n            cost-effective for high-volume production runs requiring consistent radius specifications not available\n            in standard tooling catalogs.": "Да, мы специализируемся на инструментах нестандартного радиуса для уникальных применений. ",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings,\n            material specifications, and bend requirements. Our engineering team will design custom dies for U-channels,\n            Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results\n            for high-volume production runs.": "Да, мы специализируемся на изготовлении специального инструмента для уникальных задач гибки. ",
  "Yes, with the optional bevel cutting head upgrade, our tube laser can cut various bevel angles for pipe\n            welding preparation. The system can create V-grooves, K-grooves, and other weld joint configurations at\n            precise angles. This eliminates the need for secondary beveling operations and ensures perfect fit-up for\n            welding. The SmartCut AI system automatically calculates optimal cutting paths for complex bevel geometries.": "Да, благодаря дополнительной модернизации головки для резки фасок наш трубчатый лазер может резать фаски под разными углами для подготовки труб к сварке. ",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting\n            the roll positions to create a gradual taper. The CNC system calculates the required roll positions for\n            the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and\n            conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "Да, с помощью дополнительного приспособления для конической прокатки наши машины могут производить конические формы, регулируя положение валков для создания постепенного сужения. "
}