{
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar\n            sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel\n            formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both\n            deep relief clearance and offset capability for the most challenging box and channel forming operations.": "يشير \"السيف\" أو \"السيف\" إلى تصميم جانبي منحني متوازن يشبه النصل المنحني للسيف السيف. ",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the\n            leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and\n            efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They\n            produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision\n            work and thick plate rolling.": "تعد الماكينات ثلاثية الأسطوانات أكثر اقتصادًا ومناسبة للتطبيقات العامة، ولكنها تتطلب ثني الحافة الأمامية بشكل منفصل وقد تترك حواف مستقيمة أطول. ",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing\n            flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to\n            form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing\n            the punch from hitting previously formed flanges, making them essential for box forming, door frames,\n            and channel bending applications.": "تتميز المثقاب المعقوفة بتصميم بارز للغاية (ملف تعريف الإزاحة) يوفر خلوصًا للفلنجات الموجودة وهندسة الصندوق العميق. ",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day.\n            Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to\n            switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production\n            orders without significant downtime.": "قطعاً! ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications.\n            Provide part drawings showing flange dimensions, bend angles, material specifications, and production\n            volume. Our engineering team will design custom gooseneck tooling optimized for your specific application,\n            including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom\n            tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "قطعاً. ",
  "Are spare parts readily available?": "هل قطع الغيار متوفرة بسهولة؟",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "يعتمد عمر الشفرة على المواد التي يتم قطعها، وسرعة القطع، وممارسات الصيانة. ",
  "Blade life depends on material being cut, thickness, frequency of use, and maintenance. With four usable edges, our blades can last 4 times longer than single-edge blades. Typical service life ranges from tens of thousands to hundreds of thousands of cuts. Proper blade gap adjustment and regular rotation extend blade life significantly.": "يعتمد عمر الشفرة على المادة التي يتم قطعها، والسمك، وتكرار الاستخدام، والصيانة. ",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "يعتمد عمر الشفرة على نوع المادة وسرعة الكسارة ومادة الشفرة. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "يختلف عمر الشفرة بشكل كبير بناءً على المواد المعالجة وسرعة الإنتاج وتصميم الأسنان. ",
  "Blade life varies significantly based on wood type, material diameter, presence of dirt/rocks, and maintenance practices. In clean wood applications, chromium steel blades typically last 150-300 hours of continuous operation. Carbide-inlay blades can last 800-1200 hours when avoiding metal contaminants. Proper blade maintenance, rotation, and avoiding dirt-contaminated wood maximize blade life.": "يختلف عمر الشفرة بشكل كبير بناءً على نوع الخشب وقطر المادة ووجود الأوساخ/الصخور وممارسات الصيانة. ",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "يعتمد اختيار الشفرة على مواصفات جهازك ونوع المادة ومتطلبات القطع. ",
  "Blades with minor wear can sometimes be professionally re-ground to restore cutting performance. However, deep nicks, cracks, or severe wear typically require replacement. Re-grinding reduces blade dimensions and may affect machine blade gap settings. We offer professional blade inspection services to determine if re-grinding is cost-effective for your situation.": "يمكن في بعض الأحيان إعادة تأريض الشفرات ذات التآكل البسيط بشكل احترافي لاستعادة أداء القطع. ",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through\n            multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling\n            uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump\n            forming is cost-effective for occasional large radius work, while dedicated radius tooling provides\n            superior surface finish and faster production for regular radius bending applications.": "يستخدم تشكيل النتوء قوالب V واللكمات القياسية مع برمجة CNC لإنشاء أقواس نصف قطرها كبيرة من خلال الانحناءات الإضافية الصغيرة المتعددة (تقريب القوس بمقاطع خطية). ",
  "Can I process both plates and tubes in the same production run?": "هل يمكنني معالجة كل من الألواح والأنابيب في نفس عملية الإنتاج؟",
  "Can chipper blades be sharpened and reused?": "هل يمكن شحذ شفرات التقطيع وإعادة استخدامها؟",
  "Can crusher blades be sharpened and reused?": "هل يمكن شحذ شفرات الكسارة وإعادة استخدامها؟",
  "Can damaged blades be repaired or re-sharpened?": "هل يمكن إصلاح الشفرات التالفة أو إعادة شحذها؟",
  "Can gooseneck punches be used for hemming operations?": "هل يمكن استخدام اللكمات المعقوفة في عمليات التحزيم؟",
  "Can the machine cut bevels for pipe welding?": "هل يمكن للآلة قطع الحواف لحام الأنابيب؟",
  "Can the machine roll conical shapes?": "هل تستطيع الآلة لف الأشكال المخروطية؟",
  "Can the machines operate independently?": "هل يمكن للآلات أن تعمل بشكل مستقل؟",
  "Can the system handle different sheet sizes and materials?": "هل يستطيع النظام التعامل مع أحجام الصفائح والمواد المختلفة؟",
  "Can these blades be re-sharpened?": "هل يمكن إعادة شحذ هذه الشفرات؟",
  "Can these machines run 24/7?": "هل يمكن لهذه الآلات أن تعمل 24/7؟",
  "Can toothed blades be re-sharpened?": "هل يمكن إعادة شحذ الشفرات المسننة؟",
  "Can you manufacture custom profile dies?": "هل يمكنك تصنيع قوالب التشكيل الجانبي المخصصة؟",
  "Can you manufacture custom radius profiles?": "هل يمكنك تصنيع ملفات تعريف نصف قطرها مخصصة؟",
  "Check your chipper's operator manual for blade specifications including length, width, thickness, and bolt hole pattern. Measure existing blades if manual is unavailable. Provide chipper brand and model number - we maintain specifications for most major brands (Vermeer, Bandit, Morbark, etc.). Send us photos or measurements of existing blades for confirmation. We can cross-reference and provide exact replacement blades.": "تحقق من دليل مشغل ماكينة التقطيع الخاصة بك لمعرفة مواصفات الشفرة بما في ذلك الطول والعرض والسمك ونمط فتحة الترباس. ",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength,\n            wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium\n            HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production\n            volume, material being bent, and required tool life.": "يعتبر فولاذ الموليبدينوم الكروم (42CrMo، Cr12MoV) هو معيار الصناعة، حيث يوفر قوة استثنائية، ومقاومة التآكل، وحماية من التآكل. ",
  "Common questions about our": "الأسئلة الشائعة حول لدينا",
  "Contact our support team": "اتصل بفريق الدعم لدينا",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick,\n            stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage,\n            working length, and material properties.": "اعتمادًا على الحمولة ونوع المادة، يمكن أن تعمل مكابح الضغط للخدمة الشاقة على ثني الفولاذ الطري الذي يصل سمكه إلى 50 مم، والفولاذ المقاوم للصدأ حتى 30 مم، والألومنيوم حتى 40 مم. ",
  "Do I need special skills to operate a robotic system?": "هل أحتاج إلى مهارات خاصة لتشغيل النظام الآلي؟",
  "Do you manufacture custom gooseneck profiles?": "هل تقوم بتصنيع ملفات تعريف معقوفة مخصصة؟",
  "Do you offer sample testing before production orders?": "هل تقدمون اختبار العينة قبل أوامر الإنتاج؟",
  "Do you offer technical support and installation guidance?": "هل تقدمون الدعم الفني وإرشادات التثبيت؟",
  "Do you provide installation and maintenance guidance?": "هل تقدمون إرشادات التثبيت والصيانة؟",
  "Do you provide installation and setup guidance?": "هل تقدمون إرشادات التثبيت والإعداد؟",
  "Do you provide installation and setup support?": "هل تقدمون دعم التثبيت والإعداد؟",
  "Do you provide installation and training?": "هل توفرون التركيب والتدريب؟",
  "Double table machines typically achieve 40-50% higher productivity than single table machines. The automatic\n            table exchange takes only rapid, and while one table is cutting, the operator can load/unload the other\n            table simultaneously. This eliminates material loading downtime and enables continuous 24/7 operation, making\n            it ideal for high-volume production environments.": "تحقق آلات الطاولة المزدوجة عادةً إنتاجية أعلى بنسبة 40-50% من آلات الطاولة الفردية. ",
  "Download PDF": "تحميل قوات الدفاع الشعبي",
  "Download Technical Brochure": "تحميل الكتيب الفني",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between\n            cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also\n            consume less energy and provide faster response times.": "تستخدم مكابح الضغط الكهروهيدروليكية نظام تحكم إلكتروني لتحقيق التزامن الدقيق بين الأسطوانات، مما يوفر دقة وتكرارًا أفضل مقارنة بالأنظمة الهيدروليكية التقليدية. ",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized\n            clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical\n            or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American\n            systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "تستخدم الأدوات الأوروبية (أنظمة Wila وAmada وTrumpf) أدوات مجزأة سريعة التغيير مع أنظمة تثبيت موحدة للإعداد السريع. ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning\n            protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction\n            filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser\n            gas refills or mirror alignments are needed.": "تعتبر ليزرات الألياف خالية من الصيانة تقريبًا مقارنة بليزر ثاني أكسيد الكربون. ",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "تعمل الشفرات المسطحة بشكل أفضل مع المنتجات ذات الجدران الرقيقة (أقل من 3 مم) مثل الزجاجات والأفلام، مما يوفر إنتاجًا أعلى. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "للحصول على عروض أسعار مخصصة دقيقة، قم بتوفير: القطر الخارجي للشفرة، والقطر الداخلي (حجم التجويف)، وسمك المحور، ودرجة السن المطلوبة، ونوع ملف تعريف السن إذا كان معروفًا، والمواد التي تتم معالجتها، وسمك المادة، وسرعة الإنتاج، وأي متطلبات خاصة. ",
  "For general mild steel cutting, Cr12MoV or 6CrW2Si provides excellent performance and value. For stainless steel and harder materials, consider high-speed steel (HSS) or tungsten carbide. For high-volume production, premium materials offer better long-term cost-effectiveness despite higher initial cost. Our technical team can recommend optimal materials based on your specific application.": "بالنسبة لقطع الفولاذ الطري بشكل عام، يوفر Cr12MoV أو 6CrW2Si أداءً وقيمة ممتازين. ",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "للاستخدام العرضي أو البلاستيك الناعم، يوفر الفولاذ عالي الكربون قيمة جيدة. ",
  "For occasional use with clean wood, carbon steel offers good value. For professional/commercial operations, chromium steel (8%+ Cr) provides the best balance of performance and cost. For high-volume production or abrasive applications, consider premium tool steels. Carbide-inlay blades are recommended for maximum productivity in continuous operations despite higher initial cost. Our team can recommend optimal materials based on your specific usage patterns.": "للاستخدام العرضي مع الخشب النظيف، يوفر الفولاذ الكربوني قيمة جيدة. ",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece,\n            eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing,\n            metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also\n            provides superior stability and precision for high-tonnage applications.": "تتميز المكابس الهيدروليكية ذات الأربعة أعمدة بأربعة أعمدة توجيه تضمن التوزيع المتساوي للقوة عبر قطعة العمل بأكملها، مما يمنع الانحراف والإمالة الشائعة في المكابس ذات العمود الواحد أو المكابس ذات الإطار C. ",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Get detailed technical specifications, dimensions, and performance data": "احصل على المواصفات الفنية التفصيلية والأبعاد وبيانات الأداء",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and\n            the ability to cut thicker materials. They produce minimal material waste and are ideal for\n            applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller\n            footprint, and are better suited for thinner materials.": "تستخدم المقصات المقصلة حركة الشفرة العمودية التي تنزل بشكل مستقيم إلى الأسفل، مما يوفر دقة أعلى وقدرة على قطع المواد السميكة. ",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days\n            depending on tonnage, configuration, and optional features. Rush delivery may be available for certain\n            configurations.": "عادةً ما يتم تصميم مكابح الضغط للخدمة الشاقة خصيصًا وفقًا للمواصفات. ",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and\n            operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick\n            concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "تتطلب مكابح الضغط شديدة التحمل أساسات خرسانية مسلحة نظرًا لوزنها الكبير وقوى التشغيل. ",
  "How accurate is the bending process?": "ما مدى دقة عملية الانحناء؟",
  "How accurate is the synchronization between the two machines?": "ما مدى دقة المزامنة بين الجهازين؟",
  "How do I find the right blade size for my chipper?": "كيف يمكنني العثور على حجم الشفرة المناسب لآلة التقطيع الخاصة بي؟",
  "How do I know when blades need replacement?": "كيف أعرف متى تحتاج الشفرات إلى الاستبدال؟",
  "How do I know when blades need to be replaced or sharpened?": "كيف أعرف متى يجب استبدال الشفرات أو شحذها؟",
  "How do I know when to rotate or replace blades?": "كيف أعرف متى يجب تدوير الشفرات أو استبدالها؟",
  "How do I minimize springback in radius bending?": "كيف أقوم بتقليل Springback في انحناء نصف القطر؟",
  "How do I select the correct V-die opening?": "كيف أختار فتحة القالب V الصحيحة؟",
  "How do I select the correct blade size?": "كيف أختار حجم الشفرة الصحيح؟",
  "How do I select the correct radius for my application?": "كيف أختار نصف القطر الصحيح لطلبي؟",
  "How do I select the correct throat depth for my gooseneck punch?": "كيف أختار عمق الحلق الصحيح لكمة معقوفة؟",
  "How do I select the correct tooth pitch for my application?": "كيف أختار درجة الأسنان الصحيحة لتطبيقي؟",
  "How does the 10-second exchange platform work?": "كيف تعمل منصة التبادل لمدة 10 ثواني؟",
  "How does the automatic tube feeding system work?": "كيف يعمل نظام التغذية الأنبوبية الأوتوماتيكي؟",
  "How does the crowning system work?": "كيف يعمل نظام التتويج؟",
  "How long do chipper blades typically last?": "ما المدة التي تدوم فيها شفرات التقطيع عادة؟",
  "How long do crusher blades typically last?": "كم من الوقت تدوم شفرات الكسارة عادةً؟",
  "How long do rolling shear blades typically last?": "ما المدة التي تستغرقها شفرات القص المتداول عادة؟",
  "How long do shearing machine blades last?": "ما المدة التي تدوم فيها شفرات ماكينة القص؟",
  "How long do toothed blades last?": "ما المدة التي تدوم فيها الشفرات المسننة؟",
  "How long does installation and commissioning take?": "كم من الوقت يستغرق التثبيت والتشغيل؟",
  "How long does it take to program new parts?": "كم من الوقت يستغرق برمجة الأجزاء الجديدة؟",
  "How long does press brake tooling last?": "ما المدة التي تدوم فيها أدوات الضغط على الفرامل؟",
  "How long is the warranty period?": "ما هي مدة الضمان؟",
  "How much faster is a double table machine compared to single table?": "ما مدى سرعة آلة الطاولة المزدوجة مقارنة بالطاولة المفردة؟",
  "How much maintenance does it require?": "ما مقدار الصيانة التي تتطلبها؟",
  "How often do the blades need to be replaced?": "كم مرة يجب استبدال الشفرات؟",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and\n            synchronization testing. We provide comprehensive on-site commissioning and operator training.": "يتطلب التثبيت عادةً من 2 إلى 3 أسابيع، بما في ذلك تحديد موضع الجهاز وإعداد الشبكة والمعايرة واختبار المزامنة. ",
  "Is cutting quality the same in both modes?": "هل جودة القطع هي نفسها في كلا الوضعين؟",
  "Is it suitable for beginners?": "هل هي مناسبة للمبتدئين؟",
  "Is operator training more complex for the integrated machine?": "هل تدريب المشغلين أكثر تعقيدًا بالنسبة للآلة المدمجة؟",
  "Is training and installation support provided?": "هل يتم توفير دعم التدريب والتثبيت؟",
  "Is training provided for operators?": "هل يتم توفير التدريب للمشغلين؟",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches\n            typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii\n            exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending.\n            Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "يعتمد الحد الأقصى لنصف القطر الذي يمكن تحقيقه على عرض طاولة فرامل الضغط ونظام الأدوات. ",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap\n            rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part\n            complexity, and current labor costs.": "يرى معظم العملاء عائد الاستثمار بسرعة من خلال توفير العمالة وزيادة الإنتاجية وانخفاض معدلات الخردة والقدرة على تشغيل نوبات عمل غير مأهولة. ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion),\n            assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables\n            (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power\n            consumption and minimal maintenance requirements.": "تشمل تكاليف التشغيل الكهرباء (تتمتع أجهزة ليزر الألياف بكفاءة عالية مع تحويل كهروضوئي بنسبة 30% تقريبًا)، والغاز المساعد (النيتروجين، أو الأكسجين، أو الهواء المضغوط)، وكهرباء مبرد الماء، والمواد الاستهلاكية العرضية (العدسات الواقية، والفوهات). ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil\n            (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column\n            hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle\n            while consuming minimal energy during fast approach and return strokes.": "تشمل تكاليف التشغيل الكهرباء لمحرك المضخة الهيدروليكية (تختلف متطلبات الطاقة حسب الحمولة)، والزيت الهيدروليكي (الاستبدال الدوري)، واستبدال المرشح، والتشحيم، واستبدال السدادات من حين لآخر. ",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum,\n            copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "يمكن لآلات الثني CNC الخاصة بنا معالجة المواد المختلفة بما في ذلك الفولاذ الطري والفولاذ المقاوم للصدأ والألومنيوم والنحاس والسبائك المعدنية الأخرى. ",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency.\n            The CNC system allows precise control of roll positions and automatically calculates the correct settings\n            based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in\n            real-time to maintain consistent quality throughout the operation.": "إن آلات لف الألواح التي يتم التحكم فيها باستخدام الحاسب الآلي لدينا تحقق دقة ثني عالية من أجل تناسق القطر. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and\n            12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and titanium.": "يمكن لآلات القطع بليزر الألياف لدينا قطع سمك مختلف من الفولاذ الكربوني والفولاذ المقاوم للصدأ والألومنيوم و12 مم والنحاس/النحاس الأصفر حتى 8 مم (تختلف السماكات بناءً على قوة الليزر). ",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "يمكن لآلات القص المقصلة الخاصة بنا معالجة المواد المعدنية المختلفة بما في ذلك الفولاذ الطري والفولاذ المقاوم للصدأ والألومنيوم والنحاس والنحاس الأصفر والصفائح المعدنية الأخرى. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass,\n            plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking,\n            powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based\n            on material type, thickness, and forming operation requirements.": "تتعامل مكابسنا الهيدروليكية مع مجموعة واسعة من المواد بما في ذلك الفولاذ والفولاذ المقاوم للصدأ والألومنيوم والنحاس والنحاس والبلاستيك والمطاط والمواد المركبة. ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile\n            metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength.\n            Softer materials and those with higher ductility are easier to roll to smaller diameters.": "يمكن لآلات درفلة الألواح الخاصة بنا معالجة الفولاذ الكربوني، والفولاذ المقاوم للصدأ، وسبائك الألومنيوم، والمعادن المطينة الأخرى. ",
  "Our punching machines can process various thicknesses of carbon steel, stainless steel, aluminum,\n            and copper/brass (thicknesses vary based on machine capacity). Higher tonnage machines can process\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and other sheet metals.": "يمكن لآلات التثقيب الخاصة بنا معالجة سماكات مختلفة من الفولاذ الكربوني، والفولاذ المقاوم للصدأ، والألمنيوم، والنحاس/النحاس الأصفر (تختلف السماكات بناءً على سعة الماكينة). ",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "تتعامل شفرات القص المتداول لدينا مع مجموعة واسعة من المواد بما في ذلك الفولاذ والفولاذ المقاوم للصدأ والألومنيوم والنحاس والنحاس والأفلام البلاستيكية والورق والكرتون والمطاط والرغوة والمنسوجات والمواد المركبة. ",
  "Our shearing blades can cut mild steel, stainless steel, aluminum, copper, brass, and other metal alloys. The maximum cutting thickness depends on material hardness and machine capacity. Standard blades handle materials up to 50mm thick in mild steel. For harder materials like stainless steel, specialized blade materials are recommended.": "يمكن لشفرات القص الخاصة بنا أن تقوم بقطع الفولاذ الطري، والفولاذ المقاوم للصدأ، والألمنيوم، والنحاس، والنحاس الأصفر، والسبائك المعدنية الأخرى. ",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "يمكن لآلات القص ذات العارضة المتأرجحة الخاصة بنا معالجة العديد من المواد المعدنية بما في ذلك الفولاذ الطري والفولاذ المقاوم للصدأ والألمنيوم والألواح النحاسية والصفائح المعدنية الأخرى. ",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide\n            comprehensive training for operators and programmers. Most operators become proficient with basic operations\n            within a short training period.": "يتميز نظامنا بواجهة بديهية تتطلب الحد الأدنى من المعرفة بالروبوتات. ",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced\n            sensors continuously monitor and adjust for perfect coordination between both machines.": "تحافظ أنظمتنا الترادفية على دقة تزامن استثنائية طوال عملية الثني. ",
  "Our tube laser cutting machines can process round, square, rectangular, and oval tubes. Standard capacity\n            ranges from customizable diameter, with optional upgrades available for tubes larger diameter options. The machine\n            can handle tube lengths up to Customizable length (standard) with extended options up to 12000mm. Wall thicknesses depend\n            on laser power and material type.": "يمكن لآلات قطع الأنابيب بالليزر الخاصة بنا معالجة الأنابيب المستديرة والمربعة والمستطيلة والبيضاوية. ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling\n            operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our\n            4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing\n            and reinserting the plate, which saves time and improves quality.": "ما قبل الثني هو عملية ثني الحواف الأمامية والخلفية للوحة قبل عملية الدرفلة الرئيسية. ",
  "Q:": "س:",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear,\n            lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system\n            should be serviced annually with oil changes and filter replacements. With proper maintenance, our\n            machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and\n            training with each machine.": "تتضمن الصيانة الدورية فحص مستويات الزيت الهيدروليكي وجودته، وفحص أسطح اللفائف بحثًا عن التآكل، ومحامل التشحيم والأجزاء المتحركة، والتحقق من محاذاة نظام اللفائف. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting\n            hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings,\n            checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper\n            maintenance ensures reliable operation and extends machine lifespan for many years.": "تشمل الصيانة الدورية: فحص مستويات الزيت الهيدروليكي وجودته (تغيير الزيت بشكل دوري)، وفحص الخراطيم الهيدروليكية والتوصيلات بحثًا عن التسريبات، وتنظيف أو استبدال المرشحات، وأعمدة توجيه التشحيم والمحامل الخطية، وفحص أجهزة قياس الضغط وصمامات التحكم. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine\n            daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide\n            a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "تتميز الصيانة الدورية بالبساطة والوضوح: افحص مستويات الزيت الهيدروليكي أسبوعيًا، ونظف الماكينة يوميًا، وقم بتشحيم الأجزاء المتحركة وفقًا للجدول الزمني، وافحص حالة الشفرة بانتظام. ",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality,\n            significantly increased productivity, reduced labor costs, enhanced safety by removing operators from\n            hazardous zones, and the ability to automate complex multi-bend sequences.": "توفر مكابح الضغط الروبوتية مزايا كبيرة بما في ذلك التشغيل بدون طيار على مدار الساعة طوال أيام الأسبوع، والجودة المتسقة، وزيادة الإنتاجية بشكل كبير، وانخفاض تكاليف العمالة، وتعزيز السلامة عن طريق إخراج المشغلين من المناطق الخطرة، والقدرة على أتمتة التسلسلات المعقدة متعددة الانحناءات.",
  "Signs include increased burring, rough cut edges, visible nicks or chips in the cutting edge, increased cutting force required, or material deformation. When these occur, rotate the blade to use a fresh edge. Replace when all four edges show significant wear. Regular visual inspection after every shift helps maintain optimal cutting quality.": "تشمل العلامات زيادة الحرق، أو حواف القطع الخشنة، أو الشقوق أو الرقائق المرئية في حافة القطع، أو زيادة قوة القطع المطلوبة، أو تشوه المواد. ",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "تشمل العلامات زيادة حجم الجسيمات، والتحبيب غير المتساوي، وارتفاع استهلاك الطاقة، والضوضاء المفرطة، وتلف الشفرة أو تقريبها بشكل واضح، وانخفاض الإنتاجية. ",
  "Signs include larger chip sizes, increased power consumption, excessive fines or dust, visible edge rounding or nicks, and increased feeding force required. Inspect blades every 50-100 operating hours for wear. Replace or sharpen when cutting edge shows significant rounding or if nicks exceed 3mm depth. Rotating blade positions during inspection helps ensure even wear across all cutting edges.": "تتضمن العلامات أحجامًا أكبر للرقائق، وزيادة استهلاك الطاقة، والغرامات أو الغبار المفرط، وتقريب الحواف أو الشقوق المرئية، وزيادة قوة التغذية المطلوبة. ",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "تحتوي آلات القطع بالليزر ذات الطاولة الواحدة على طاولة عمل ثابتة واحدة، مما يوفر حلاً أكثر اقتصاداً ومناسبًا لأحجام الإنتاج المنخفضة إلى المتوسطة. ",
  "Single table punching machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "تحتوي آلات التثقيب ذات الطاولة الواحدة على طاولة عمل ثابتة واحدة، مما يوفر حلاً أكثر اقتصادية ومناسبًا لأحجام الإنتاج المنخفضة إلى المتوسطة. ",
  "SmartCut AI is our intelligent control system that automatically optimizes cutting parameters in real-time.\n            It analyzes tube geometry, material characteristics, and wall thickness to adjust laser power, cutting\n            speed,\n            and focal position. This reduces material waste by up to 18%, improves edge quality, and minimizes operator\n            skill requirements. The system also includes automatic nesting software to maximize material utilization.": "SmartCut AI هو نظام التحكم الذكي لدينا الذي يعمل تلقائيًا على تحسين معلمات القطع في الوقت الفعلي. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "يمكن إعادة شحذ بعض تصميمات الشفرات المسننة، بينما يتم تصميم البعض الآخر للاستبدال. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback:\n            use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom\n            bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening\n            to reduce stress, and consider coining for zero springback applications. Material-specific springback\n            tables help predict and compensate for springback in production.": "يزداد Springback مع صلابة المادة ويتناقص مع نصف قطر الانحناء الأكبر. ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications\n            or higher power configurations may require 45-60 days. We provide regular production updates and coordinate\n            logistics to ensure smooth delivery and installation.": "عادةً ما يتم شحن آلات التكوين القياسية في غضون 30-45 يومًا بعد تأكيد الطلب. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage\n            machines or custom specifications may require additional time due to larger component manufacturing requirements.\n            We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "عادةً ما يتم شحن آلات التكوين القياسية خلال إطار زمني معقول بعد تأكيد الطلب. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations\n            may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your\n            order and keep you updated throughout the manufacturing process.": "يتم شحن التكوينات القياسية عادةً خلال 30-45 يومًا من تأكيد الطلب. ",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days.\n            We'll provide a specific timeline when you place your order.": "يتم شحن التكوينات القياسية عادةً خلال 30-45 يومًا. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching\n            hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to\n            prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless\n            steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface\n            hardness while maintaining core toughness.": "يتم تصنيع اللكمات المعقوفة القياسية من سبائك الفولاذ T10A، 42CrMo، أو Cr12MoV مع صلابة التبريد HRC 47±2. ",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us\n            for specific delivery timelines.": "يتم شحن النماذج القياسية عادةً خلال 20-30 يومًا. ",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear\n            resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials\n            (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness\n            extends tool life but requires careful handling to avoid chipping.": "تتميز أدوات مكابح الضغط القياسية عادةً بصلابة HRC 45-52، والتي توفر مقاومة تآكل ممتازة مع الحفاظ على المتانة لمنع التشقق. ",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "عادةً ما يتم شحن الشفرات ذات الحجم القياسي خلال 7-10 أيام عمل. ",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like\n            a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials.\n            Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher\n            precision.": "تستخدم المقصات ذات العارضة المتأرجحة تصميم ذراع البندول مع حركة القطع على شكل قوس، مما يوفر مزايا مثل مساحة أصغر، واستقرار جيد، وسرعة عمل سريعة. ",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations\n            can be designed for various length requirements based on your specific applications.": "يمكن للتكوينات الترادفية التعامل مع قطع العمل الطويلة جدًا بما يتجاوز سعة الآلة الفردية القياسية. ",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses\n            CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting\n            the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "يعوض نظام التتويج الأوتوماتيكي انحراف الإطار عن طريق ضبط انحناء الطاولة. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life.\n            Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions,\n            blades can last for tens of thousands of cuts before requiring rotation or replacement.": "تم تصميم الشفرات بأربعة حواف قطع قابلة للاستخدام، مما يزيد من عمر الخدمة بشكل كبير. ",
  "The bundle feeder system can hold up to 1800kg of raw tube stock arranged in bundles. Tubes are\n            automatically separated and fed one by one into the four-chuck clamping system. The system is programmable\n            for different tube sizes and can operate continuously without manual intervention. This dramatically\n            increases productivity by eliminating manual loading time and allowing operators to focus on other tasks.": "يمكن لنظام تغذية الحزم استيعاب ما يصل إلى 1800 كجم من مخزون الأنابيب الخام المرتب في حزم. ",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the\n            desired mode (plate or tube) on the control panel, and the machine automatically releases the current\n            platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and\n            installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "تستخدم منصة التبادل نظامًا آليًا للتغيير السريع مع تحديد المواقع بدقة. ",
  "The fiber laser tube cutter can process carbon steel, stainless steel, aluminum, copper, brass, and titanium\n            tubes. Maximum cutting thickness varies by material: carbon steel up to 8mm, stainless steel up to 6mm,\n            aluminum up to 5mm (thicknesses depend on laser power). The machine handles both coated and uncoated tubes,\n            including galvanized and powder-coated materials.": "يمكن لآلة قطع أنبوب ألياف الليزر معالجة أنابيب الفولاذ الكربوني، الفولاذ المقاوم للصدأ، الألومنيوم، النحاس، النحاس الأصفر، والتيتانيوم. ",
  "The four-chuck clamping system provides superior stability compared to three-chuck systems. It minimizes\n            vibration during cutting, prevents tube displacement, and ensures consistent positioning accuracy of\n            High precision.\n            This is especially important for thin-walled tubes and complex cutting patterns. The pneumatic system allows\n            for quick tube changes while maintaining precise clamping force across different tube sizes.": "يوفر نظام التثبيت ذو الأربعة ظرف ثباتًا فائقًا مقارنةً بأنظمة التثبيت ذات الثلاثة ظرف. ",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example,\n            2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents\n            cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider\n            die openings.": "القاعدة العامة هي استخدام فتحة على شكل حرف V تبلغ سماكتها 8 أضعاف سمك المادة (قاعدة 8T). ",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines.\n            Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it\n            ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and\n            dust extractors, which are shared between both modes.": "تتطلب الماكينة المدمجة مساحة أرضية أقل بنسبة 50% تقريبًا من الماكينات المنفصلة ذات الألواح والأنابيب. ",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines.\n            Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility\n            expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most\n            customers see ROI within 18-24 months compared to buying two separate systems.": "عادةً ما تكون تكلفة الماكينة المدمجة أقل بنسبة 30-40% من شراء ماكينات قطع الألواح والأنابيب المنفصلة. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air\n            bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch\n            tip radius to the natural internal radius created by the die opening for consistent angles. Consider\n            material springback (stainless steel requires 1-2° compensation). Consult our technical team with your\n            material specifications for optimal radius selection.": "يجب أن يكون نصف قطر الثقب 63% على الأقل من سمك المادة لمنع تركيز الضغط. ",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines\n            automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both\n            controllers.": "يتضمن النظام معالجة شاملة للأخطاء. ",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine\n            maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press\n            brake maintenance. We provide remote diagnostics and support.": "يتضمن النظام إمكانات الصيانة التنبؤية التي تنبهك قبل حدوث المشكلات. ",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal\n            alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "يمكن لفرامل الضغط الالتوائية المتزامنة معالجة الفولاذ الطري والفولاذ المقاوم للصدأ والألمنيوم والسبائك المعدنية الشائعة الأخرى. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from\n            the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels\n            formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part\n            drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and\n            face width for your application.": "يجب تحديد عمق الحلق من خلال طول شفة الإرجاع التي تحتاج إلى تشكيلها. ",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality\n            heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials\n            reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection\n            maximize longevity. Worn tooling can be reground to restore performance.": "يعتمد عمر الأداة على ثني المادة، وتكرار الانحناء، والحمولة المطبقة، والصيانة. ",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "يعتمد اختيار درجة الأسنان على قوة التمزق المطلوبة وجودة التثقيب. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "يمكن للشفرات المسننة أن تثقب الورق والكرتون والأفلام البلاستيكية والشرائح والرقائق والمنسوجات والمواد المتخصصة. ",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more\n            economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than\n            electro-hydraulic systems, it's more reliable and requires less maintenance.": "يستخدم Torsion-synchro شريط التواء ميكانيكي لمزامنة حركة المكبس، مما يجعله أبسط وأكثر اقتصادا من الأنظمة الهيدروليكية أو الكهروهيدروليكية. ",
  "Training is actually simplified because operators learn one control system for both functions. The interface\n            is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient\n            in both modes within 3-5 days of training. The unified control system means operators don't need to learn\n            two different machines, reducing the overall training burden.": "تم تبسيط التدريب في الواقع لأن المشغلين يتعلمون نظام تحكم واحدًا لكلا الوظيفتين. ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking\n            is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative\n            metalwork, and any application where surface quality is critical. Steel dies are preferred for higher\n            production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane\n            combines both benefits.": "استخدم قوالب اليوريثان عند ثني المواد الجاهزة أو المطلية مسبقًا أو المصقولة حيث تكون علامات السطح غير مقبولة. ",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and\n            occasional inspection of the torsion bar are typically all that's needed. The mechanical design is\n            inherently reliable.": "مطلوب الحد الأدنى من الصيانة. ",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty\n            options are available. Lifetime technical support is included with all machines.": "نحن نقدم ضمانًا شاملاً لمدة عامين يغطي جميع المكونات والأنظمة الرئيسية. ",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization\n            system. Extended warranty packages and dedicated support programs are available.": "نحن نقدم ضمانًا شاملاً لمدة عامين يغطي جميع المكونات الرئيسية بما في ذلك نظام المزامنة. ",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This\n            includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended\n            warranty packages and preventive maintenance programs are available.": "نحن نقدم ضمانًا شاملاً لمدة 3 سنوات على الآلات الثقيلة التي تغطي جميع المكونات الرئيسية. ",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are\n            available. Technical support is provided for the life of the machine.": "نحن نقدم ضمانًا قياسيًا لمدة عام يغطي جميع المكونات الرئيسية. ",
  "What are the cost savings compared to buying two separate machines?": "ما هو التوفير في التكاليف مقارنة بشراء جهازين منفصلين؟",
  "What are the main advantages of a robotic press brake?": "ما هي المزايا الرئيسية لفرامل الضغط الآلية؟",
  "What are the operating costs?": "ما هي تكاليف التشغيل؟",
  "What blade material offers the best value?": "ما هي مادة الشفرة التي تقدم أفضل قيمة؟",
  "What blade material should I choose for my application?": "ما هي مادة الشفرة التي يجب أن أختارها لتطبيقي؟",
  "What does \"scimitar\" mean in press brake tooling?": "ماذا يعني \"السيف\" في أدوات ضغط الفرامل؟",
  "What foundation requirements are needed?": "ما هي المتطلبات الأساسية اللازمة؟",
  "What happens if one machine encounters an error?": "ماذا يحدث إذا واجه جهاز واحد خطأ؟",
  "What hardness should press brake tooling have?": "ما هي الصلابة التي يجب أن تتمتع بها أدوات الفرامل؟",
  "What information do I need to provide for a custom blade quote?": "ما هي المعلومات التي أحتاج إلى تقديمها للحصول على عرض أسعار مخصص للشفرة؟",
  "What is SmartCut AI and how does it improve cutting?": "ما هو SmartCut AI وكيف يعمل على تحسين عملية القطع؟",
  "What is pre-bending and why is it important?": "ما هو الانحناء المسبق ولماذا هو مهم؟",
  "What is the ROI for a robotic press brake system?": "ما هو عائد الاستثمار لنظام مكابح الضغط الآلي؟",
  "What is the advantage of a four-column hydraulic press over other press types?": "ما هي ميزة المكبس الهيدروليكي بأربعة أعمدة مقارنة بأنواع المكابس الأخرى؟",
  "What is the advantage of the four-chuck clamping system?": "ما هي ميزة نظام التثبيت ذو الأربعة ظرف؟",
  "What is the difference between 3-roll and 4-roll plate rolling machines?": "ما هو الفرق بين آلات لف الألواح 3-رول و 4-رول؟",
  "What is the difference between a gooseneck punch and a standard punch?": "ما هو الفرق بين لكمة معقوفة واللكمة القياسية؟",
  "What is the difference between bump forming and radius tooling?": "ما هو الفرق بين تشكيل النتوء وأدوات نصف القطر؟",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "ما الفرق بين مكابح الضغط الكهروهيدروليكية والهيدروليكية؟",
  "What is the difference between guillotine and swing beam shears?": "ما هو الفرق بين المقصلة ومقصات الشعاع المتأرجح؟",
  "What is the difference between single table and dual table laser cutting machines?": "ما هو الفرق بين آلات القطع بالليزر ذات الطاولة الواحدة والطاولة المزدوجة؟",
  "What is the difference between single table and dual table punching machines?": "ما هو الفرق بين آلات التثقيب ذات الطاولة الواحدة والطاولة المزدوجة؟",
  "What is the difference between swing beam and guillotine shears?": "ما هو الفرق بين شعاع التأرجح ومقصات المقصلة؟",
  "What is the difference between torsion-synchro and hydraulic synchronization?": "ما هو الفرق بين تزامن الالتواء والتزامن الهيدروليكي؟",
  "What is the expected delivery time?": "ما هو وقت التسليم المتوقع؟",
  "What is the maximum radius I can achieve on a press brake?": "ما هو أقصى نصف قطر يمكنني تحقيقه على مكابح الضغط؟",
  "What is the maximum workpiece length a tandem system can handle?": "ما هو الحد الأقصى لطول قطعة العمل التي يمكن للنظام الترادفي التعامل معها؟",
  "What is the typical delivery time?": "ما هو وقت التسليم النموذجي؟",
  "What is the typical lead time for custom blades?": "ما هي المهلة الزمنية النموذجية للشفرات المخصصة؟",
  "What is the typical lead time for delivery?": "ما هي المهلة الزمنية النموذجية للتسليم؟",
  "What is the typical lead time?": "ما هي المهلة الزمنية النموذجية ؟",
  "What is the warranty coverage?": "ما هي تغطية الضمان؟",
  "What maintenance does a fiber laser require?": "ما هي الصيانة التي يتطلبها ليزر الألياف؟",
  "What maintenance does a hydraulic press require?": "ما هي الصيانة التي تتطلبها المكبس الهيدروليكي؟",
  "What maintenance is required?": "ما هي الصيانة المطلوبة؟",
  "What material is best for press brake tooling?": "ما هي المواد الأفضل لأدوات الفرامل الصحافة؟",
  "What materials and applications are suitable for four-column hydraulic presses?": "ما هي المواد والتطبيقات المناسبة للمكابس الهيدروليكية ذات الأربعة أعمدة؟",
  "What materials and hardness should gooseneck punches have?": "ما هي المواد والصلابة التي يجب أن تمتلكها اللكمات المعقوفة؟",
  "What materials and thicknesses can be cut?": "ما هي المواد والسماكات التي يمكن قطعها؟",
  "What materials and thicknesses can be rolled?": "ما هي المواد والسماكات التي يمكن دحرجتها؟",
  "What materials can be bent with this machine?": "ما هي المواد التي يمكن ثنيها بهذه الآلة؟",
  "What materials can be cut with the tube laser?": "ما هي المواد التي يمكن قطعها باستخدام أنبوب الليزر؟",
  "What materials can be cut with these blades?": "ما هي المواد التي يمكن قطعها بهذه الشفرات؟",
  "What materials can be cut with this machine?": "ما هي المواد التي يمكن قطعها بهذه الآلة؟",
  "What materials can these blades cut?": "ما هي المواد التي يمكن لهذه الشفرات قطعها؟",
  "What materials can toothed blades perforate?": "ما هي المواد التي يمكن للشفرات المسننة أن تثقبها؟",
  "What maximum material thickness can heavy-duty press brakes handle?": "ما الحد الأقصى لسمك المادة الذي يمكن أن تتعامل معه مكابح الضغط للخدمة الشاقة؟",
  "What space is required for installation?": "ما المساحة المطلوبة للتثبيت؟",
  "What tube shapes and sizes can the machine cut?": "ما هي أشكال وأحجام الأنابيب التي يمكن للآلة قطعها؟",
  "What warranty and support is provided?": "ما الضمان والدعم المقدم؟",
  "What warranty is included?": "ما هو الضمان المتضمن؟",
  "What's the difference between European and American tooling standards?": "ما الفرق بين معايير الأدوات الأوروبية والأمريكية؟",
  "When should I use urethane dies instead of steel?": "متى يجب علي استخدام قوالب اليوريثان بدلاً من الفولاذ؟",
  "Which blade type should I choose for my application?": "ما نوع الشفرة التي يجب أن أختارها لتطبيقي؟",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly\n            without interrupting production. The AI system also learns from each bending operation to\n            optimize future programs automatically.": "بفضل برنامجنا المتقدم للبرمجة دون اتصال بالإنترنت والمحاكاة ثلاثية الأبعاد، يمكن برمجة الأجزاء الجديدة بسرعة دون مقاطعة الإنتاج. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending\n            operations where deep relief clearance is required. These combine the interference-free benefits of\n            gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed\n            by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming\n            tooling.": "نعم، تم تصميم اللكمات المعقوفة ذات الزوايا الحادة (30 درجة، 45 درجة، 60 درجة) خصيصًا لعمليات التطويق والثني الحاد التي تتطلب خلوصًا عميقًا. ",
  "Yes, chipper blades can be professionally sharpened multiple times before replacement. Most blades can be resharpened 3-6 times depending on wear severity and original blade thickness. Professional sharpening services restore proper bevel angle and edge geometry. Regular sharpening before severe dulling occurs maximizes total blade life and maintains optimal chip quality. We offer sharpening services with quick turnaround.": "نعم، يمكن شحذ شفرات التقطيع بطريقة احترافية عدة مرات قبل الاستبدال. ",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "نعم، يتم توفير تعليمات التثبيت الشاملة مع جميع طلبات الشفرات، بما في ذلك المحاذاة الصحيحة للشفرة، وضبط الفجوة، ومواصفات عزم الدوران. ",
  "Yes, comprehensive installation instructions, torque specifications, and maintenance guidelines are provided with blade orders. We offer technical support for proper blade installation, adjustment, and troubleshooting. Safety information and best practices documentation are included. Our technical team is available to answer questions about blade installation, sharpening schedules, and performance optimization for your specific application.": "نعم، يتم توفير تعليمات التثبيت الشاملة ومواصفات عزم الدوران وإرشادات الصيانة مع طلبات الشفرات. ",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "نعم، يتم تضمين الدعم الفني الشامل مع جميع طلبات الشفرات. ",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head,\n            and control system for both applications. The CNC system automatically optimizes parameters for each mode.\n            Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across\n            all operations.": "نعم، جودة القطع متطابقة في كلا الوضعين. ",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively\n            giving you two separate press brakes when tandem operation is not needed.": "نعم، يمكن تحويل كل آلة إلى وضع التشغيل المستقل لقطع العمل ذات الطول القياسي، مما يوفر لك بشكل فعال مكابح ضغط منفصلة عندما لا تكون هناك حاجة إلى التشغيل الترادفي.",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature\n            oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation.\n            Regular maintenance schedules should be followed to ensure optimal performance.": "نعم، تم تصميم مكابح الضغط شديدة التحمل خصيصًا للإنتاج الصناعي المستمر. ",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "نعم، يمكن إعادة شحذ معظم شفرات الكسارة بشكل احترافي من 2 إلى 4 مرات اعتمادًا على شدة التآكل وتصميم الشفرة. ",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The\n            adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts\n            bending parameters for different materials including steel, stainless steel, and aluminum.": "نعم، يتميز نظامنا الآلي بالمرونة العالية ويمكنه التعامل مع مجموعة واسعة من أحجام الألواح والمواد. ",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "نعم، لقد تم تصميم شفرات القص الدوارة الخاصة بنا للقيام بدورات إعادة شحذ متعددة. ",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller\n            and straightforward operation make it easy to learn compared to more complex CNC systems.": "نعم، تعتبر مكابح الضغط الالتوائية المتزامنة مثالية للمشغلين ذوي التدريب الأساسي. ",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within\n            24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "نعم، نحتفظ بمخزون شامل من قطع الغيار والمواد الاستهلاكية. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "نعم، نحن نقدم خدمات إنتاج واختبار الشفرات للتطبيقات المخصصة. ",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will\n            ensure your machine is properly set up and your operators are fully trained to use it efficiently and\n            safely.": "نعم، نحن نقدم خدمات التركيب الكاملة والتدريب الشامل للمشغلين. ",
  "Yes, we provide comprehensive installation guidelines, blade gap adjustment procedures, and setup recommendations with every blade order. Our technical support team is available to assist with installation questions, troubleshooting, and optimization. On-site installation services are available for large orders or complex applications.": "نعم، نحن نقدم إرشادات التثبيت الشاملة وإجراءات ضبط فجوة الشفرة وتوصيات الإعداد مع كل طلب شفرة. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team\n            will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting.\n            Training materials and operation manuals are also provided.": "نعم، نحن نقدم تدريبًا شاملاً للمشغلين كجزء من خدمة التركيب لدينا. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator\n            training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization,\n            basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "نعم، نحن نقدم الدعم الشامل بما في ذلك التثبيت في الموقع، وتشغيل الماكينة، وتدريب المشغلين (عادةً من 3 إلى 5 أيام). ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance,\n            and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment,\n            safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "نعم، نحن نقدم الدعم الشامل بما في ذلك التثبيت في الموقع، وتشغيل الماكينة، وتوجيه متطلبات الأساس، وتدريب المشغلين. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius\n            dimensions, material specifications, production volume, and part drawings. Our engineering team will\n            design custom arc molds optimized for your specific application. Custom tooling is particularly\n            cost-effective for high-volume production runs requiring consistent radius specifications not available\n            in standard tooling catalogs.": "نعم، نحن متخصصون في أدوات نصف القطر المخصصة للتطبيقات الفريدة. ",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings,\n            material specifications, and bend requirements. Our engineering team will design custom dies for U-channels,\n            Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results\n            for high-volume production runs.": "نعم، نحن متخصصون في الأدوات المخصصة لتطبيقات الثني الفريدة. ",
  "Yes, with the optional bevel cutting head upgrade, our tube laser can cut various bevel angles for pipe\n            welding preparation. The system can create V-grooves, K-grooves, and other weld joint configurations at\n            precise angles. This eliminates the need for secondary beveling operations and ensures perfect fit-up for\n            welding. The SmartCut AI system automatically calculates optimal cutting paths for complex bevel geometries.": "نعم، مع ترقية رأس القطع المائل الاختياري، يستطيع أنبوب الليزر الخاص بنا قطع زوايا مائلة مختلفة لإعداد لحام الأنابيب. ",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting\n            the roll positions to create a gradual taper. The CNC system calculates the required roll positions for\n            the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and\n            conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "نعم، مع ملحق اللف المخروطي الاختياري، يمكن لآلاتنا إنتاج أشكال مخروطية عن طريق ضبط مواضع اللف لإنشاء استدقاق تدريجي. "
}