{
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar\n            sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel\n            formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both\n            deep relief clearance and offset capability for the most challenging box and channel forming operations.": "„Scimitar“ oder „Säbel“ bezieht sich auf ein versetztes, gebogenes Profildesign, das der gebogenen Klinge eines Krummsäbelschwerts ähnelt. ",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the\n            leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and\n            efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They\n            produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision\n            work and thick plate rolling.": "3-Walzen-Maschinen sind wirtschaftlicher und für allgemeine Anwendungen geeignet, erfordern jedoch ein separates Vorbiegen der Vorderkante und können längere gerade Kanten hinterlassen. ",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing\n            flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to\n            form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing\n            the punch from hitting previously formed flanges, making them essential for box forming, door frames,\n            and channel bending applications.": "Ein Schwanenhalsstanzer verfügt über ein tiefes Reliefdesign (versetztes Profil), das Freiraum für vorhandene Flansche und tiefe Kastengeometrien bietet. ",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day.\n            Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to\n            switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production\n            orders without significant downtime.": "Absolut! ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications.\n            Provide part drawings showing flange dimensions, bend angles, material specifications, and production\n            volume. Our engineering team will design custom gooseneck tooling optimized for your specific application,\n            including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom\n            tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "Absolut. ",
  "Are spare parts readily available?": "Sind Ersatzteile leicht verfügbar?",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "Die Lebensdauer der Klinge hängt vom zu schneidenden Material, der Schnittgeschwindigkeit und den Wartungspraktiken ab. ",
  "Blade life depends on material being cut, thickness, frequency of use, and maintenance. With four usable edges, our blades can last 4 times longer than single-edge blades. Typical service life ranges from tens of thousands to hundreds of thousands of cuts. Proper blade gap adjustment and regular rotation extend blade life significantly.": "Die Lebensdauer der Klinge hängt vom zu schneidenden Material, der Dicke, der Häufigkeit der Verwendung und der Wartung ab. ",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "Die Lebensdauer der Klingen hängt von der Materialart, der Brechergeschwindigkeit und dem Klingenmaterial ab. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "Die Lebensdauer der Klinge variiert erheblich je nach verarbeitetem Material, Produktionsgeschwindigkeit und Zahndesign. ",
  "Blade life varies significantly based on wood type, material diameter, presence of dirt/rocks, and maintenance practices. In clean wood applications, chromium steel blades typically last 150-300 hours of continuous operation. Carbide-inlay blades can last 800-1200 hours when avoiding metal contaminants. Proper blade maintenance, rotation, and avoiding dirt-contaminated wood maximize blade life.": "Die Lebensdauer der Klinge variiert erheblich je nach Holzart, Materialdurchmesser, Vorhandensein von Schmutz/Steinen und Wartungspraktiken. ",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "Die Auswahl der Klingen hängt von Ihren Maschinenspezifikationen, der Materialart und den Schneidanforderungen ab. ",
  "Blades with minor wear can sometimes be professionally re-ground to restore cutting performance. However, deep nicks, cracks, or severe wear typically require replacement. Re-grinding reduces blade dimensions and may affect machine blade gap settings. We offer professional blade inspection services to determine if re-grinding is cost-effective for your situation.": "Klingen mit geringem Verschleiß können manchmal professionell nachgeschliffen werden, um die Schneidleistung wiederherzustellen. ",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through\n            multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling\n            uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump\n            forming is cost-effective for occasional large radius work, while dedicated radius tooling provides\n            superior surface finish and faster production for regular radius bending applications.": "Beim Bump-Forming werden Standard-V-Matrizen und -Stempel mit CNC-Programmierung verwendet, um Bögen mit großem Radius durch mehrere kleine inkrementelle Biegungen zu erzeugen (Annäherung des Bogens an lineare Segmente). ",
  "Can I process both plates and tubes in the same production run?": "Kann ich sowohl Platten als auch Rohre im selben Produktionslauf verarbeiten?",
  "Can chipper blades be sharpened and reused?": "Können Hackmesser geschärft und wiederverwendet werden?",
  "Can crusher blades be sharpened and reused?": "Können Brechermesser geschärft und wiederverwendet werden?",
  "Can damaged blades be repaired or re-sharpened?": "Können beschädigte Messer repariert oder nachgeschärft werden?",
  "Can gooseneck punches be used for hemming operations?": "Können Schwanenhalsstanzen für Falzarbeiten verwendet werden?",
  "Can the machine cut bevels for pipe welding?": "Kann die Maschine Fasen zum Rohrschweißen schneiden?",
  "Can the machine roll conical shapes?": "Kann die Maschine konische Formen rollen?",
  "Can the machines operate independently?": "Können die Maschinen unabhängig voneinander arbeiten?",
  "Can the system handle different sheet sizes and materials?": "Kann das System unterschiedliche Blechgrößen und Materialien verarbeiten?",
  "Can these blades be re-sharpened?": "Können diese Klingen nachgeschärft werden?",
  "Can these machines run 24/7?": "Können diese Maschinen rund um die Uhr laufen?",
  "Can toothed blades be re-sharpened?": "Können Zahnmesser nachgeschärft werden?",
  "Can you manufacture custom profile dies?": "Können Sie kundenspezifische Profilmatrizen herstellen?",
  "Can you manufacture custom radius profiles?": "Können Sie individuelle Radiusprofile herstellen?",
  "Check your chipper's operator manual for blade specifications including length, width, thickness, and bolt hole pattern. Measure existing blades if manual is unavailable. Provide chipper brand and model number - we maintain specifications for most major brands (Vermeer, Bandit, Morbark, etc.). Send us photos or measurements of existing blades for confirmation. We can cross-reference and provide exact replacement blades.": "Sehen Sie in der Bedienungsanleitung Ihres Häckslers nach, welche Klingenspezifikationen sie haben, einschließlich Länge, Breite, Dicke und Muster der Bolzenlöcher. ",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength,\n            wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium\n            HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production\n            volume, material being bent, and required tool life.": "Chrom-Molybdän-Stahl (42CrMo, Cr12MoV) ist der Industriestandard und bietet außergewöhnliche Festigkeit, Verschleißfestigkeit und Korrosionsschutz. ",
  "Common questions about our": "Häufige Fragen zu unserem",
  "Contact our support team": "Kontaktieren Sie unser Support-Team",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick,\n            stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage,\n            working length, and material properties.": "Je nach Tonnage und Materialart können Hochleistungs-Abkantpressen Weichstahl bis zu einer Dicke von 50 mm, Edelstahl bis zu 30 mm und Aluminium bis zu 40 mm biegen. ",
  "Do I need special skills to operate a robotic system?": "Benötige ich besondere Fähigkeiten, um ein Robotersystem zu bedienen?",
  "Do you manufacture custom gooseneck profiles?": "Stellen Sie individuelle Schwanenhalsprofile her?",
  "Do you offer sample testing before production orders?": "Bieten Sie Musterprüfungen vor Produktionsaufträgen an?",
  "Do you offer technical support and installation guidance?": "Bieten Sie technischen Support und Installationsanleitungen an?",
  "Do you provide installation and maintenance guidance?": "Bieten Sie Installations- und Wartungsanleitungen an?",
  "Do you provide installation and setup guidance?": "Bieten Sie Installations- und Einrichtungsanleitungen an?",
  "Do you provide installation and setup support?": "Bieten Sie Installations- und Einrichtungsunterstützung an?",
  "Do you provide installation and training?": "Bieten Sie Installation und Schulung an?",
  "Double table machines typically achieve 40-50% higher productivity than single table machines. The automatic\n            table exchange takes only rapid, and while one table is cutting, the operator can load/unload the other\n            table simultaneously. This eliminates material loading downtime and enables continuous 24/7 operation, making\n            it ideal for high-volume production environments.": "Doppeltischmaschinen erreichen typischerweise eine um 40–50 % höhere Produktivität als Einzeltischmaschinen. ",
  "Download PDF": "PDF herunterladen",
  "Download Technical Brochure": "Laden Sie die technische Broschüre herunter",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between\n            cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also\n            consume less energy and provide faster response times.": "Elektrohydraulische Abkantpressen nutzen ein elektronisches Steuersystem zur präzisen Synchronisierung zwischen den Zylindern und bieten im Vergleich zu herkömmlichen hydraulischen Systemen eine bessere Genauigkeit und Wiederholbarkeit. ",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized\n            clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical\n            or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American\n            systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "Europäische Werkzeuge (Wila-, Amada-, Trumpf-Systeme) verwenden segmentierte Schnellwechselwerkzeuge mit standardisierten Spannsystemen für eine schnelle Einrichtung. ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning\n            protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction\n            filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser\n            gas refills or mirror alignments are needed.": "Faserlaser sind im Vergleich zu CO2-Lasern nahezu wartungsfrei. ",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "Flache Klingen eignen sich am besten für dünnwandige Produkte (unter 3 mm) wie Flaschen und Folien und bieten eine höhere Leistung. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "Für genaue kundenspezifische Angebote geben Sie Folgendes an: Blattaußendurchmesser, Innendurchmesser (Bohrungsgröße), Nabendicke, gewünschte Zahnteilung, Zahnprofiltyp, sofern bekannt, zu verarbeitendes Material, Materialdicke, Produktionsgeschwindigkeit und etwaige spezielle Anforderungen. ",
  "For general mild steel cutting, Cr12MoV or 6CrW2Si provides excellent performance and value. For stainless steel and harder materials, consider high-speed steel (HSS) or tungsten carbide. For high-volume production, premium materials offer better long-term cost-effectiveness despite higher initial cost. Our technical team can recommend optimal materials based on your specific application.": "Für das allgemeine Schneiden von unlegiertem Stahl bieten Cr12MoV oder 6CrW2Si eine hervorragende Leistung und ein hervorragendes Preis-Leistungs-Verhältnis. ",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "Für den gelegentlichen Gebrauch oder weiche Kunststoffe bietet Stahl mit hohem Kohlenstoffgehalt ein gutes Preis-Leistungs-Verhältnis. ",
  "For occasional use with clean wood, carbon steel offers good value. For professional/commercial operations, chromium steel (8%+ Cr) provides the best balance of performance and cost. For high-volume production or abrasive applications, consider premium tool steels. Carbide-inlay blades are recommended for maximum productivity in continuous operations despite higher initial cost. Our team can recommend optimal materials based on your specific usage patterns.": "Für den gelegentlichen Einsatz mit sauberem Holz bietet Kohlenstoffstahl ein gutes Preis-Leistungs-Verhältnis. ",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece,\n            eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing,\n            metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also\n            provides superior stability and precision for high-tonnage applications.": "Vier-Säulen-Hydraulikpressen verfügen über vier Führungspfosten, die eine gleichmäßige Kraftverteilung über das gesamte Werkstück gewährleisten und die bei Ein-Säulen- oder C-Rahmen-Pressen üblichen Durchbiegungen und Neigungen verhindern. ",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Get detailed technical specifications, dimensions, and performance data": "Erhalten Sie detaillierte technische Spezifikationen, Abmessungen und Leistungsdaten",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and\n            the ability to cut thicker materials. They produce minimal material waste and are ideal for\n            applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller\n            footprint, and are better suited for thinner materials.": "Guillotine-Scheren verwenden eine vertikale Klingenbewegung, die gerade nach unten verläuft, was eine höhere Präzision und die Möglichkeit bietet, dickere Materialien zu schneiden. ",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days\n            depending on tonnage, configuration, and optional features. Rush delivery may be available for certain\n            configurations.": "Hochleistungs-Abkantpressen werden in der Regel individuell nach Spezifikationen gefertigt. ",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and\n            operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick\n            concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "Hochleistungs-Abkantpressen erfordern aufgrund ihres hohen Gewichts und ihrer Betriebskräfte ein Fundament aus Stahlbeton. ",
  "How accurate is the bending process?": "Wie genau ist der Biegevorgang?",
  "How accurate is the synchronization between the two machines?": "Wie genau ist die Synchronisation zwischen den beiden Maschinen?",
  "How do I find the right blade size for my chipper?": "Wie finde ich die richtige Messergröße für meinen Häcksler?",
  "How do I know when blades need replacement?": "Woher weiß ich, wann Klingen ausgetauscht werden müssen?",
  "How do I know when blades need to be replaced or sharpened?": "Woher weiß ich, wann Klingen ausgetauscht oder geschärft werden müssen?",
  "How do I know when to rotate or replace blades?": "Woher weiß ich, wann die Klingen gedreht oder ausgetauscht werden müssen?",
  "How do I minimize springback in radius bending?": "Wie minimiere ich die Rückfederung beim Radiusbiegen?",
  "How do I select the correct V-die opening?": "Wie wähle ich die richtige V-Matrizenöffnung aus?",
  "How do I select the correct blade size?": "Wie wähle ich die richtige Klingengröße aus?",
  "How do I select the correct radius for my application?": "Wie wähle ich den richtigen Radius für meine Anwendung aus?",
  "How do I select the correct throat depth for my gooseneck punch?": "Wie wähle ich die richtige Ausladungstiefe für meine Schwanenhalsstanze aus?",
  "How do I select the correct tooth pitch for my application?": "Wie wähle ich die richtige Zahnteilung für meine Anwendung?",
  "How does the 10-second exchange platform work?": "Wie funktioniert die 10-Sekunden-Austauschplattform?",
  "How does the automatic tube feeding system work?": "Wie funktioniert das automatische Sondenernährungssystem?",
  "How does the crowning system work?": "Wie funktioniert das Krönungssystem?",
  "How long do chipper blades typically last?": "Wie lange halten Häckslermesser normalerweise?",
  "How long do crusher blades typically last?": "Wie lange halten Brecherklingen normalerweise?",
  "How long do rolling shear blades typically last?": "Wie lange halten Rollschermesser normalerweise?",
  "How long do shearing machine blades last?": "Wie lange halten Schermaschinenmesser?",
  "How long do toothed blades last?": "Wie lange halten gezahnte Klingen?",
  "How long does installation and commissioning take?": "Wie lange dauert die Installation und Inbetriebnahme?",
  "How long does it take to program new parts?": "Wie lange dauert die Programmierung neuer Teile?",
  "How long does press brake tooling last?": "Wie lange halten Abkantwerkzeuge?",
  "How long is the warranty period?": "Wie lange ist die Garantiezeit?",
  "How much faster is a double table machine compared to single table?": "Wie viel schneller ist eine Doppeltischmaschine im Vergleich zu einer Einzeltischmaschine?",
  "How much maintenance does it require?": "Wie viel Wartung ist erforderlich?",
  "How often do the blades need to be replaced?": "Wie oft müssen die Klingen ausgetauscht werden?",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and\n            synchronization testing. We provide comprehensive on-site commissioning and operator training.": "Die Installation dauert in der Regel zwei bis drei Wochen, einschließlich Maschinenpositionierung, Netzwerkeinrichtung, Kalibrierung und Synchronisierungstests. ",
  "Is cutting quality the same in both modes?": "Ist die Schnittqualität in beiden Modi gleich?",
  "Is it suitable for beginners?": "Ist es für Anfänger geeignet?",
  "Is operator training more complex for the integrated machine?": "Ist die Schulung des Bedieners für die integrierte Maschine komplexer?",
  "Is training and installation support provided?": "Werden Schulungen und Installationsunterstützung angeboten?",
  "Is training provided for operators?": "Werden Schulungen für Bediener angeboten?",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches\n            typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii\n            exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending.\n            Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "Der maximal erreichbare Radius hängt von der Tischbreite der Abkantpresse und dem Werkzeugsystem ab. ",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap\n            rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part\n            complexity, and current labor costs.": "Die meisten Kunden erzielen schnell einen ROI durch Arbeitseinsparungen, höhere Produktivität, geringere Ausschussraten und die Möglichkeit, mannlose Schichten zu betreiben. ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion),\n            assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables\n            (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power\n            consumption and minimal maintenance requirements.": "Zu den Betriebskosten gehören Strom (Faserlaser sind hocheffizient mit ca. 30 % elektrooptischer Umwandlung), Hilfsgas (Stickstoff, Sauerstoff oder Druckluft), Wasserkühlerstrom und gelegentliche Verbrauchsmaterialien (Schutzlinsen, Düsen). ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil\n            (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column\n            hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle\n            while consuming minimal energy during fast approach and return strokes.": "Zu den Betriebskosten gehören Strom für den Hydraulikpumpenmotor (der Leistungsbedarf variiert je nach Tonnage), Hydrauliköl (regelmäßiger Austausch), Filterwechsel, Schmierung und gelegentlicher Dichtungswechsel. ",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum,\n            copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Unsere CNC-Biegemaschinen können verschiedene Materialien verarbeiten, darunter Weichstahl, Edelstahl, Aluminium, Kupfer und andere Metalllegierungen. ",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency.\n            The CNC system allows precise control of roll positions and automatically calculates the correct settings\n            based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in\n            real-time to maintain consistent quality throughout the operation.": "Unsere CNC-gesteuerten Blechwalzmaschinen erreichen eine hohe Biegepräzision bei gleichbleibendem Durchmesser. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and\n            12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and titanium.": "Unsere Faserlaser-Schneidemaschinen können verschiedene Stärken von Kohlenstoffstahl, Edelstahl, Aluminium und 12 mm sowie Kupfer/Messing bis zu 8 mm schneiden (Stärken variieren je nach Laserleistung). ",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "Unsere Tafelscheren können verschiedene Metallmaterialien verarbeiten, darunter Weichstahl, Edelstahl, Aluminium, Kupfer, Messing und andere Metallbleche. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass,\n            plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking,\n            powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based\n            on material type, thickness, and forming operation requirements.": "Unsere hydraulischen Pressen verarbeiten ein breites Spektrum an Materialien, darunter Stahl, Edelstahl, Aluminium, Kupfer, Messing, Kunststoffe, Gummi und Verbundwerkstoffe. ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile\n            metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength.\n            Softer materials and those with higher ductility are easier to roll to smaller diameters.": "Unsere Plattenwalzmaschinen können Kohlenstoffstahl, Edelstahl, Aluminiumlegierungen und andere duktile Metalle verarbeiten. ",
  "Our punching machines can process various thicknesses of carbon steel, stainless steel, aluminum,\n            and copper/brass (thicknesses vary based on machine capacity). Higher tonnage machines can process\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and other sheet metals.": "Unsere Stanzmaschinen können verschiedene Stärken von Kohlenstoffstahl, Edelstahl, Aluminium und Kupfer/Messing verarbeiten (Stärken variieren je nach Maschinenkapazität). ",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "Unsere Rollscherenmesser verarbeiten eine Vielzahl von Materialien, darunter Stahl, Edelstahl, Aluminium, Kupfer, Messing, Kunststofffolien, Papier, Pappe, Gummi, Schaumstoff, Textilien und Verbundwerkstoffe. ",
  "Our shearing blades can cut mild steel, stainless steel, aluminum, copper, brass, and other metal alloys. The maximum cutting thickness depends on material hardness and machine capacity. Standard blades handle materials up to 50mm thick in mild steel. For harder materials like stainless steel, specialized blade materials are recommended.": "Unsere Schermesser können Weichstahl, Edelstahl, Aluminium, Kupfer, Messing und andere Metalllegierungen schneiden. ",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "Unsere Schwenkbalkenschermaschinen können verschiedene Metallmaterialien verarbeiten, darunter Baustahl, Edelstahl, Aluminium, Kupferplatten und andere Metallbleche. ",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide\n            comprehensive training for operators and programmers. Most operators become proficient with basic operations\n            within a short training period.": "Unser System verfügt über eine intuitive Benutzeroberfläche, die nur minimale Robotikkenntnisse erfordert. ",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced\n            sensors continuously monitor and adjust for perfect coordination between both machines.": "Unsere Tandemsysteme gewährleisten während des gesamten Biegeprozesses eine außergewöhnliche Synchronisierungsgenauigkeit. ",
  "Our tube laser cutting machines can process round, square, rectangular, and oval tubes. Standard capacity\n            ranges from customizable diameter, with optional upgrades available for tubes larger diameter options. The machine\n            can handle tube lengths up to Customizable length (standard) with extended options up to 12000mm. Wall thicknesses depend\n            on laser power and material type.": "Unsere Rohrlaserschneidmaschinen können runde, quadratische, rechteckige und ovale Rohre bearbeiten. ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling\n            operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our\n            4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing\n            and reinserting the plate, which saves time and improves quality.": "Beim Vorbiegen werden die Vorder- und Hinterkanten des Blechs vor dem Hauptwalzvorgang gebogen. ",
  "Q:": "Q:",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear,\n            lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system\n            should be serviced annually with oil changes and filter replacements. With proper maintenance, our\n            machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and\n            training with each machine.": "Zur regelmäßigen Wartung gehören die Überprüfung des Hydraulikölstands und der Qualität, die Überprüfung der Walzenoberflächen auf Verschleiß, die Schmierung von Lagern und beweglichen Teilen sowie die Überprüfung der Ausrichtung des Walzensystems. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting\n            hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings,\n            checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper\n            maintenance ensures reliable operation and extends machine lifespan for many years.": "Zur regelmäßigen Wartung gehören: Überprüfung des Hydraulikölstands und der Qualität (regelmäßiger Ölwechsel), Überprüfung von Hydraulikschläuchen und -anschlüssen auf Lecks, Reinigung oder Austausch von Filtern, Schmierung von Führungspfosten und Linearlagern, Überprüfung von Manometern und Steuerventilen. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine\n            daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide\n            a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "Die regelmäßige Wartung ist einfach und unkompliziert: Überprüfen Sie wöchentlich den Hydraulikölstand, reinigen Sie die Maschine täglich, schmieren Sie bewegliche Teile gemäß dem Zeitplan und prüfen Sie regelmäßig den Zustand der Klinge. ",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality,\n            significantly increased productivity, reduced labor costs, enhanced safety by removing operators from\n            hazardous zones, and the ability to automate complex multi-bend sequences.": "Roboter-Abkantpressen bieten erhebliche Vorteile, darunter mannlosen Betrieb rund um die Uhr, gleichbleibende Qualität, deutlich gesteigerte Produktivität, reduzierte Arbeitskosten, erhöhte Sicherheit durch die Entfernung von Bedienern aus Gefahrenzonen und die Möglichkeit, komplexe Mehrfachbiegeabläufe zu automatisieren.",
  "Signs include increased burring, rough cut edges, visible nicks or chips in the cutting edge, increased cutting force required, or material deformation. When these occur, rotate the blade to use a fresh edge. Replace when all four edges show significant wear. Regular visual inspection after every shift helps maintain optimal cutting quality.": "Zu den Anzeichen gehören verstärkte Gratbildung, raue Schnittkanten, sichtbare Kerben oder Späne in der Schneidkante, erhöhter Schneidkraftaufwand oder Materialverformung. ",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "Zu den Anzeichen gehören eine erhöhte Partikelgröße, ungleichmäßige Körnung, höherer Stromverbrauch, übermäßiger Lärm, sichtbare Schäden oder Rundungen der Messer sowie ein verringerter Durchsatz. ",
  "Signs include larger chip sizes, increased power consumption, excessive fines or dust, visible edge rounding or nicks, and increased feeding force required. Inspect blades every 50-100 operating hours for wear. Replace or sharpen when cutting edge shows significant rounding or if nicks exceed 3mm depth. Rotating blade positions during inspection helps ensure even wear across all cutting edges.": "Zu den Anzeichen gehören größere Chipgrößen, erhöhter Stromverbrauch, übermäßiger Feinanteil oder Staub, sichtbare Kantenrundungen oder Kerben sowie eine erhöhte erforderliche Vorschubkraft. ",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "Eintisch-Laserschneidmaschinen verfügen über einen festen Arbeitstisch und bieten eine wirtschaftlichere Lösung für kleine bis mittlere Produktionsmengen. ",
  "Single table punching machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "Eintisch-Stanzmaschinen verfügen über einen festen Arbeitstisch und bieten eine wirtschaftlichere Lösung für kleine bis mittlere Produktionsmengen. ",
  "SmartCut AI is our intelligent control system that automatically optimizes cutting parameters in real-time.\n            It analyzes tube geometry, material characteristics, and wall thickness to adjust laser power, cutting\n            speed,\n            and focal position. This reduces material waste by up to 18%, improves edge quality, and minimizes operator\n            skill requirements. The system also includes automatic nesting software to maximize material utilization.": "SmartCut AI ist unser intelligentes Steuerungssystem, das die Schnittparameter automatisch und in Echtzeit optimiert. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "Einige gezahnte Klingendesigns können nachgeschärft werden, während andere für den Austausch konzipiert sind. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback:\n            use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom\n            bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening\n            to reduce stress, and consider coining for zero springback applications. Material-specific springback\n            tables help predict and compensate for springback in production.": "Die Rückfederung nimmt mit zunehmender Materialhärte zu und mit größerem Biegeradius ab. ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications\n            or higher power configurations may require 45-60 days. We provide regular production updates and coordinate\n            logistics to ensure smooth delivery and installation.": "Maschinen mit Standardkonfiguration werden in der Regel innerhalb von 30–45 Tagen nach Auftragsbestätigung versendet. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage\n            machines or custom specifications may require additional time due to larger component manufacturing requirements.\n            We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Standardkonfigurationsmaschinen werden in der Regel innerhalb eines angemessenen Zeitrahmens nach Auftragsbestätigung versendet. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations\n            may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your\n            order and keep you updated throughout the manufacturing process.": "Standardkonfigurationen werden in der Regel innerhalb von 30–45 Tagen nach Auftragsbestätigung versendet. ",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days.\n            We'll provide a specific timeline when you place your order.": "Standardkonfigurationen werden in der Regel innerhalb von 30–45 Tagen versendet. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching\n            hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to\n            prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless\n            steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface\n            hardness while maintaining core toughness.": "Standard-Schwanenhalsstempel werden aus legiertem T10A-, 42CrMo- oder Cr12MoV-Stahl mit einer Abschreckhärte von HRC 47 ± 2 hergestellt. ",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us\n            for specific delivery timelines.": "Standardmodelle werden in der Regel innerhalb von 20–30 Tagen versendet. ",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear\n            resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials\n            (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness\n            extends tool life but requires careful handling to avoid chipping.": "Standardwerkzeuge für Abkantpressen haben typischerweise eine Härte von HRC 45–52, was eine hervorragende Verschleißfestigkeit bei gleichzeitiger Beibehaltung der Zähigkeit zur Vermeidung von Rissen bietet. ",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "Klingen in Standardgröße werden in der Regel innerhalb von 7–10 Werktagen versendet. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like\n            a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials.\n            Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher\n            precision.": "Schwenkbalkenscheren verwenden ein Pendelarmdesign mit einer bogenförmigen Schnittbewegung und bieten Vorteile wie einen geringeren Platzbedarf, gute Stabilität und eine schnelle Arbeitsgeschwindigkeit. ",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations\n            can be designed for various length requirements based on your specific applications.": "Tandemkonfigurationen können extralange Werkstücke verarbeiten, die weit über die Standardkapazität einer einzelnen Maschine hinausgehen. ",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses\n            CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting\n            the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "Das automatische Bombierungssystem gleicht die Durchbiegung des Rahmens aus, indem es die Tischkrümmung anpasst. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life.\n            Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions,\n            blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Die Klingen sind mit vier nutzbaren Schneiden ausgestattet, was ihre Lebensdauer deutlich verlängert. ",
  "The bundle feeder system can hold up to 1800kg of raw tube stock arranged in bundles. Tubes are\n            automatically separated and fed one by one into the four-chuck clamping system. The system is programmable\n            for different tube sizes and can operate continuously without manual intervention. This dramatically\n            increases productivity by eliminating manual loading time and allowing operators to focus on other tasks.": "Das Bündelzuführsystem kann bis zu 1800 kg Rohrohrmaterial in Bündeln lagern. ",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the\n            desired mode (plate or tube) on the control panel, and the machine automatically releases the current\n            platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and\n            installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "Die Wechselplattform nutzt ein automatisiertes Schnellwechselsystem mit präziser Positionierung. ",
  "The fiber laser tube cutter can process carbon steel, stainless steel, aluminum, copper, brass, and titanium\n            tubes. Maximum cutting thickness varies by material: carbon steel up to 8mm, stainless steel up to 6mm,\n            aluminum up to 5mm (thicknesses depend on laser power). The machine handles both coated and uncoated tubes,\n            including galvanized and powder-coated materials.": "Der Faserlaser-Rohrschneider kann Kohlenstoffstahl-, Edelstahl-, Aluminium-, Kupfer-, Messing- und Titanrohre bearbeiten. ",
  "The four-chuck clamping system provides superior stability compared to three-chuck systems. It minimizes\n            vibration during cutting, prevents tube displacement, and ensures consistent positioning accuracy of\n            High precision.\n            This is especially important for thin-walled tubes and complex cutting patterns. The pneumatic system allows\n            for quick tube changes while maintaining precise clamping force across different tube sizes.": "Das Vier-Spannfutter-Spannsystem bietet im Vergleich zu Drei-Spannfutter-Systemen eine überlegene Stabilität. ",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example,\n            2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents\n            cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider\n            die openings.": "Die allgemeine Regel besteht darin, eine V-Matrizenöffnung zu verwenden, die das 8-fache der Materialstärke beträgt (8T-Regel). ",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines.\n            Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it\n            ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and\n            dust extractors, which are shared between both modes.": "Die integrierte Maschine benötigt etwa 50 % weniger Stellfläche als separate Platten- und Rohrmaschinen. ",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines.\n            Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility\n            expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most\n            customers see ROI within 18-24 months compared to buying two separate systems.": "Die integrierte Maschine kostet in der Regel 30–40 % weniger als der Kauf separater Platten- und Rohrschneidemaschinen. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air\n            bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch\n            tip radius to the natural internal radius created by the die opening for consistent angles. Consider\n            material springback (stainless steel requires 1-2° compensation). Consult our technical team with your\n            material specifications for optimal radius selection.": "Der Stempelradius sollte mindestens 63 % der Materialstärke betragen, um Spannungskonzentrationen zu vermeiden. ",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines\n            automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both\n            controllers.": "Das System beinhaltet eine umfassende Fehlerbehandlung. ",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine\n            maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press\n            brake maintenance. We provide remote diagnostics and support.": "Das System verfügt über vorausschauende Wartungsfunktionen, die Sie warnen, bevor Probleme auftreten. ",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal\n            alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "Die torsionssynchrone Abkantpresse kann Baustahl, Edelstahl, Aluminium und andere gängige Metalllegierungen verarbeiten. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from\n            the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels\n            formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part\n            drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and\n            face width for your application.": "Die Ausladungstiefe sollte durch die Länge des Rücklaufflansches bestimmt werden, die Sie formen müssen. ",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality\n            heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials\n            reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection\n            maximize longevity. Worn tooling can be reground to restore performance.": "Die Werkzeuglebensdauer hängt vom zu biegenden Material, der Biegefrequenz, der angewandten Tonnage und der Wartung ab. ",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "Die Auswahl der Zahnteilung hängt von der gewünschten Reißfestigkeit und Perforationsqualität ab. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "Gezahnte Klingen können Papier, Pappe, Kunststofffolien, Laminate, Folien, Textilien und Spezialmaterialien perforieren. ",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more\n            economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than\n            electro-hydraulic systems, it's more reliable and requires less maintenance.": "Torsion-Synchro verwendet einen mechanischen Torsionsstab, um die Stößelbewegung zu synchronisieren, was es einfacher und wirtschaftlicher macht als hydraulische oder elektrohydraulische Systeme. ",
  "Training is actually simplified because operators learn one control system for both functions. The interface\n            is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient\n            in both modes within 3-5 days of training. The unified control system means operators don't need to learn\n            two different machines, reducing the overall training burden.": "Die Schulung wird tatsächlich vereinfacht, da die Bediener ein Steuerungssystem für beide Funktionen erlernen. ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking\n            is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative\n            metalwork, and any application where surface quality is critical. Steel dies are preferred for higher\n            production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane\n            combines both benefits.": "Verwenden Sie Urethan-Matrizen, wenn Sie vorgefertigte, vorlackierte oder polierte Materialien biegen, bei denen Oberflächenmarkierungen nicht akzeptabel sind. ",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and\n            occasional inspection of the torsion bar are typically all that's needed. The mechanical design is\n            inherently reliable.": "Es ist nur ein minimaler Wartungsaufwand erforderlich. ",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty\n            options are available. Lifetime technical support is included with all machines.": "Wir bieten eine umfassende 2-Jahres-Garantie auf alle wichtigen Komponenten und Systeme. ",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization\n            system. Extended warranty packages and dedicated support programs are available.": "Wir gewähren eine umfassende 2-Jahres-Garantie auf alle wichtigen Komponenten einschließlich des Synchronisationssystems. ",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This\n            includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended\n            warranty packages and preventive maintenance programs are available.": "Auf Hochleistungsmaschinen gewähren wir eine umfassende 3-Jahres-Garantie auf alle wichtigen Komponenten. ",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are\n            available. Technical support is provided for the life of the machine.": "Wir gewähren standardmäßig eine einjährige Garantie auf alle wichtigen Komponenten. ",
  "What are the cost savings compared to buying two separate machines?": "Wie hoch sind die Kosteneinsparungen im Vergleich zum Kauf zweier separater Maschinen?",
  "What are the main advantages of a robotic press brake?": "Was sind die Hauptvorteile einer Roboter-Abkantpresse?",
  "What are the operating costs?": "Wie hoch sind die Betriebskosten?",
  "What blade material offers the best value?": "Welches Klingenmaterial bietet das beste Preis-Leistungs-Verhältnis?",
  "What blade material should I choose for my application?": "Welches Klingenmaterial sollte ich für meine Anwendung wählen?",
  "What does \"scimitar\" mean in press brake tooling?": "Was bedeutet „Scimitar“ bei Abkantwerkzeugen?",
  "What foundation requirements are needed?": "Welche Fundamentvoraussetzungen sind erforderlich?",
  "What happens if one machine encounters an error?": "Was passiert, wenn bei einer Maschine ein Fehler auftritt?",
  "What hardness should press brake tooling have?": "Welche Härte sollten Abkantwerkzeuge haben?",
  "What information do I need to provide for a custom blade quote?": "Welche Informationen muss ich für ein individuelles Blade-Angebot angeben?",
  "What is SmartCut AI and how does it improve cutting?": "Was ist SmartCut AI und wie verbessert es das Schneiden?",
  "What is pre-bending and why is it important?": "Was ist Vorbiegen und warum ist es wichtig?",
  "What is the ROI for a robotic press brake system?": "Wie hoch ist der ROI für ein Roboter-Abkantpressensystem?",
  "What is the advantage of a four-column hydraulic press over other press types?": "Was ist der Vorteil einer Viersäulen-Hydraulikpresse gegenüber anderen Pressentypen?",
  "What is the advantage of the four-chuck clamping system?": "Was ist der Vorteil des Vier-Spannsystems?",
  "What is the difference between 3-roll and 4-roll plate rolling machines?": "Was ist der Unterschied zwischen 3-Walzen- und 4-Walzen-Blechwalzmaschinen?",
  "What is the difference between a gooseneck punch and a standard punch?": "Was ist der Unterschied zwischen einer Schwanenhalsstanze und einer Standardstanze?",
  "What is the difference between bump forming and radius tooling?": "Was ist der Unterschied zwischen Bump-Forming und Radius-Tooling?",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "Was ist der Unterschied zwischen elektrohydraulischen und hydraulischen Abkantpressen?",
  "What is the difference between guillotine and swing beam shears?": "Was ist der Unterschied zwischen Tafelschere und Pendelbalkenschere?",
  "What is the difference between single table and dual table laser cutting machines?": "Was ist der Unterschied zwischen Eintisch- und Doppeltisch-Laserschneidmaschinen?",
  "What is the difference between single table and dual table punching machines?": "Was ist der Unterschied zwischen Einzeltisch- und Doppeltisch-Stanzmaschinen?",
  "What is the difference between swing beam and guillotine shears?": "Was ist der Unterschied zwischen Schwingbalken- und Tafelschere?",
  "What is the difference between torsion-synchro and hydraulic synchronization?": "Was ist der Unterschied zwischen Torsionssynchronisation und hydraulischer Synchronisation?",
  "What is the expected delivery time?": "Was ist die voraussichtliche Lieferzeit?",
  "What is the maximum radius I can achieve on a press brake?": "Was ist der maximale Radius, den ich mit einer Abkantpresse erreichen kann?",
  "What is the maximum workpiece length a tandem system can handle?": "Welche maximale Werkstücklänge kann ein Tandemsystem verarbeiten?",
  "What is the typical delivery time?": "Was ist die typische Lieferzeit?",
  "What is the typical lead time for custom blades?": "Was ist die typische Lieferzeit für kundenspezifische Klingen?",
  "What is the typical lead time for delivery?": "Was ist die typische Vorlaufzeit für die Lieferung?",
  "What is the typical lead time?": "Was ist die typische Vorlaufzeit?",
  "What is the warranty coverage?": "Wie hoch ist der Garantieumfang?",
  "What maintenance does a fiber laser require?": "Welche Wartung erfordert ein Faserlaser?",
  "What maintenance does a hydraulic press require?": "Welche Wartung erfordert eine hydraulische Presse?",
  "What maintenance is required?": "Welche Wartung ist erforderlich?",
  "What material is best for press brake tooling?": "Welches Material eignet sich am besten für Abkantwerkzeuge?",
  "What materials and applications are suitable for four-column hydraulic presses?": "Welche Materialien und Anwendungen eignen sich für Viersäulen-Hydraulikpressen?",
  "What materials and hardness should gooseneck punches have?": "Welche Materialien und welche Härte sollten Schwanenhalsstanzen haben?",
  "What materials and thicknesses can be cut?": "Welche Materialien und Stärken können geschnitten werden?",
  "What materials and thicknesses can be rolled?": "Welche Materialien und Dicken können gewalzt werden?",
  "What materials can be bent with this machine?": "Welche Materialien können mit dieser Maschine gebogen werden?",
  "What materials can be cut with the tube laser?": "Welche Materialien können mit dem Rohrlaser geschnitten werden?",
  "What materials can be cut with these blades?": "Welche Materialien können mit diesen Klingen geschnitten werden?",
  "What materials can be cut with this machine?": "Welche Materialien können mit dieser Maschine geschnitten werden?",
  "What materials can these blades cut?": "Welche Materialien können diese Klingen schneiden?",
  "What materials can toothed blades perforate?": "Welche Materialien können mit Zahnmessern perforiert werden?",
  "What maximum material thickness can heavy-duty press brakes handle?": "Welche maximale Materialstärke vertragen Hochleistungs-Abkantpressen?",
  "What space is required for installation?": "Welcher Platzbedarf wird für die Installation benötigt?",
  "What tube shapes and sizes can the machine cut?": "Welche Rohrformen und -größen kann die Maschine schneiden?",
  "What warranty and support is provided?": "Welche Garantie und welcher Support wird gewährt?",
  "What warranty is included?": "Welche Garantie ist inbegriffen?",
  "What's the difference between European and American tooling standards?": "Was ist der Unterschied zwischen europäischen und amerikanischen Werkzeugstandards?",
  "When should I use urethane dies instead of steel?": "Wann sollte ich Urethan-Matrizen anstelle von Stahl verwenden?",
  "Which blade type should I choose for my application?": "Welchen Klingentyp sollte ich für meine Anwendung wählen?",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly\n            without interrupting production. The AI system also learns from each bending operation to\n            optimize future programs automatically.": "Mit unserer fortschrittlichen Offline-Programmiersoftware und 3D-Simulation können neue Teile schnell programmiert werden, ohne die Produktion zu unterbrechen. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending\n            operations where deep relief clearance is required. These combine the interference-free benefits of\n            gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed\n            by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming\n            tooling.": "Ja, Schwanenhalsstanzen mit spitzem Winkel (30°, 45°, 60°) sind speziell für Falz- und Spitzbiegevorgänge konzipiert, bei denen ein großer Freiraum erforderlich ist. ",
  "Yes, chipper blades can be professionally sharpened multiple times before replacement. Most blades can be resharpened 3-6 times depending on wear severity and original blade thickness. Professional sharpening services restore proper bevel angle and edge geometry. Regular sharpening before severe dulling occurs maximizes total blade life and maintains optimal chip quality. We offer sharpening services with quick turnaround.": "Ja, Hackmesser können vor dem Austausch mehrmals professionell geschärft werden. ",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "Ja, mit allen Klingenbestellungen werden umfassende Installationsanweisungen geliefert, einschließlich der richtigen Ausrichtung der Klingen, der Spalteinstellung und der Drehmomentspezifikationen. ",
  "Yes, comprehensive installation instructions, torque specifications, and maintenance guidelines are provided with blade orders. We offer technical support for proper blade installation, adjustment, and troubleshooting. Safety information and best practices documentation are included. Our technical team is available to answer questions about blade installation, sharpening schedules, and performance optimization for your specific application.": "Ja, umfassende Installationsanweisungen, Drehmomentspezifikationen und Wartungsrichtlinien werden mit der Klingenbestellung geliefert. ",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "Ja, umfassender technischer Support ist bei allen Blade-Bestellungen inbegriffen. ",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head,\n            and control system for both applications. The CNC system automatically optimizes parameters for each mode.\n            Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across\n            all operations.": "Ja, die Schnittqualität ist in beiden Modi identisch. ",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively\n            giving you two separate press brakes when tandem operation is not needed.": "Ja, jede Maschine kann für Werkstücke mit Standardlänge auf einen unabhängigen Betriebsmodus umgeschaltet werden, sodass Sie praktisch zwei separate Abkantpressen erhalten, wenn kein Tandembetrieb erforderlich ist.",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature\n            oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation.\n            Regular maintenance schedules should be followed to ensure optimal performance.": "Ja, Hochleistungs-Abkantpressen sind speziell für die kontinuierliche industrielle Produktion konzipiert. ",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "Ja, die meisten Brecherklingen können je nach Verschleißgrad und Klingendesign zwei- bis viermal professionell nachgeschliffen werden. ",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The\n            adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts\n            bending parameters for different materials including steel, stainless steel, and aluminum.": "Ja, unser Robotersystem ist äußerst flexibel und kann ein breites Spektrum an Blechgrößen und Materialien verarbeiten. ",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "Ja, unsere Rollschermesser sind für mehrere Nachschärfzyklen ausgelegt. ",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller\n            and straightforward operation make it easy to learn compared to more complex CNC systems.": "Ja, die Torsions-Synchro-Abkantpresse ist ideal für Bediener mit Grundausbildung. ",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within\n            24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Ja, wir verfügen über einen umfassenden Bestand an Ersatzteilen und Verbrauchsmaterialien. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "Ja, wir bieten die Herstellung und Prüfung von Musterblättern für kundenspezifische Anwendungen an. ",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will\n            ensure your machine is properly set up and your operators are fully trained to use it efficiently and\n            safely.": "Ja, wir bieten komplette Installationsdienste und umfassende Bedienerschulungen. ",
  "Yes, we provide comprehensive installation guidelines, blade gap adjustment procedures, and setup recommendations with every blade order. Our technical support team is available to assist with installation questions, troubleshooting, and optimization. On-site installation services are available for large orders or complex applications.": "Ja, wir stellen bei jeder Klingenbestellung umfassende Installationsrichtlinien, Verfahren zur Einstellung des Klingenspalts und Einrichtungsempfehlungen zur Verfügung. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team\n            will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting.\n            Training materials and operation manuals are also provided.": "Ja, im Rahmen unseres Installationsservice bieten wir eine umfassende Bedienerschulung an. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator\n            training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization,\n            basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Ja, wir bieten umfassende Unterstützung, einschließlich Installation vor Ort, Maschineninbetriebnahme und Bedienerschulung (normalerweise 3–5 Tage). ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance,\n            and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment,\n            safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "Ja, wir bieten umfassenden Support, einschließlich Installation vor Ort, Maschineninbetriebnahme, Beratung zu Fundamentanforderungen und Bedienerschulung. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius\n            dimensions, material specifications, production volume, and part drawings. Our engineering team will\n            design custom arc molds optimized for your specific application. Custom tooling is particularly\n            cost-effective for high-volume production runs requiring consistent radius specifications not available\n            in standard tooling catalogs.": "Ja, wir sind auf kundenspezifische Radiuswerkzeuge für einzigartige Anwendungen spezialisiert. ",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings,\n            material specifications, and bend requirements. Our engineering team will design custom dies for U-channels,\n            Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results\n            for high-volume production runs.": "Ja, wir sind auf kundenspezifische Werkzeuge für einzigartige Biegeanwendungen spezialisiert. ",
  "Yes, with the optional bevel cutting head upgrade, our tube laser can cut various bevel angles for pipe\n            welding preparation. The system can create V-grooves, K-grooves, and other weld joint configurations at\n            precise angles. This eliminates the need for secondary beveling operations and ensures perfect fit-up for\n            welding. The SmartCut AI system automatically calculates optimal cutting paths for complex bevel geometries.": "Ja, mit dem optionalen Fasenschneidkopf-Upgrade kann unser Rohrlaser verschiedene Fasenwinkel zur Rohrschweißvorbereitung schneiden. ",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting\n            the roll positions to create a gradual taper. The CNC system calculates the required roll positions for\n            the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and\n            conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "Ja, mit der optionalen konischen Rollvorrichtung können unsere Maschinen konische Formen herstellen, indem sie die Rollenpositionen anpassen, um eine allmähliche Verjüngung zu erzeugen. "
}