{
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar\n            sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel\n            formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both\n            deep relief clearance and offset capability for the most challenging box and channel forming operations.": "\"Cimitarra\" o \"sable\" se refiere a un diseño de perfil curvo y desplazado similar a la hoja curva de una espada cimitarra. ",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the\n            leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and\n            efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They\n            produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision\n            work and thick plate rolling.": "Las máquinas de 3 rodillos son más económicas y adecuadas para aplicaciones generales, pero requieren doblar previamente el borde principal por separado y pueden dejar bordes rectos más largos. ",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing\n            flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to\n            form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing\n            the punch from hitting previously formed flanges, making them essential for box forming, door frames,\n            and channel bending applications.": "Un punzón de cuello de cisne presenta un diseño de relieve profundo (perfil desplazado) que proporciona espacio para bridas existentes y geometrías de caja profunda. ",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day.\n            Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to\n            switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production\n            orders without significant downtime.": "¡Absolutamente! ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications.\n            Provide part drawings showing flange dimensions, bend angles, material specifications, and production\n            volume. Our engineering team will design custom gooseneck tooling optimized for your specific application,\n            including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom\n            tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "Absolutamente. ",
  "Are spare parts readily available?": "¿Hay repuestos fácilmente disponibles?",
  "Blade life depends on material being cut, cutting speed, and maintenance practices. Our HSS blades typically last 5-10 times longer than standard blades. In metal slitting applications, expect hundreds of thousands of linear meters before re-sharpening is needed. Proper lubrication and regular inspection extend blade life significantly.": "La vida útil de la hoja depende del material que se corta, la velocidad de corte y las prácticas de mantenimiento. ",
  "Blade life depends on material being cut, thickness, frequency of use, and maintenance. With four usable edges, our blades can last 4 times longer than single-edge blades. Typical service life ranges from tens of thousands to hundreds of thousands of cuts. Proper blade gap adjustment and regular rotation extend blade life significantly.": "La vida útil de la hoja depende del material que se corta, el grosor, la frecuencia de uso y el mantenimiento. ",
  "Blade life depends on material type, crusher speed, and blade material. High-speed steel blades typically last 150-300 hours of continuous operation. Hard alloy (carbide-tipped) blades can reach 800-1200 hours when avoiding metal impurities. Proper maintenance, avoiding metal contaminants, and regular blade inspection maximize service life. We recommend keeping spare blade sets for minimal downtime.": "La vida útil de la hoja depende del tipo de material, la velocidad de la trituradora y el material de la hoja. ",
  "Blade life varies significantly based on material processed, production speed, and tooth design. HSS blades typically last from hundreds of thousands to millions of linear feet in paper applications. Carbide blades can last 5-10 times longer than HSS. Proper setup, blade pressure, and regular inspection maximize blade life. We provide expected life estimates based on your specific application.": "La vida útil de la hoja varía significativamente según el material procesado, la velocidad de producción y el diseño de los dientes. ",
  "Blade life varies significantly based on wood type, material diameter, presence of dirt/rocks, and maintenance practices. In clean wood applications, chromium steel blades typically last 150-300 hours of continuous operation. Carbide-inlay blades can last 800-1200 hours when avoiding metal contaminants. Proper blade maintenance, rotation, and avoiding dirt-contaminated wood maximize blade life.": "La vida útil de la hoja varía significativamente según el tipo de madera, el diámetro del material, la presencia de tierra/rocas y las prácticas de mantenimiento. ",
  "Blade selection depends on your machine specifications, material type, and cutting requirements. Key factors include outer diameter (matching machine arbor spacing), bore size (matching arbor diameter), and blade thickness (based on slitting precision needs). Our technical team can help specify the optimal configuration for your application.": "La selección de la hoja depende de las especificaciones de su máquina, el tipo de material y los requisitos de corte. ",
  "Blades with minor wear can sometimes be professionally re-ground to restore cutting performance. However, deep nicks, cracks, or severe wear typically require replacement. Re-grinding reduces blade dimensions and may affect machine blade gap settings. We offer professional blade inspection services to determine if re-grinding is cost-effective for your situation.": "Las hojas con un desgaste menor a veces se pueden volver a afilar profesionalmente para restaurar el rendimiento de corte. ",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through\n            multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling\n            uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump\n            forming is cost-effective for occasional large radius work, while dedicated radius tooling provides\n            superior surface finish and faster production for regular radius bending applications.": "El conformado por relieve utiliza troqueles en V estándar y punzones con programación CNC para crear arcos de gran radio a través de múltiples curvaturas incrementales pequeñas (aproximando el arco con segmentos lineales). ",
  "Can I process both plates and tubes in the same production run?": "¿Puedo procesar placas y tubos en la misma producción?",
  "Can chipper blades be sharpened and reused?": "¿Se pueden afilar y reutilizar las cuchillas de la trituradora?",
  "Can crusher blades be sharpened and reused?": "¿Se pueden afilar y reutilizar las cuchillas de la trituradora?",
  "Can damaged blades be repaired or re-sharpened?": "¿Se pueden reparar o reafilar las cuchillas dañadas?",
  "Can gooseneck punches be used for hemming operations?": "¿Se pueden utilizar punzones de cuello de cisne para operaciones de dobladillo?",
  "Can the machine cut bevels for pipe welding?": "¿Puede la máquina cortar biseles para soldar tuberías?",
  "Can the machine roll conical shapes?": "¿Puede la máquina rodar formas cónicas?",
  "Can the machines operate independently?": "¿Pueden las máquinas funcionar de forma independiente?",
  "Can the system handle different sheet sizes and materials?": "¿Puede el sistema manejar diferentes tamaños de láminas y materiales?",
  "Can these blades be re-sharpened?": "¿Se pueden volver a afilar estas cuchillas?",
  "Can these machines run 24/7?": "¿Pueden estas máquinas funcionar 24 horas al día, 7 días a la semana?",
  "Can toothed blades be re-sharpened?": "¿Se pueden reafilar las hojas dentadas?",
  "Can you manufacture custom profile dies?": "¿Pueden fabricar troqueles de perfil personalizados?",
  "Can you manufacture custom radius profiles?": "¿Pueden fabricar perfiles de radio personalizados?",
  "Check your chipper's operator manual for blade specifications including length, width, thickness, and bolt hole pattern. Measure existing blades if manual is unavailable. Provide chipper brand and model number - we maintain specifications for most major brands (Vermeer, Bandit, Morbark, etc.). Send us photos or measurements of existing blades for confirmation. We can cross-reference and provide exact replacement blades.": "Consulte el manual del operador de su astilladora para conocer las especificaciones de la hoja, incluidos el largo, el ancho, el grosor y el patrón de orificios para los pernos. ",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength,\n            wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium\n            HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production\n            volume, material being bent, and required tool life.": "El acero al cromo molibdeno (42CrMo, Cr12MoV) es el estándar de la industria y ofrece resistencia excepcional, resistencia al desgaste y protección contra la corrosión. ",
  "Common questions about our": "Preguntas comunes sobre nuestro",
  "Contact our support team": "Contacta con nuestro equipo de soporte",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick,\n            stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage,\n            working length, and material properties.": "Dependiendo del tonelaje y el tipo de material, las plegadoras de servicio pesado pueden doblar acero dulce de hasta 50 mm de espesor, acero inoxidable de hasta 30 mm y aluminio de hasta 40 mm. ",
  "Do I need special skills to operate a robotic system?": "¿Necesito habilidades especiales para operar un sistema robótico?",
  "Do you manufacture custom gooseneck profiles?": "¿Fabrican perfiles de cuello de cisne personalizados?",
  "Do you offer sample testing before production orders?": "¿Ofrecen pruebas de muestra antes de los pedidos de producción?",
  "Do you offer technical support and installation guidance?": "¿Ofrecen soporte técnico y orientación de instalación?",
  "Do you provide installation and maintenance guidance?": "¿Ofrecen orientación sobre instalación y mantenimiento?",
  "Do you provide installation and setup guidance?": "¿Ofrecen orientación sobre instalación y configuración?",
  "Do you provide installation and setup support?": "¿Ofrecen soporte de instalación y configuración?",
  "Do you provide installation and training?": "¿Ofrecen instalación y capacitación?",
  "Double table machines typically achieve 40-50% higher productivity than single table machines. The automatic\n            table exchange takes only rapid, and while one table is cutting, the operator can load/unload the other\n            table simultaneously. This eliminates material loading downtime and enables continuous 24/7 operation, making\n            it ideal for high-volume production environments.": "Las máquinas de doble mesa suelen alcanzar una productividad entre un 40 y un 50 % mayor que las máquinas de una sola mesa. ",
  "Download PDF": "Descargar PDF",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between\n            cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also\n            consume less energy and provide faster response times.": "Las prensas plegadoras electrohidráulicas utilizan un sistema de control electrónico para una sincronización precisa entre cilindros, lo que ofrece mayor precisión y repetibilidad en comparación con los sistemas hidráulicos tradicionales. ",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized\n            clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical\n            or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American\n            systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "Las herramientas europeas (sistemas Wila, Amada, Trumpf) utilizan herramientas segmentadas de cambio rápido con sistemas de sujeción estandarizados para una configuración rápida. ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning\n            protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction\n            filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser\n            gas refills or mirror alignments are needed.": "Los láseres de fibra prácticamente no requieren mantenimiento en comparación con los láseres de CO2. ",
  "Flat blades work best for thin-walled products (under 3mm) like bottles and films, offering higher output. Claw type blades are ideal for thick materials and provide aggressive cutting action. Flake type is versatile for general-purpose applications. V type offers precision cutting for specialty materials. Our technical team can recommend the optimal blade type based on your specific material characteristics and production requirements.": "Las hojas planas funcionan mejor para productos de paredes delgadas (menos de 3 mm), como botellas y películas, y ofrecen un mayor rendimiento. ",
  "For accurate custom quotes, provide: blade outer diameter, inner diameter (bore size), hub thickness, desired tooth pitch, tooth profile type if known, material being processed, material thickness, production speed, and any special requirements. Technical drawings or samples of existing blades are extremely helpful. Our team can work from minimal information to develop complete specifications.": "Para obtener cotizaciones personalizadas precisas, proporcione: diámetro exterior de la hoja, diámetro interior (tamaño del orificio), espesor del cubo, paso de diente deseado, tipo de perfil de diente si lo conoce, material que se está procesando, espesor del material, velocidad de producción y cualquier requisito especial. ",
  "For general mild steel cutting, Cr12MoV or 6CrW2Si provides excellent performance and value. For stainless steel and harder materials, consider high-speed steel (HSS) or tungsten carbide. For high-volume production, premium materials offer better long-term cost-effectiveness despite higher initial cost. Our technical team can recommend optimal materials based on your specific application.": "Para el corte general de acero dulce, Cr12MoV o 6CrW2Si proporcionan un excelente rendimiento y valor. ",
  "For occasional use or soft plastics, high carbon steel provides good value. For commercial operations, 9CrSi or SKD11 alloy steel offers excellent balance of performance and cost. For high-volume production or abrasive materials, consider D2 tool steel or carbide-tipped blades despite higher initial cost - their extended life often provides better total cost of ownership. We can help analyze your specific ROI based on production volume and material type.": "Para uso ocasional o plásticos blandos, el acero con alto contenido de carbono ofrece una buena relación calidad-precio. ",
  "For occasional use with clean wood, carbon steel offers good value. For professional/commercial operations, chromium steel (8%+ Cr) provides the best balance of performance and cost. For high-volume production or abrasive applications, consider premium tool steels. Carbide-inlay blades are recommended for maximum productivity in continuous operations despite higher initial cost. Our team can recommend optimal materials based on your specific usage patterns.": "Para uso ocasional con madera limpia, el acero al carbono ofrece una buena relación calidad-precio. ",
  "Four-column hydraulic presses feature four guide posts that ensure even force distribution across the entire workpiece,\n            eliminating deflection and tilting common in single-column or C-frame presses. This design is critical for deep drawing,\n            metal forming, and composite molding where uneven pressure can compromise part quality. The four-column structure also\n            provides superior stability and precision for high-tonnage applications.": "Las prensas hidráulicas de cuatro columnas cuentan con cuatro postes guía que garantizan una distribución uniforme de la fuerza en toda la pieza de trabajo, eliminando la deflexión y la inclinación comunes en las prensas de una sola columna o con marco en C. ",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Get detailed technical specifications, dimensions, and performance data": "Obtenga especificaciones técnicas detalladas, dimensiones y datos de rendimiento",
  "Guillotine shears use a vertical blade motion that descends straight down, providing higher precision and\n            the ability to cut thicker materials. They produce minimal material waste and are ideal for\n            applications requiring high accuracy. Swing beam shears use an arc-shaped cutting motion, offer a smaller\n            footprint, and are better suited for thinner materials.": "Las cizallas de guillotina utilizan un movimiento de hoja vertical que desciende hacia abajo, lo que proporciona mayor precisión y la capacidad de cortar materiales más gruesos. ",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days\n            depending on tonnage, configuration, and optional features. Rush delivery may be available for certain\n            configurations.": "Las plegadoras de servicio pesado generalmente se diseñan a medida según las especificaciones. ",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and\n            operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick\n            concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "Las plegadoras de servicio pesado requieren cimientos de hormigón armado debido a su importante peso y fuerzas operativas. ",
  "How accurate is the bending process?": "¿Qué tan preciso es el proceso de doblado?",
  "How accurate is the synchronization between the two machines?": "¿Qué tan precisa es la sincronización entre las dos máquinas?",
  "How do I find the right blade size for my chipper?": "¿Cómo encuentro el tamaño de hoja adecuado para mi astilladora?",
  "How do I know when blades need replacement?": "¿Cómo sé cuándo es necesario reemplazar las cuchillas?",
  "How do I know when blades need to be replaced or sharpened?": "¿Cómo sé cuándo es necesario reemplazar o afilar las cuchillas?",
  "How do I know when to rotate or replace blades?": "¿Cómo sé cuándo rotar o reemplazar las cuchillas?",
  "How do I minimize springback in radius bending?": "¿Cómo minimizo el retorno elástico en la flexión del radio?",
  "How do I select the correct V-die opening?": "¿Cómo selecciono la apertura correcta del troquel en V?",
  "How do I select the correct blade size?": "¿Cómo selecciono el tamaño de hoja correcto?",
  "How do I select the correct radius for my application?": "¿Cómo selecciono el radio correcto para mi aplicación?",
  "How do I select the correct throat depth for my gooseneck punch?": "¿Cómo selecciono la profundidad de garganta correcta para mi golpe de cuello de cisne?",
  "How do I select the correct tooth pitch for my application?": "¿Cómo selecciono el paso de dientes correcto para mi aplicación?",
  "How does the 10-second exchange platform work?": "¿Cómo funciona la plataforma de intercambio de 10 segundos?",
  "How does the automatic tube feeding system work?": "¿Cómo funciona el sistema de alimentación automática por sonda?",
  "How does the crowning system work?": "¿Cómo funciona el sistema de coronación?",
  "How long do chipper blades typically last?": "¿Cuánto duran normalmente las cuchillas de las trituradoras?",
  "How long do crusher blades typically last?": "¿Cuánto duran normalmente las cuchillas de la trituradora?",
  "How long do rolling shear blades typically last?": "¿Cuánto duran normalmente las hojas de cizalla rodantes?",
  "How long do shearing machine blades last?": "¿Cuánto duran las cuchillas de la máquina cortadora?",
  "How long do toothed blades last?": "¿Cuánto duran las hojas dentadas?",
  "How long does installation and commissioning take?": "¿Cuánto tiempo lleva la instalación y la puesta en marcha?",
  "How long does it take to program new parts?": "¿Cuánto tiempo lleva programar piezas nuevas?",
  "How long does press brake tooling last?": "¿Cuánto duran las herramientas de la plegadora?",
  "How long is the warranty period?": "¿Cuánto dura el período de garantía?",
  "How much faster is a double table machine compared to single table?": "¿Cuánto más rápida es una máquina de doble mesa en comparación con una de una sola mesa?",
  "How much maintenance does it require?": "¿Cuánto mantenimiento requiere?",
  "How often do the blades need to be replaced?": "¿Con qué frecuencia es necesario reemplazar las cuchillas?",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and\n            synchronization testing. We provide comprehensive on-site commissioning and operator training.": "La instalación normalmente requiere de 2 a 3 semanas, incluido el posicionamiento de la máquina, la configuración de la red, la calibración y las pruebas de sincronización. ",
  "Is cutting quality the same in both modes?": "¿La calidad de corte es la misma en ambos modos?",
  "Is it suitable for beginners?": "¿Es adecuado para principiantes?",
  "Is operator training more complex for the integrated machine?": "¿La formación del operador es más compleja para la máquina integrada?",
  "Is training and installation support provided?": "¿Se proporciona capacitación y soporte de instalación?",
  "Is training provided for operators?": "¿Se proporciona capacitación a los operadores?",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches\n            typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii\n            exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending.\n            Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "El radio máximo alcanzable depende del ancho de la mesa plegadora y del sistema de herramientas. ",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap\n            rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part\n            complexity, and current labor costs.": "La mayoría de los clientes obtienen un retorno de la inversión rápidamente gracias al ahorro de mano de obra, el aumento de la productividad, la reducción de las tasas de desperdicio y la capacidad de ejecutar turnos sin personal. ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion),\n            assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables\n            (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power\n            consumption and minimal maintenance requirements.": "Los costos operativos incluyen electricidad (los láseres de fibra son altamente eficientes con ~30% de conversión electroóptica), gas auxiliar (nitrógeno, oxígeno o aire comprimido), electricidad para enfriadores de agua y consumibles ocasionales (lentes protectoras, boquillas). ",
  "Operating costs include electricity for the hydraulic pump motor (power requirements vary by tonnage), hydraulic oil\n            (periodic replacements), filter replacements, lubrication, and occasional seal replacements. Four-column\n            hydraulic presses with dual-speed systems are energy-efficient, using full power only during the forming cycle\n            while consuming minimal energy during fast approach and return strokes.": "Los costos operativos incluyen electricidad para el motor de la bomba hidráulica (los requisitos de energía varían según el tonelaje), aceite hidráulico (reemplazos periódicos), reemplazos de filtros, lubricación y reemplazos ocasionales de sellos. ",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum,\n            copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Nuestras máquinas dobladoras CNC pueden procesar diversos materiales, incluidos acero dulce, acero inoxidable, aluminio, cobre y otras aleaciones metálicas. ",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency.\n            The CNC system allows precise control of roll positions and automatically calculates the correct settings\n            based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in\n            real-time to maintain consistent quality throughout the operation.": "Nuestras máquinas roladoras de placas controladas por CNC logran una alta precisión de doblado para lograr consistencia en el diámetro. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and\n            12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and titanium.": "Nuestras máquinas de corte por láser de fibra pueden cortar varios espesores de acero al carbono, acero inoxidable, aluminio y 12 mm, y cobre/latón hasta 8 mm (los espesores varían según la potencia del láser). ",
  "Our guillotine shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper, brass, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "Nuestras máquinas cortadoras de guillotina pueden procesar diversos materiales metálicos, incluidos acero dulce, acero inoxidable, aluminio, cobre, latón y otras láminas de metal. ",
  "Our hydraulic presses handle a wide range of materials including steel, stainless steel, aluminum, copper, brass,\n            plastics, rubber, and composite materials. Common applications include metal stamping, deep drawing, bending, blanking,\n            powder metallurgy compacting, plastic and rubber molding, and forging. Tonnage capacity is selected based\n            on material type, thickness, and forming operation requirements.": "Nuestras prensas hidráulicas manejan una amplia gama de materiales, incluidos acero, acero inoxidable, aluminio, cobre, latón, plásticos, caucho y materiales compuestos. ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile\n            metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength.\n            Softer materials and those with higher ductility are easier to roll to smaller diameters.": "Nuestras máquinas laminadoras de placas pueden procesar acero al carbono, acero inoxidable, aleaciones de aluminio y otros metales dúctiles. ",
  "Our punching machines can process various thicknesses of carbon steel, stainless steel, aluminum,\n            and copper/brass (thicknesses vary based on machine capacity). Higher tonnage machines can process\n            thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel,\n            aluminum alloys, copper, brass, and other sheet metals.": "Nuestras punzonadoras pueden procesar varios espesores de acero al carbono, acero inoxidable, aluminio y cobre/latón (los espesores varían según la capacidad de la máquina). ",
  "Our rolling shear blades handle a wide range of materials including steel, stainless steel, aluminum, copper, brass, plastic films, paper, cardboard, rubber, foam, textiles, and composite materials. Material thickness and hardness determine optimal blade specification. Contact us for application-specific recommendations.": "Nuestras cuchillas de corte rodantes manejan una amplia gama de materiales, incluidos acero, acero inoxidable, aluminio, cobre, latón, películas plásticas, papel, cartón, caucho, espuma, textiles y materiales compuestos. ",
  "Our shearing blades can cut mild steel, stainless steel, aluminum, copper, brass, and other metal alloys. The maximum cutting thickness depends on material hardness and machine capacity. Standard blades handle materials up to 50mm thick in mild steel. For harder materials like stainless steel, specialized blade materials are recommended.": "Nuestras hojas de corte pueden cortar acero dulce, acero inoxidable, aluminio, cobre, latón y otras aleaciones metálicas. ",
  "Our swing beam shearing machines can process various metal materials including mild steel, stainless steel,\n            aluminum, copper plates, and other metal sheets. The maximum thickness depends on the material type and\n            machine model. Please contact us for specific capacity options for your application.": "Nuestras máquinas cizallas de viga oscilante pueden procesar diversos materiales metálicos, incluidos acero dulce, acero inoxidable, aluminio, placas de cobre y otras láminas de metal. ",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide\n            comprehensive training for operators and programmers. Most operators become proficient with basic operations\n            within a short training period.": "Nuestro sistema presenta una interfaz intuitiva que requiere conocimientos mínimos de robótica. ",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced\n            sensors continuously monitor and adjust for perfect coordination between both machines.": "Nuestros sistemas tándem mantienen una precisión de sincronización excepcional durante todo el proceso de plegado. ",
  "Our tube laser cutting machines can process round, square, rectangular, and oval tubes. Standard capacity\n            ranges from customizable diameter, with optional upgrades available for tubes larger diameter options. The machine\n            can handle tube lengths up to Customizable length (standard) with extended options up to 12000mm. Wall thicknesses depend\n            on laser power and material type.": "Nuestras máquinas de corte por láser de tubos pueden procesar tubos redondos, cuadrados, rectangulares y ovalados. ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling\n            operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our\n            4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing\n            and reinserting the plate, which saves time and improves quality.": "El predoblado es el proceso de doblar los bordes delantero y trasero de la placa antes de la operación principal de laminado. ",
  "Q:": "P:",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear,\n            lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system\n            should be serviced annually with oil changes and filter replacements. With proper maintenance, our\n            machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and\n            training with each machine.": "El mantenimiento regular incluye verificar los niveles y la calidad del aceite hidráulico, inspeccionar las superficies de los rodillos en busca de desgaste, lubricar los cojinetes y las piezas móviles y verificar la alineación del sistema de rodillos. ",
  "Regular maintenance includes: checking hydraulic oil levels and quality (periodic oil changes), inspecting\n            hydraulic hoses and connections for leaks, cleaning or replacing filters, lubricating guide posts and linear bearings,\n            checking pressure gauges and control valves. The hydraulic pump and motor should be inspected periodically. Proper\n            maintenance ensures reliable operation and extends machine lifespan for many years.": "El mantenimiento regular incluye: verificar los niveles y la calidad del aceite hidráulico (cambios periódicos de aceite), inspeccionar las mangueras y conexiones hidráulicas en busca de fugas, limpiar o reemplazar filtros, lubricar postes guía y cojinetes lineales, verificar manómetros y válvulas de control. ",
  "Regular maintenance is simple and straightforward: check hydraulic oil levels weekly, clean the machine\n            daily, lubricate moving parts according to the schedule, and inspect blade condition regularly. We provide\n            a detailed maintenance guide and schedule. Most routine maintenance can be performed by operators.": "El mantenimiento regular es simple y directo: verifique los niveles de aceite hidráulico semanalmente, limpie la máquina diariamente, lubrique las piezas móviles según el cronograma e inspeccione el estado de la hoja con regularidad. ",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality,\n            significantly increased productivity, reduced labor costs, enhanced safety by removing operators from\n            hazardous zones, and the ability to automate complex multi-bend sequences.": "Las plegadoras robóticas ofrecen ventajas significativas que incluyen operación no tripulada las 24 horas del día, los 7 días de la semana, calidad constante, productividad significativamente mayor, costos de mano de obra reducidos, mayor seguridad al retirar a los operadores de zonas peligrosas y la capacidad de automatizar secuencias complejas de múltiples plegados.",
  "Signs include increased burring, rough cut edges, visible nicks or chips in the cutting edge, increased cutting force required, or material deformation. When these occur, rotate the blade to use a fresh edge. Replace when all four edges show significant wear. Regular visual inspection after every shift helps maintain optimal cutting quality.": "Los signos incluyen aumento de rebabas, bordes de corte ásperos, mellas o astillas visibles en el borde de corte, mayor fuerza de corte requerida o deformación del material. ",
  "Signs include increased particle size, uneven granulation, higher power consumption, excessive noise, visible blade damage or rounding, and reduced throughput. Inspect blades every 50-100 operating hours. Replace when cutting edges show significant wear or if output quality declines. Preventive replacement before complete failure minimizes downtime and maintains consistent product quality.": "Los signos incluyen aumento del tamaño de las partículas, granulación desigual, mayor consumo de energía, ruido excesivo, daños o redondeos visibles en las cuchillas y rendimiento reducido. ",
  "Signs include larger chip sizes, increased power consumption, excessive fines or dust, visible edge rounding or nicks, and increased feeding force required. Inspect blades every 50-100 operating hours for wear. Replace or sharpen when cutting edge shows significant rounding or if nicks exceed 3mm depth. Rotating blade positions during inspection helps ensure even wear across all cutting edges.": "Los signos incluyen chips de mayor tamaño, mayor consumo de energía, exceso de finos o polvo, bordes redondeados o melladuras visibles y mayor fuerza de alimentación requerida. ",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "Las máquinas de corte por láser de mesa única tienen una mesa de trabajo fija, lo que ofrece una solución más económica adecuada para volúmenes de producción bajos a medios. ",
  "Single table punching machines have one fixed working table, offering a more economical solution suitable\n            for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for\n            continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing\n            productivity by reducing idle time.": "Las punzonadoras de mesa única tienen una mesa de trabajo fija, lo que ofrece una solución más económica adecuada para volúmenes de producción bajos a medios. ",
  "SmartCut AI is our intelligent control system that automatically optimizes cutting parameters in real-time.\n            It analyzes tube geometry, material characteristics, and wall thickness to adjust laser power, cutting\n            speed,\n            and focal position. This reduces material waste by up to 18%, improves edge quality, and minimizes operator\n            skill requirements. The system also includes automatic nesting software to maximize material utilization.": "SmartCut AI es nuestro sistema de control inteligente que optimiza automáticamente los parámetros de corte en tiempo real. ",
  "Some toothed blade designs can be re-sharpened, while others are designed for replacement. Rotary toothed blades with simple tooth profiles can often be professionally re-ground. Complex tooth patterns or very fine pitches typically require replacement. Re-sharpening feasibility depends on original tooth depth, wear patterns, and dimensional requirements. We offer evaluation services to determine if re-sharpening is cost-effective.": "Algunos diseños de hojas dentadas se pueden volver a afilar, mientras que otros están diseñados para ser reemplazados. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback:\n            use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom\n            bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening\n            to reduce stress, and consider coining for zero springback applications. Material-specific springback\n            tables help predict and compensate for springback in production.": "La recuperación elástica aumenta con la dureza del material y disminuye con un radio de curvatura mayor. ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications\n            or higher power configurations may require 45-60 days. We provide regular production updates and coordinate\n            logistics to ensure smooth delivery and installation.": "Las máquinas de configuración estándar generalmente se envían entre 30 y 45 días después de la confirmación del pedido. ",
  "Standard configuration machines typically ship within a reasonable timeframe after order confirmation. Higher tonnage\n            machines or custom specifications may require additional time due to larger component manufacturing requirements.\n            We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Las máquinas de configuración estándar generalmente se envían dentro de un plazo razonable después de la confirmación del pedido. ",
  "Standard configurations typically ship within 30-45 days from order confirmation. Custom configurations\n            may require 60-90 days depending on specifications. We'll provide a specific timeline when you place your\n            order and keep you updated throughout the manufacturing process.": "Las configuraciones estándar generalmente se envían dentro de 30 a 45 días desde la confirmación del pedido. ",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days.\n            We'll provide a specific timeline when you place your order.": "Las configuraciones estándar normalmente se envían en un plazo de 30 a 45 días. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching\n            hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to\n            prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless\n            steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface\n            hardness while maintaining core toughness.": "Los punzones de cuello de cisne estándar se fabrican con acero de aleación T10A, 42CrMo o Cr12MoV con una dureza de enfriamiento de HRC 47±2. ",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us\n            for specific delivery timelines.": "Los modelos estándar suelen enviarse en un plazo de 20 a 30 días. ",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear\n            resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials\n            (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness\n            extends tool life but requires careful handling to avoid chipping.": "Las herramientas estándar para plegadoras suelen tener una dureza de HRC 45-52, lo que proporciona una excelente resistencia al desgaste y al mismo tiempo mantiene la tenacidad para evitar grietas. ",
  "Standard size blades typically ship within 7-10 business days. Custom configurations require 2-4 weeks depending on specifications and quantity. Large volume orders may require additional production time. We maintain inventory of popular sizes for immediate shipment. Rush orders can be accommodated in many cases.": "Las hojas de tamaño estándar normalmente se envían en un plazo de 7 a 10 días hábiles. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Swing beam shears use a pendulum arm design with an arc-shaped cutting motion, offering advantages like\n            a smaller footprint, good stability, and fast working speed. They are ideal for thin to medium thickness materials.\n            Guillotine shears use a vertical blade motion and are better suited for thicker materials requiring higher\n            precision.": "Las cizallas con viga oscilante utilizan un diseño de brazo pendular con un movimiento de corte en forma de arco, lo que ofrece ventajas como una huella más pequeña, buena estabilidad y una velocidad de trabajo rápida. ",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations\n            can be designed for various length requirements based on your specific applications.": "Las configuraciones en tándem pueden manejar piezas de trabajo extralargas mucho más allá de la capacidad estándar de una sola máquina. ",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses\n            CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting\n            the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "El sistema de coronación automático compensa la deflexión del marco ajustando la curvatura de la mesa. ",
  "The blades are designed with four usable cutting edges, which significantly extends their service life.\n            Blade life depends on material type, thickness, and cutting frequency. Under normal operating conditions,\n            blades can last for tens of thousands of cuts before requiring rotation or replacement.": "Las hojas están diseñadas con cuatro filos de corte utilizables, lo que prolonga significativamente su vida útil. ",
  "The bundle feeder system can hold up to 1800kg of raw tube stock arranged in bundles. Tubes are\n            automatically separated and fed one by one into the four-chuck clamping system. The system is programmable\n            for different tube sizes and can operate continuously without manual intervention. This dramatically\n            increases productivity by eliminating manual loading time and allowing operators to focus on other tasks.": "El sistema de alimentación de haces puede contener hasta 1800 kg de material de tubos sin procesar dispuestos en haces. ",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the\n            desired mode (plate or tube) on the control panel, and the machine automatically releases the current\n            platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and\n            installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "La plataforma de intercambio utiliza un sistema automatizado de cambio rápido con posicionamiento de precisión. ",
  "The fiber laser tube cutter can process carbon steel, stainless steel, aluminum, copper, brass, and titanium\n            tubes. Maximum cutting thickness varies by material: carbon steel up to 8mm, stainless steel up to 6mm,\n            aluminum up to 5mm (thicknesses depend on laser power). The machine handles both coated and uncoated tubes,\n            including galvanized and powder-coated materials.": "El cortador de tubos por láser de fibra puede procesar tubos de acero al carbono, acero inoxidable, aluminio, cobre, latón y titanio. ",
  "The four-chuck clamping system provides superior stability compared to three-chuck systems. It minimizes\n            vibration during cutting, prevents tube displacement, and ensures consistent positioning accuracy of\n            High precision.\n            This is especially important for thin-walled tubes and complex cutting patterns. The pneumatic system allows\n            for quick tube changes while maintaining precise clamping force across different tube sizes.": "El sistema de sujeción de cuatro mandriles proporciona una estabilidad superior en comparación con los sistemas de tres mandriles. ",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example,\n            2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents\n            cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider\n            die openings.": "La regla general es utilizar una abertura de matriz en V que sea 8 veces el espesor del material (regla 8T). ",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines.\n            Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it\n            ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and\n            dust extractors, which are shared between both modes.": "La máquina integrada requiere aproximadamente un 50% menos de espacio que las máquinas de placas y tubos separadas. ",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines.\n            Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility\n            expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most\n            customers see ROI within 18-24 months compared to buying two separate systems.": "La máquina integrada suele costar entre un 30 y un 40 % menos que comprar máquinas cortadoras de placas y tubos por separado. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air\n            bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch\n            tip radius to the natural internal radius created by the die opening for consistent angles. Consider\n            material springback (stainless steel requires 1-2° compensation). Consult our technical team with your\n            material specifications for optimal radius selection.": "El radio del punzón debe ser al menos el 63% del espesor del material para evitar la concentración de tensiones. ",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines\n            automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both\n            controllers.": "El sistema incluye un manejo integral de errores. ",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine\n            maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press\n            brake maintenance. We provide remote diagnostics and support.": "El sistema incluye capacidades de mantenimiento predictivo que le alertan antes de que ocurran problemas. ",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal\n            alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "La prensa plegadora sincronizada por torsión puede procesar acero dulce, acero inoxidable, aluminio y otras aleaciones metálicas comunes. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from\n            the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels\n            formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part\n            drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and\n            face width for your application.": "La profundidad de la garganta debe estar determinada por la longitud de la brida de retorno que necesita formar. ",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality\n            heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials\n            reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection\n            maximize longevity. Worn tooling can be reground to restore performance.": "La vida útil de la herramienta depende del material que se dobla, la frecuencia de doblado, el tonelaje aplicado y el mantenimiento. ",
  "Tooth pitch selection depends on your desired tear strength and perforation quality. Smaller pitch (closer teeth) creates easier tear-off with lower strength. Larger pitch provides stronger material between perforations. Our engineering team can recommend optimal pitch based on material type, thickness, and end-use requirements. Sample testing is available to verify performance.": "La selección del paso de los dientes depende de la resistencia al desgarro y la calidad de perforación deseadas. ",
  "Toothed blades can perforate paper, cardboard, plastic films, laminates, foils, textiles, and specialty materials. Material capability depends on blade material and tooth design. HSS blades handle most paper and plastic applications. Carbide blades are recommended for abrasive materials, coated substrates, or high-volume production requiring extended blade life.": "Las hojas dentadas pueden perforar papel, cartón, películas plásticas, laminados, láminas, textiles y materiales especiales. ",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more\n            economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than\n            electro-hydraulic systems, it's more reliable and requires less maintenance.": "Torsion-synchro utiliza una barra de torsión mecánica para sincronizar el movimiento del ariete, lo que lo hace más simple y económico que los sistemas hidráulicos o electrohidráulicos. ",
  "Training is actually simplified because operators learn one control system for both functions. The interface\n            is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient\n            in both modes within 3-5 days of training. The unified control system means operators don't need to learn\n            two different machines, reducing the overall training burden.": "En realidad, la formación se simplifica porque los operadores aprenden un sistema de control para ambas funciones. ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking\n            is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative\n            metalwork, and any application where surface quality is critical. Steel dies are preferred for higher\n            production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane\n            combines both benefits.": "Utilice troqueles de uretano al doblar materiales preacabados, prepintados o pulidos donde las marcas en la superficie son inaceptables. ",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and\n            occasional inspection of the torsion bar are typically all that's needed. The mechanical design is\n            inherently reliable.": "Se requiere un mantenimiento mínimo. ",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty\n            options are available. Lifetime technical support is included with all machines.": "Ofrecemos una garantía integral de 2 años que cubre todos los componentes y sistemas principales. ",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization\n            system. Extended warranty packages and dedicated support programs are available.": "Ofrecemos una garantía integral de 2 años que cubre todos los componentes principales, incluido el sistema de sincronización. ",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This\n            includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended\n            warranty packages and preventive maintenance programs are available.": "Ofrecemos una garantía integral de 3 años para máquinas de servicio pesado que cubre todos los componentes principales. ",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are\n            available. Technical support is provided for the life of the machine.": "Ofrecemos una garantía estándar de 1 año que cubre todos los componentes principales. ",
  "What are the cost savings compared to buying two separate machines?": "¿Cuáles son los ahorros de costos en comparación con la compra de dos máquinas separadas?",
  "What are the main advantages of a robotic press brake?": "¿Cuáles son las principales ventajas de una plegadora robótica?",
  "What are the operating costs?": "¿Cuáles son los costos de operación?",
  "What blade material offers the best value?": "¿Qué material de hoja ofrece el mejor valor?",
  "What blade material should I choose for my application?": "¿Qué material de hoja debo elegir para mi aplicación?",
  "What does \"scimitar\" mean in press brake tooling?": "¿Qué significa \"cimitarra\" en las herramientas de plegadora?",
  "What foundation requirements are needed?": "¿Qué requisitos de base se necesitan?",
  "What happens if one machine encounters an error?": "¿Qué sucede si una máquina encuentra un error?",
  "What hardness should press brake tooling have?": "¿Qué dureza deben tener los útiles de plegadora?",
  "What information do I need to provide for a custom blade quote?": "¿Qué información debo proporcionar para una cotización de cuchilla personalizada?",
  "What is SmartCut AI and how does it improve cutting?": "¿Qué es SmartCut AI y cómo mejora el corte?",
  "What is pre-bending and why is it important?": "¿Qué es el predoblado y por qué es importante?",
  "What is the ROI for a robotic press brake system?": "¿Cuál es el retorno de la inversión de un sistema de plegadora robótica?",
  "What is the advantage of a four-column hydraulic press over other press types?": "¿Cuál es la ventaja de una prensa hidráulica de cuatro columnas sobre otros tipos de prensa?",
  "What is the advantage of the four-chuck clamping system?": "¿Cuál es la ventaja del sistema de sujeción de cuatro mandriles?",
  "What is the difference between 3-roll and 4-roll plate rolling machines?": "¿Cuál es la diferencia entre las laminadoras de placas de 3 y 4 rodillos?",
  "What is the difference between a gooseneck punch and a standard punch?": "¿Cuál es la diferencia entre un punzón con cuello de cisne y un punzón estándar?",
  "What is the difference between bump forming and radius tooling?": "¿Cuál es la diferencia entre la formación de protuberancias y las herramientas de radio?",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "¿Cuál es la diferencia entre prensas plegadoras electrohidráulicas e hidráulicas?",
  "What is the difference between guillotine and swing beam shears?": "¿Cuál es la diferencia entre las cizallas de guillotina y de viga oscilante?",
  "What is the difference between single table and dual table laser cutting machines?": "¿Cuál es la diferencia entre las máquinas de corte por láser de mesa única y de mesa doble?",
  "What is the difference between single table and dual table punching machines?": "¿Cuál es la diferencia entre las punzonadoras de mesa simple y de mesa doble?",
  "What is the difference between swing beam and guillotine shears?": "¿Cuál es la diferencia entre las cizallas de viga oscilante y de guillotina?",
  "What is the difference between torsion-synchro and hydraulic synchronization?": "¿Cuál es la diferencia entre sincronización de torsión y sincronización hidráulica?",
  "What is the expected delivery time?": "¿Cuál es el tiempo de entrega previsto?",
  "What is the maximum radius I can achieve on a press brake?": "¿Cuál es el radio máximo que puedo lograr en una plegadora?",
  "What is the maximum workpiece length a tandem system can handle?": "¿Cuál es la longitud máxima de la pieza de trabajo que puede manejar un sistema tándem?",
  "What is the typical delivery time?": "¿Cuál es el tiempo de entrega típico?",
  "What is the typical lead time for custom blades?": "¿Cuál es el plazo de entrega típico para las hojas personalizadas?",
  "What is the typical lead time for delivery?": "¿Cuál es el plazo típico de entrega?",
  "What is the typical lead time?": "¿Cuál es el plazo de entrega típico?",
  "What is the warranty coverage?": "¿Cuál es la cobertura de la garantía?",
  "What maintenance does a fiber laser require?": "¿Qué mantenimiento requiere un láser de fibra?",
  "What maintenance does a hydraulic press require?": "¿Qué mantenimiento requiere una prensa hidráulica?",
  "What maintenance is required?": "¿Qué mantenimiento se requiere?",
  "What material is best for press brake tooling?": "¿Qué material es mejor para las herramientas de plegadora?",
  "What materials and applications are suitable for four-column hydraulic presses?": "¿Qué materiales y aplicaciones son adecuadas para las prensas hidráulicas de cuatro columnas?",
  "What materials and hardness should gooseneck punches have?": "¿Qué materiales y dureza deben tener los punzones de cuello de cisne?",
  "What materials and thicknesses can be cut?": "¿Qué materiales y espesores se pueden cortar?",
  "What materials and thicknesses can be rolled?": "¿Qué materiales y espesores se pueden laminar?",
  "What materials can be bent with this machine?": "¿Qué materiales se pueden doblar con esta máquina?",
  "What materials can be cut with the tube laser?": "¿Qué materiales se pueden cortar con el láser de tubo?",
  "What materials can be cut with these blades?": "¿Qué materiales se pueden cortar con estas cuchillas?",
  "What materials can be cut with this machine?": "¿Qué materiales se pueden cortar con esta máquina?",
  "What materials can these blades cut?": "¿Qué materiales pueden cortar estas hojas?",
  "What materials can toothed blades perforate?": "¿Qué materiales pueden perforar las cuchillas dentadas?",
  "What maximum material thickness can heavy-duty press brakes handle?": "¿Qué espesor máximo de material pueden soportar las plegadoras de servicio pesado?",
  "What space is required for installation?": "¿Qué espacio se requiere para la instalación?",
  "What tube shapes and sizes can the machine cut?": "¿Qué formas y tamaños de tubos puede cortar la máquina?",
  "What warranty and support is provided?": "¿Qué garantía y soporte se proporciona?",
  "What warranty is included?": "¿Qué garantía incluye?",
  "What's the difference between European and American tooling standards?": "¿Cuál es la diferencia entre los estándares de herramientas europeos y americanos?",
  "When should I use urethane dies instead of steel?": "¿Cuándo debo utilizar matrices de uretano en lugar de acero?",
  "Which blade type should I choose for my application?": "¿Qué tipo de hoja debo elegir para mi aplicación?",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly\n            without interrupting production. The AI system also learns from each bending operation to\n            optimize future programs automatically.": "Con nuestro avanzado software de programación fuera de línea y simulación 3D, se pueden programar piezas nuevas rápidamente sin interrumpir la producción. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending\n            operations where deep relief clearance is required. These combine the interference-free benefits of\n            gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed\n            by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming\n            tooling.": "Sí, los punzones de cuello de cisne de ángulo agudo (30°, 45°, 60°) están diseñados específicamente para operaciones de doblado y doblado agudo donde se requiere un espacio de alivio profundo. ",
  "Yes, chipper blades can be professionally sharpened multiple times before replacement. Most blades can be resharpened 3-6 times depending on wear severity and original blade thickness. Professional sharpening services restore proper bevel angle and edge geometry. Regular sharpening before severe dulling occurs maximizes total blade life and maintains optimal chip quality. We offer sharpening services with quick turnaround.": "Sí, las cuchillas de la trituradora se pueden afilar profesionalmente varias veces antes de reemplazarlas. ",
  "Yes, comprehensive installation instructions are provided with all blade orders, including proper blade alignment, gap adjustment, and torque specifications. Our technical support team assists with setup, troubleshooting, and performance optimization. We provide safety guidelines and best practices documentation. Training materials and video tutorials are available to help your operators maximize blade performance and safety.": "Sí, se proporcionan instrucciones de instalación completas con todos los pedidos de hojas, incluida la alineación adecuada de las hojas, el ajuste de la separación y las especificaciones de torsión. ",
  "Yes, comprehensive installation instructions, torque specifications, and maintenance guidelines are provided with blade orders. We offer technical support for proper blade installation, adjustment, and troubleshooting. Safety information and best practices documentation are included. Our technical team is available to answer questions about blade installation, sharpening schedules, and performance optimization for your specific application.": "Sí, con los pedidos de hojas se proporcionan instrucciones completas de instalación, especificaciones de torsión y pautas de mantenimiento. ",
  "Yes, comprehensive technical support is included with all blade orders. We provide installation guidelines, setup recommendations, troubleshooting assistance, and optimization advice. Our technical team can help with blade selection, machine setup, and performance optimization. Training materials and best practices documentation are available.": "Sí, se incluye soporte técnico integral con todos los pedidos de blades. ",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head,\n            and control system for both applications. The CNC system automatically optimizes parameters for each mode.\n            Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across\n            all operations.": "Sí, la calidad de corte es idéntica en ambos modos. ",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively\n            giving you two separate press brakes when tandem operation is not needed.": "Sí, cada máquina se puede cambiar al modo de operación independiente para piezas de trabajo de longitud estándar, lo que le brinda efectivamente dos plegadoras separadas cuando no se necesita la operación en tándem.",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature\n            oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation.\n            Regular maintenance schedules should be followed to ensure optimal performance.": "Sí, las plegadoras de servicio pesado están diseñadas específicamente para la producción industrial continua. ",
  "Yes, most crusher blades can be professionally resharpened 2-4 times depending on wear severity and blade design. Resharpening restores cutting edges and extends total blade life. However, blades with severe chipping, cracks, or excessive wear should be replaced rather than resharpened. We offer professional blade sharpening services with quick turnaround times and quality guarantees.": "Sí, la mayoría de las cuchillas de las trituradoras se pueden reafilar profesionalmente de 2 a 4 veces, según la gravedad del desgaste y el diseño de la cuchilla. ",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The\n            adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts\n            bending parameters for different materials including steel, stainless steel, and aluminum.": "Sí, nuestro sistema robótico es muy flexible y puede manejar una amplia gama de tamaños y materiales de hojas. ",
  "Yes, our rolling shear blades are designed for multiple re-sharpening cycles. Professional re-grinding can restore cutting performance to near-original condition. Most blades can be re-sharpened 3-5 times or more, depending on wear patterns and application. We offer re-sharpening services with quick turnaround times.": "Sí, nuestras cuchillas de corte rodantes están diseñadas para múltiples ciclos de reafilado. ",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller\n            and straightforward operation make it easy to learn compared to more complex CNC systems.": "Sí, la plegadora de torsión sincronizada es ideal para operadores con capacitación básica. ",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within\n            24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Sí, mantenemos un inventario completo de repuestos y consumibles. ",
  "Yes, we offer sample blade production and testing services for custom applications. Sample blades allow you to verify perforation quality, tear strength, and production performance before committing to full production quantities. Sample fees are often credited toward production orders. This service is especially recommended for new applications or challenging materials.": "Sí, ofrecemos servicios de prueba y producción de hojas de muestra para aplicaciones personalizadas. ",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will\n            ensure your machine is properly set up and your operators are fully trained to use it efficiently and\n            safely.": "Sí, brindamos servicios completos de instalación y capacitación integral para operadores. ",
  "Yes, we provide comprehensive installation guidelines, blade gap adjustment procedures, and setup recommendations with every blade order. Our technical support team is available to assist with installation questions, troubleshooting, and optimization. On-site installation services are available for large orders or complex applications.": "Sí, proporcionamos pautas de instalación integrales, procedimientos de ajuste de la separación de las hojas y recomendaciones de configuración con cada pedido de hojas. ",
  "Yes, we provide comprehensive operator training as part of our installation service. Our technical team\n            will train your operators on machine operation, safety procedures, routine maintenance, and troubleshooting.\n            Training materials and operation manuals are also provided.": "Sí, brindamos capacitación integral para operadores como parte de nuestro servicio de instalación. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator\n            training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization,\n            basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Sí, brindamos soporte integral que incluye instalación en el sitio, puesta en marcha de la máquina y capacitación del operador (generalmente de 3 a 5 días). ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, foundation requirements guidance,\n            and operator training. Training covers machine operation, PLC programming, die setup, pressure adjustment,\n            safety protocols, basic maintenance, and troubleshooting. Complete operation manuals and technical documentation are also provided.": "Sí, brindamos soporte integral que incluye instalación en el sitio, puesta en marcha de la máquina, orientación sobre los requisitos de cimentación y capacitación del operador. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius\n            dimensions, material specifications, production volume, and part drawings. Our engineering team will\n            design custom arc molds optimized for your specific application. Custom tooling is particularly\n            cost-effective for high-volume production runs requiring consistent radius specifications not available\n            in standard tooling catalogs.": "Sí, nos especializamos en herramientas de radio personalizadas para aplicaciones únicas. ",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings,\n            material specifications, and bend requirements. Our engineering team will design custom dies for U-channels,\n            Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results\n            for high-volume production runs.": "Sí, nos especializamos en herramientas personalizadas para aplicaciones de doblado únicas. ",
  "Yes, with the optional bevel cutting head upgrade, our tube laser can cut various bevel angles for pipe\n            welding preparation. The system can create V-grooves, K-grooves, and other weld joint configurations at\n            precise angles. This eliminates the need for secondary beveling operations and ensures perfect fit-up for\n            welding. The SmartCut AI system automatically calculates optimal cutting paths for complex bevel geometries.": "Sí, con la actualización opcional del cabezal de corte en bisel, nuestro láser para tubos puede cortar varios ángulos de bisel para la preparación de la soldadura de tuberías. ",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting\n            the roll positions to create a gradual taper. The CNC system calculates the required roll positions for\n            the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and\n            conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "Sí, con el accesorio de enrollado cónico opcional, nuestras máquinas pueden producir formas cónicas ajustando las posiciones del rollo para crear una conicidad gradual. "
}