{
  "Plate Rolling Machine": "Plattenwalzmaschine",
  "Advanced CNC hydraulic plate rolling machine for precision bending of metal sheets into cylinders, cones, and curved shapes. Features 4-roll design with pre-bending capability and eliminates flat spots. Ideal for tank fabrication, pipe manufacturing, and pressure vessel production.": "Fortschrittliche hydraulische CNC-Blechwalzmaschine zum präzisen Biegen von Metallblechen in Zylinder, Kegel und gebogene Formen. ",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "High-performance CNC hydraulic plate rolling machine for precision metal forming and bending": "Hochleistungs-CNC-hydraulische Blechwalzmaschine für präzise Metallumformung und -biegung",
  "Rolling Capacity": "Rollkapazität",
  "Wide range of thickness options": "Große Auswahl an Dickenoptionen",
  "Customizable working width": "Anpassbare Arbeitsbreite",
  "Materials: Carbon Steel, Stainless, Aluminum": "Materialien: Kohlenstoffstahl, Edelstahl, Aluminium",
  "Pre-Bending: Yes (4-Roll)": "Vorbiegen: Ja (4-Rollen)",
  "Control System": "Kontrollsystem",
  "CNC System: Digital Control": "CNC-System: Digitale Steuerung",
  "Hydraulic System: High-Precision": "Hydrauliksystem: Hochpräzise",
  "High bending accuracy": "Hohe Biegegenauigkeit",
  "Roll Configuration: 4-Roll Design": "Rollenkonfiguration: 4-Rollen-Design",
  "Key Features": "Hauptmerkmale",
  "Pre-bending capability": "Möglichkeit zum Vorbiegen",
  "Short remaining straight edge": "Kurze verbleibende gerade Kante",
  "No flat spot formation": "Keine flache Stellenbildung",
  "Energy-efficient electric drive": "Energieeffizienter Elektroantrieb",
  "Why Choose Our Plate Rolling Machine?": "Warum sollten Sie sich für unsere Plattenwalzmaschine entscheiden?",
  "Discover the key advantages that make our plate rolling machine the preferred choice for precision metal bending and cylindrical forming operations": "Entdecken Sie die wichtigsten Vorteile, die unsere Blechwalzmaschine zur bevorzugten Wahl für präzise Metallbiege- und Zylinderformvorgänge machen",
  "High Precision Bending": "Hochpräzises Biegen",
  "High bending accuracy with CNC control ensures consistent quality and precise diameter control for cylinders and cones": "Hohe Biegegenauigkeit mit CNC-Steuerung gewährleistet gleichbleibende Qualität und präzise Durchmesserkontrolle für Zylinder und Kegel",
  "4-Roll Pre-Bending": "4-Rollen-Vorbiegen",
  "Four-roll design allows pre-bending of leading edge, eliminating the need to remove and reinsert material to avoid flat spots": "Das Vier-Rollen-Design ermöglicht das Vorbiegen der Vorderkante, sodass kein Material entfernt und erneut eingesetzt werden muss, um flache Stellen zu vermeiden",
  "Powerful Hydraulic System": "Leistungsstarkes Hydrauliksystem",
  "High-precision hydraulic system handles thick plates with consistent bending force throughout the operation": "Das hochpräzise Hydrauliksystem verarbeitet dicke Bleche mit konstanter Biegekraft während des gesamten Vorgangs",
  "Short Straight Edge": "Kurze gerade Kante",
  "Advanced 4-roll configuration produces extremely short remaining straight edge, maximizing material utilization and reducing waste": "Die fortschrittliche 4-Rollen-Konfiguration sorgt für eine extrem kurze verbleibende gerade Kante, wodurch die Materialausnutzung maximiert und Abfall reduziert wird",
  "Versatile Material Processing": "Vielseitige Materialbearbeitung",
  "Rolls carbon steel, stainless steel, aluminum alloys, and other metals with varying ductility and hardness characteristics": "Walzt Kohlenstoffstahl, Edelstahl, Aluminiumlegierungen und andere Metalle mit unterschiedlichen Duktilitäts- und Härteeigenschaften",
  "Energy Efficient": "Energieeffizient",
  "Electric-drive system reduces energy consumption and lowers operating costs without compromising on bending force": "Das elektrische Antriebssystem reduziert den Energieverbrauch und senkt die Betriebskosten, ohne Kompromisse bei der Biegekraft einzugehen",
  "Components": "Komponenten",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Anhand der folgenden Maschinendetailanzeige und Textbeschreibung können Sie die Leistung der Maschine besser verstehen",
  "Motor and reducer": "Motor und Untersetzungsgetriebe",
  "The main reducer adopts a cylindrical gear reducer, which is installed on the working base together with the pad height.": "Das Hauptuntersetzungsgetriebe besteht aus einem zylindrischen Untersetzungsgetriebe, das zusammen mit der Pad-Höhe auf der Arbeitsbasis installiert wird.",
  "Roller and frame": "Rolle und Rahmen",
  "The frame is a steel plate welded structure, and the radius of curvature of the arc is adjusted by adjusting the upper roller.": "Der Rahmen ist eine aus Stahlblech geschweißte Struktur, und der Krümmungsradius des Lichtbogens wird durch Einstellen der oberen Rolle eingestellt.",
  "Use the schematic": "Benutzen Sie den Schaltplan",
  "1. Straighten the steel plate; 2. Press and bend the steel plate downwards on the roller shaft; 3. The roller rotates the cylinder.": "1. Richten Sie die Stahlplatte gerade aus. ",
  "Multi-purpose machine": "Mehrzweckmaschine",
  "Buy custom molds, with more functions, you can roll angle iron, flat iron, round square tube, etc.": "Kaufen Sie maßgeschneiderte Formen mit mehr Funktionen, Sie können Winkeleisen, Flacheisen, runde Vierkantrohre usw. rollen.",
  "Watch Our Machine in Action": "Sehen Sie unsere Maschine in Aktion",
  "See the precision and power of our plate rolling machine in real production": "Erleben Sie die Präzision und Leistung unserer Blechwalzmaschine in der realen Produktion",
  "Applications": "Anwendungen",
  "Our plate rolling machines are widely used across various industries for forming cylindrical and curved metal components": "Unsere Blechwalzmaschinen werden in verschiedenen Branchen zum Formen zylindrischer und gebogener Metallteile eingesetzt",
  "Tank Fabrication": "Tankherstellung",
  "Manufacturing storage tanks, water tanks, and fuel tanks with precise cylindrical shapes for industrial and commercial applications": "Herstellung von Lagertanks, Wassertanks und Kraftstofftanks mit präzisen zylindrischen Formen für industrielle und kommerzielle Anwendungen",
  "Pressure Vessels": "Druckbehälter",
  "Rolling thick plates for pressure vessels, boilers, and heat exchangers requiring high-strength cylindrical construction": "Walzen dicker Bleche für Druckbehälter, Kessel und Wärmetauscher, die eine hochfeste zylindrische Konstruktion erfordern",
  "Pipe Manufacturing": "Rohrherstellung",
  "Forming large-diameter pipes and tubes for industrial piping systems, drainage systems, and structural applications": "Formen von Rohren und Röhren mit großem Durchmesser für industrielle Rohrleitungssysteme, Entwässerungssysteme und strukturelle Anwendungen",
  "Shipbuilding Industry": "Schiffbauindustrie",
  "Rolling hull plates, deck sections, and curved structural components for ship construction with precise curvature requirements": "Rollende Rumpfplatten, Decksabschnitte und gebogene Strukturbauteile für den Schiffsbau mit präzisen Krümmungsanforderungen",
  "Wind Power Industry": "Windkraftindustrie",
  "Manufacturing wind turbine tower sections and cylindrical supports requiring large diameters and precise tolerances": "Herstellung von Turmabschnitten und zylindrischen Stützen für Windkraftanlagen, die große Durchmesser und genaue Toleranzen erfordern",
  "HVAC Systems": "HVAC-Systeme",
  "Rolling sheet metal for ductwork, ventilation cylinders, and air handling system components in commercial buildings": "Walzen von Blechen für Rohrleitungen, Lüftungszylinder und Komponenten von Luftaufbereitungssystemen in Gewerbegebäuden",
  "Construction Equipment": "Baumaschinen",
  "Forming cylindrical components for construction machinery, excavators, and heavy equipment manufacturing": "Formen von zylindrischen Bauteilen für die Herstellung von Baumaschinen, Baggern und Schwermaschinen",
  "Steel Structures": "Stahlkonstruktionen",
  "Rolling structural steel plates for columns, arches, and curved architectural elements in building construction": "Walzen von Baustahlplatten für Säulen, Bögen und gebogene Architekturelemente im Hochbau",
  "Standard & Optional Configuration": "Standard- und optionale Konfiguration",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Passen Sie Ihre Maschine mit Standardfunktionen und optionalen Upgrades an Ihre spezifischen Anforderungen an",
  "Standard Configuration": "Standardkonfiguration",
  "Optional Upgrades": "Optionale Upgrades",
  "Need help choosing the right configuration?": "Benötigen Sie Hilfe bei der Auswahl der richtigen Konfiguration?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about our plate rolling machines": "Häufige Fragen zu unseren Blechwalzmaschinen",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision work and thick plate rolling.": "3-Walzen-Maschinen sind wirtschaftlicher und für allgemeine Anwendungen geeignet, erfordern jedoch ein separates Vorbiegen der Vorderkante und können längere gerade Kanten hinterlassen. ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength. Softer materials and those with higher ductility are easier to roll to smaller diameters.": "Unsere Plattenwalzmaschinen können Kohlenstoffstahl, Edelstahl, Aluminiumlegierungen und andere duktile Metalle verarbeiten. ",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency. The CNC system allows precise control of roll positions and automatically calculates the correct settings based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in real-time to maintain consistent quality throughout the operation.": "Unsere CNC-gesteuerten Blechwalzmaschinen erreichen eine hohe Biegepräzision bei gleichbleibendem Durchmesser. ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our 4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing and reinserting the plate, which saves time and improves quality.": "Beim Vorbiegen werden die Vorder- und Hinterkanten des Blechs vor dem Hauptwalzvorgang gebogen. ",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear, lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system should be serviced annually with oil changes and filter replacements. With proper maintenance, our machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and training with each machine.": "Zur regelmäßigen Wartung gehören die Überprüfung des Hydraulikölstands und der Qualität, die Überprüfung der Walzenoberflächen auf Verschleiß, die Schmierung von Lagern und beweglichen Teilen sowie die Überprüfung der Ausrichtung des Walzensystems. ",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting the roll positions to create a gradual taper. The CNC system calculates the required roll positions for the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "Ja, mit der optionalen konischen Rollvorrichtung können unsere Maschinen konische Formen herstellen, indem sie die Rollenpositionen anpassen, um eine allmähliche Verjüngung zu erzeugen. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Download Technical Brochure": "Laden Sie die technische Broschüre herunter",
  "Get detailed technical specifications, dimensions, and performance data for our plate rolling machines. Download our comprehensive product brochure in PDF format.": "Erhalten Sie detaillierte technische Spezifikationen, Abmessungen und Leistungsdaten für unsere Blechwalzmaschinen. "
}