{
  "Plate Rolling Machine": "Máquina laminadora de placas",
  "Advanced CNC hydraulic plate rolling machine for precision bending of metal sheets into cylinders, cones, and curved shapes. Features 4-roll design with pre-bending capability and eliminates flat spots. Ideal for tank fabrication, pipe manufacturing, and pressure vessel production.": "Máquina laminadora de placas hidráulica CNC avanzada para doblar con precisión láminas de metal en cilindros, conos y formas curvas. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "High-performance CNC hydraulic plate rolling machine for precision metal forming and bending": "Máquina laminadora de placas hidráulica CNC de alto rendimiento para conformado y doblado de metales con precisión",
  "Rolling Capacity": "Capacidad de rodadura",
  "Wide range of thickness options": "Amplia gama de opciones de espesor",
  "Customizable working width": "Ancho de trabajo personalizable",
  "Materials: Carbon Steel, Stainless, Aluminum": "Materiales: Acero al carbono, Inoxidable, Aluminio",
  "Pre-Bending: Yes (4-Roll)": "Predoblado: Sí (4 rollos)",
  "Control System": "Sistema de control",
  "CNC System: Digital Control": "Sistema CNC: Control digital",
  "Hydraulic System: High-Precision": "Sistema hidráulico: alta precisión",
  "High bending accuracy": "Alta precisión de flexión",
  "Roll Configuration: 4-Roll Design": "Configuración del rollo: diseño de 4 rollos",
  "Key Features": "Características clave",
  "Pre-bending capability": "Capacidad de predoblado",
  "Short remaining straight edge": "Borde recto restante corto",
  "No flat spot formation": "Sin formación de puntos planos",
  "Energy-efficient electric drive": "Propulsión eléctrica energéticamente eficiente",
  "Why Choose Our Plate Rolling Machine?": "¿Por qué elegir nuestra máquina laminadora de placas?",
  "Discover the key advantages that make our plate rolling machine the preferred choice for precision metal bending and cylindrical forming operations": "Descubra las ventajas clave que hacen de nuestra máquina laminadora de placas la opción preferida para operaciones de doblado de metales y conformado cilíndrico de precisión.",
  "High Precision Bending": "Doblado de alta precisión",
  "High bending accuracy with CNC control ensures consistent quality and precise diameter control for cylinders and cones": "La alta precisión de doblado con control CNC garantiza una calidad constante y un control preciso del diámetro de cilindros y conos.",
  "4-Roll Pre-Bending": "Predoblado de 4 rodillos",
  "Four-roll design allows pre-bending of leading edge, eliminating the need to remove and reinsert material to avoid flat spots": "El diseño de cuatro rodillos permite doblar previamente el borde de ataque, lo que elimina la necesidad de retirar y volver a insertar material para evitar puntos planos.",
  "Powerful Hydraulic System": "Potente sistema hidráulico",
  "High-precision hydraulic system handles thick plates with consistent bending force throughout the operation": "El sistema hidráulico de alta precisión maneja placas gruesas con una fuerza de flexión constante durante toda la operación.",
  "Short Straight Edge": "Borde recto corto",
  "Advanced 4-roll configuration produces extremely short remaining straight edge, maximizing material utilization and reducing waste": "La configuración avanzada de 4 rodillos produce un borde recto restante extremadamente corto, lo que maximiza la utilización del material y reduce el desperdicio.",
  "Versatile Material Processing": "Procesamiento de materiales versátil",
  "Rolls carbon steel, stainless steel, aluminum alloys, and other metals with varying ductility and hardness characteristics": "Rollos de acero al carbono, acero inoxidable, aleaciones de aluminio y otros metales con diferentes características de ductilidad y dureza.",
  "Energy Efficient": "Eficiencia energética",
  "Electric-drive system reduces energy consumption and lowers operating costs without compromising on bending force": "El sistema de accionamiento eléctrico reduce el consumo de energía y reduce los costos operativos sin comprometer la fuerza de flexión.",
  "Components": "Componentes",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Puede comprender mejor el rendimiento de la máquina a través de la siguiente pantalla detallada de la máquina y descripción de texto",
  "Motor and reducer": "Motor y reductor",
  "The main reducer adopts a cylindrical gear reducer, which is installed on the working base together with the pad height.": "El reductor principal adopta un reductor de engranajes cilíndrico, que se instala en la base de trabajo junto con la altura de la almohadilla.",
  "Roller and frame": "Rodillo y marco",
  "The frame is a steel plate welded structure, and the radius of curvature of the arc is adjusted by adjusting the upper roller.": "El marco es una estructura soldada de placa de acero y el radio de curvatura del arco se ajusta ajustando el rodillo superior.",
  "Use the schematic": "Usa el esquema",
  "1. Straighten the steel plate; 2. Press and bend the steel plate downwards on the roller shaft; 3. The roller rotates the cylinder.": "1. Enderece la placa de acero; ",
  "Multi-purpose machine": "Máquina multiusos",
  "Buy custom molds, with more functions, you can roll angle iron, flat iron, round square tube, etc.": "Compre moldes personalizados, con más funciones, puede enrollar hierro angular, plancha, tubo cuadrado redondo, etc.",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "See the precision and power of our plate rolling machine in real production": "Vea la precisión y potencia de nuestra laminadora de placas en producción real",
  "Applications": "Aplicaciones",
  "Our plate rolling machines are widely used across various industries for forming cylindrical and curved metal components": "Nuestras máquinas laminadoras de placas se utilizan ampliamente en diversas industrias para formar componentes metálicos cilíndricos y curvos.",
  "Tank Fabrication": "Fabricación de tanques",
  "Manufacturing storage tanks, water tanks, and fuel tanks with precise cylindrical shapes for industrial and commercial applications": "Fabricación de tanques de almacenamiento, tanques de agua y tanques de combustible con formas cilíndricas precisas para aplicaciones industriales y comerciales.",
  "Pressure Vessels": "Recipientes a presión",
  "Rolling thick plates for pressure vessels, boilers, and heat exchangers requiring high-strength cylindrical construction": "Placas gruesas rodantes para recipientes a presión, calderas e intercambiadores de calor que requieren una construcción cilíndrica de alta resistencia.",
  "Pipe Manufacturing": "Fabricación de tuberías",
  "Forming large-diameter pipes and tubes for industrial piping systems, drainage systems, and structural applications": "Formación de tuberías y tubos de gran diámetro para sistemas de tuberías industriales, sistemas de drenaje y aplicaciones estructurales.",
  "Shipbuilding Industry": "Industria de construcción naval",
  "Rolling hull plates, deck sections, and curved structural components for ship construction with precise curvature requirements": "Placas de casco rodantes, secciones de cubierta y componentes estructurales curvos para la construcción de barcos con requisitos de curvatura precisos",
  "Wind Power Industry": "Industria de la energía eólica",
  "Manufacturing wind turbine tower sections and cylindrical supports requiring large diameters and precise tolerances": "Fabricación de secciones de torres de turbinas eólicas y soportes cilíndricos que requieren grandes diámetros y tolerancias precisas.",
  "HVAC Systems": "Sistemas HVAC",
  "Rolling sheet metal for ductwork, ventilation cylinders, and air handling system components in commercial buildings": "Chapa metálica enrollable para conductos, cilindros de ventilación y componentes de sistemas de tratamiento de aire en edificios comerciales",
  "Construction Equipment": "Equipo de construcción",
  "Forming cylindrical components for construction machinery, excavators, and heavy equipment manufacturing": "Formar componentes cilíndricos para maquinaria de construcción, excavadoras y fabricación de equipos pesados.",
  "Steel Structures": "Estructuras de acero",
  "Rolling structural steel plates for columns, arches, and curved architectural elements in building construction": "Placas rodantes de acero estructural para columnas, arcos y elementos arquitectónicos curvos en la construcción de edificios.",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personalice su máquina con funciones estándar y actualizaciones opcionales para satisfacer sus requisitos específicos",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our plate rolling machines": "Preguntas comunes sobre nuestras laminadoras de placas",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision work and thick plate rolling.": "Las máquinas de 3 rodillos son más económicas y adecuadas para aplicaciones generales, pero requieren doblar previamente el borde principal por separado y pueden dejar bordes rectos más largos. ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength. Softer materials and those with higher ductility are easier to roll to smaller diameters.": "Nuestras máquinas laminadoras de placas pueden procesar acero al carbono, acero inoxidable, aleaciones de aluminio y otros metales dúctiles. ",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency. The CNC system allows precise control of roll positions and automatically calculates the correct settings based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in real-time to maintain consistent quality throughout the operation.": "Nuestras máquinas roladoras de placas controladas por CNC logran una alta precisión de doblado para lograr consistencia en el diámetro. ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our 4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing and reinserting the plate, which saves time and improves quality.": "El predoblado es el proceso de doblar los bordes delantero y trasero de la placa antes de la operación principal de laminado. ",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear, lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system should be serviced annually with oil changes and filter replacements. With proper maintenance, our machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and training with each machine.": "El mantenimiento regular incluye verificar los niveles y la calidad del aceite hidráulico, inspeccionar las superficies de los rodillos en busca de desgaste, lubricar los cojinetes y las piezas móviles y verificar la alineación del sistema de rodillos. ",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting the roll positions to create a gradual taper. The CNC system calculates the required roll positions for the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "Sí, con el accesorio de enrollado cónico opcional, nuestras máquinas pueden producir formas cónicas ajustando las posiciones del rollo para crear una conicidad gradual. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Get detailed technical specifications, dimensions, and performance data for our plate rolling machines. Download our comprehensive product brochure in PDF format.": "Obtenga especificaciones técnicas detalladas, dimensiones y datos de rendimiento de nuestras máquinas laminadoras de placas. "
}