{
  "Plate Rolling Machine": "Machine à rouler les plaques",
  "Advanced CNC hydraulic plate rolling machine for precision bending of metal sheets into cylinders, cones, and curved shapes. Features 4-roll design with pre-bending capability and eliminates flat spots. Ideal for tank fabrication, pipe manufacturing, and pressure vessel production.": "Machine à rouler les plaques hydrauliques CNC avancée pour le cintrage de précision des tôles en cylindres, cônes et formes courbes. ",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "High-performance CNC hydraulic plate rolling machine for precision metal forming and bending": "Machine à rouler les plaques hydrauliques CNC haute performance pour le formage et le pliage de précision des métaux",
  "Rolling Capacity": "Capacité de roulement",
  "Wide range of thickness options": "Large gamme d'options d'épaisseur",
  "Customizable working width": "Largeur de travail personnalisable",
  "Materials: Carbon Steel, Stainless, Aluminum": "Matériaux : acier au carbone, inoxydable, aluminium",
  "Pre-Bending: Yes (4-Roll)": "Pré-cintrage : oui (4 rouleaux)",
  "Control System": "Système de contrôle",
  "CNC System: Digital Control": "Système CNC : contrôle numérique",
  "Hydraulic System: High-Precision": "Système hydraulique : haute précision",
  "High bending accuracy": "Haute précision de pliage",
  "Roll Configuration: 4-Roll Design": "Configuration du rouleau : conception à 4 rouleaux",
  "Key Features": "Principales fonctionnalités",
  "Pre-bending capability": "Capacité de pré-pliage",
  "Short remaining straight edge": "Bord droit restant court",
  "No flat spot formation": "Pas de formation de points plats",
  "Energy-efficient electric drive": "Entraînement électrique économe en énergie",
  "Why Choose Our Plate Rolling Machine?": "Pourquoi choisir notre machine à rouler les plaques ?",
  "Discover the key advantages that make our plate rolling machine the preferred choice for precision metal bending and cylindrical forming operations": "Découvrez les principaux avantages qui font de notre laminoir de tôles le choix privilégié pour les opérations de pliage de précision des métaux et de formage cylindrique.",
  "High Precision Bending": "Pliage de haute précision",
  "High bending accuracy with CNC control ensures consistent quality and precise diameter control for cylinders and cones": "Une précision de pliage élevée avec commande CNC garantit une qualité constante et un contrôle précis du diamètre des cylindres et des cônes",
  "4-Roll Pre-Bending": "Pré-cintrage à 4 rouleaux",
  "Four-roll design allows pre-bending of leading edge, eliminating the need to remove and reinsert material to avoid flat spots": "La conception à quatre rouleaux permet de pré-courber le bord d'attaque, éliminant ainsi le besoin de retirer et de réinsérer du matériau pour éviter les méplats.",
  "Powerful Hydraulic System": "Système hydraulique puissant",
  "High-precision hydraulic system handles thick plates with consistent bending force throughout the operation": "Le système hydraulique de haute précision manipule des plaques épaisses avec une force de flexion constante tout au long de l'opération",
  "Short Straight Edge": "Bord droit court",
  "Advanced 4-roll configuration produces extremely short remaining straight edge, maximizing material utilization and reducing waste": "La configuration avancée à 4 rouleaux produit un bord droit restant extrêmement court, maximisant l'utilisation du matériau et réduisant les déchets.",
  "Versatile Material Processing": "Traitement polyvalent des matériaux",
  "Rolls carbon steel, stainless steel, aluminum alloys, and other metals with varying ductility and hardness characteristics": "Rouleaux d'acier au carbone, d'acier inoxydable, d'alliages d'aluminium et d'autres métaux présentant des caractéristiques de ductilité et de dureté variables",
  "Energy Efficient": "Efficacité énergétique",
  "Electric-drive system reduces energy consumption and lowers operating costs without compromising on bending force": "Le système d'entraînement électrique réduit la consommation d'énergie et les coûts d'exploitation sans compromettre la force de flexion",
  "Components": "Composants",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Vous pouvez mieux comprendre les performances de la machine grâce à l'affichage détaillé de la machine et à la description textuelle suivante",
  "Motor and reducer": "Moteur et réducteur",
  "The main reducer adopts a cylindrical gear reducer, which is installed on the working base together with the pad height.": "Le réducteur principal adopte un réducteur à engrenages cylindrique, qui est installé sur la base de travail avec la hauteur du patin.",
  "Roller and frame": "Rouleau et cadre",
  "The frame is a steel plate welded structure, and the radius of curvature of the arc is adjusted by adjusting the upper roller.": "Le cadre est une structure soudée en tôle d'acier et le rayon de courbure de l'arc est ajusté en ajustant le rouleau supérieur.",
  "Use the schematic": "Utilisez le schéma",
  "1. Straighten the steel plate; 2. Press and bend the steel plate downwards on the roller shaft; 3. The roller rotates the cylinder.": "1. Redressez la plaque d’acier ; ",
  "Multi-purpose machine": "Machine polyvalente",
  "Buy custom molds, with more functions, you can roll angle iron, flat iron, round square tube, etc.": "Achetez des moules personnalisés, avec plus de fonctions, vous pouvez rouler une cornière, un fer plat, un tube carré rond, etc.",
  "Watch Our Machine in Action": "Regardez notre machine en action",
  "See the precision and power of our plate rolling machine in real production": "Découvrez la précision et la puissance de notre rouleuse de tôles en production réelle",
  "Applications": "Applications",
  "Our plate rolling machines are widely used across various industries for forming cylindrical and curved metal components": "Nos laminoirs de tôles sont largement utilisés dans diverses industries pour former des composants métalliques cylindriques et incurvés.",
  "Tank Fabrication": "Fabrication de réservoirs",
  "Manufacturing storage tanks, water tanks, and fuel tanks with precise cylindrical shapes for industrial and commercial applications": "Fabrication de réservoirs de stockage, de réservoirs d'eau et de réservoirs de carburant avec des formes cylindriques précises pour des applications industrielles et commerciales",
  "Pressure Vessels": "Appareils à pression",
  "Rolling thick plates for pressure vessels, boilers, and heat exchangers requiring high-strength cylindrical construction": "Laminage de plaques épaisses pour récipients sous pression, chaudières et échangeurs de chaleur nécessitant une construction cylindrique à haute résistance",
  "Pipe Manufacturing": "Fabrication de tuyaux",
  "Forming large-diameter pipes and tubes for industrial piping systems, drainage systems, and structural applications": "Formation de tuyaux et de tubes de grand diamètre pour les systèmes de tuyauterie industrielle, les systèmes de drainage et les applications structurelles",
  "Shipbuilding Industry": "Industrie de la construction navale",
  "Rolling hull plates, deck sections, and curved structural components for ship construction with precise curvature requirements": "Plaques de coque roulantes, sections de pont et composants structurels incurvés pour la construction navale avec des exigences de courbure précises",
  "Wind Power Industry": "Industrie de l’énergie éolienne",
  "Manufacturing wind turbine tower sections and cylindrical supports requiring large diameters and precise tolerances": "Fabrication de sections de mâts d'éoliennes et de supports cylindriques nécessitant de grands diamètres et des tolérances précises",
  "HVAC Systems": "Systèmes CVC",
  "Rolling sheet metal for ductwork, ventilation cylinders, and air handling system components in commercial buildings": "Tôle laminée pour conduits, cylindres de ventilation et composants de systèmes de traitement d'air dans les bâtiments commerciaux",
  "Construction Equipment": "Matériel de construction",
  "Forming cylindrical components for construction machinery, excavators, and heavy equipment manufacturing": "Formage de composants cylindriques pour la fabrication de machines de construction, d'excavatrices et d'équipements lourds",
  "Steel Structures": "Structures en acier",
  "Rolling structural steel plates for columns, arches, and curved architectural elements in building construction": "Plaques d'acier de construction roulantes pour colonnes, arcs et éléments architecturaux courbes dans la construction de bâtiments",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personnalisez votre machine avec des fonctionnalités standard et des mises à niveau facultatives pour répondre à vos besoins spécifiques",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need help choosing the right configuration?": "Besoin d'aide pour choisir la bonne configuration ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our plate rolling machines": "Questions courantes sur nos laminoirs de tôles",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision work and thick plate rolling.": "Les machines à 3 rouleaux sont plus économiques et adaptées aux applications générales, mais nécessitent de pré-courber le bord d'attaque séparément et peuvent laisser des bords droits plus longs. ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength. Softer materials and those with higher ductility are easier to roll to smaller diameters.": "Nos machines à rouler les tôles peuvent traiter l'acier au carbone, l'acier inoxydable, les alliages d'aluminium et d'autres métaux ductiles. ",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency. The CNC system allows precise control of roll positions and automatically calculates the correct settings based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in real-time to maintain consistent quality throughout the operation.": "Nos laminoirs de tôles contrôlés par CNC atteignent une précision de pliage élevée pour une cohérence de diamètre. ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our 4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing and reinserting the plate, which saves time and improves quality.": "Le pré-cintrage est le processus de cintrage des bords d’attaque et de fuite de la plaque avant l’opération de laminage principale. ",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear, lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system should be serviced annually with oil changes and filter replacements. With proper maintenance, our machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and training with each machine.": "L'entretien régulier comprend la vérification des niveaux et de la qualité de l'huile hydraulique, l'inspection de l'usure des surfaces des rouleaux, la lubrification des roulements et des pièces mobiles et la vérification de l'alignement du système de rouleaux. ",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting the roll positions to create a gradual taper. The CNC system calculates the required roll positions for the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "Oui, avec l'accessoire de roulement conique en option, nos machines peuvent produire des formes coniques en ajustant les positions des rouleaux pour créer une conicité progressive. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Get detailed technical specifications, dimensions, and performance data for our plate rolling machines. Download our comprehensive product brochure in PDF format.": "Obtenez des spécifications techniques détaillées, des dimensions et des données de performances pour nos laminoirs à tôles. "
}