{
  "Plate Rolling Machine": "Листопрокатный станок",
  "Advanced CNC hydraulic plate rolling machine for precision bending of metal sheets into cylinders, cones, and curved shapes. Features 4-roll design with pre-bending capability and eliminates flat spots. Ideal for tank fabrication, pipe manufacturing, and pressure vessel production.": "Усовершенствованный гидравлический листогибочный станок с ЧПУ для точной гибки металлических листов в цилиндры, конусы и изогнутые формы. ",
  "Request Quote": "Запросить цену",
  "Watch Video": "Посмотреть видео",
  "Technical Specifications": "Технические характеристики",
  "High-performance CNC hydraulic plate rolling machine for precision metal forming and bending": "Высокопроизводительный гидравлический листопрокатный станок с ЧПУ для точной формовки и гибки металла.",
  "Rolling Capacity": "Прокатная мощность",
  "Wide range of thickness options": "Широкий выбор вариантов толщины",
  "Customizable working width": "Настраиваемая рабочая ширина",
  "Materials: Carbon Steel, Stainless, Aluminum": "Материалы: углеродистая сталь, нержавеющая сталь, алюминий.",
  "Pre-Bending: Yes (4-Roll)": "Предварительная гибка: Да (4 рулона)",
  "Control System": "Система управления",
  "CNC System: Digital Control": "Система ЧПУ: цифровое управление",
  "Hydraulic System: High-Precision": "Гидравлическая система: Высокоточная",
  "High bending accuracy": "Высокая точность гибки",
  "Roll Configuration: 4-Roll Design": "Конфигурация рулонов: конструкция с 4 рулонами",
  "Key Features": "Ключевые особенности",
  "Pre-bending capability": "Возможность предварительного изгиба",
  "Short remaining straight edge": "Короткий оставшийся прямой край",
  "No flat spot formation": "Отсутствие образования плоских пятен",
  "Energy-efficient electric drive": "Энергоэффективный электропривод",
  "Why Choose Our Plate Rolling Machine?": "Почему стоит выбрать нашу листопрокатную машину?",
  "Discover the key advantages that make our plate rolling machine the preferred choice for precision metal bending and cylindrical forming operations": "Откройте для себя ключевые преимущества, которые делают наш листопрокатный станок предпочтительным выбором для операций точной гибки металлов и формовки цилиндрических поверхностей.",
  "High Precision Bending": "Высокоточная гибка",
  "High bending accuracy with CNC control ensures consistent quality and precise diameter control for cylinders and cones": "Высокая точность гибки с ЧПУ обеспечивает стабильное качество и точный контроль диаметра цилиндров и конусов.",
  "4-Roll Pre-Bending": "4-валковая предварительная гибка",
  "Four-roll design allows pre-bending of leading edge, eliminating the need to remove and reinsert material to avoid flat spots": "Конструкция с четырьмя роликами позволяет предварительно сгибать переднюю кромку, устраняя необходимость удаления и повторной установки материала во избежание образования плоских мест.",
  "Powerful Hydraulic System": "Мощная гидравлическая система",
  "High-precision hydraulic system handles thick plates with consistent bending force throughout the operation": "Высокоточная гидравлическая система обрабатывает толстые листы с постоянной силой изгиба на протяжении всей операции.",
  "Short Straight Edge": "Короткий прямой край",
  "Advanced 4-roll configuration produces extremely short remaining straight edge, maximizing material utilization and reducing waste": "Усовершенствованная 4-валковая конфигурация обеспечивает чрезвычайно короткую оставшуюся прямую кромку, что позволяет максимально эффективно использовать материал и сократить отходы.",
  "Versatile Material Processing": "Универсальная обработка материалов",
  "Rolls carbon steel, stainless steel, aluminum alloys, and other metals with varying ductility and hardness characteristics": "Прокатывает углеродистую, нержавеющую сталь, алюминиевые сплавы и другие металлы с различными характеристиками пластичности и твердости.",
  "Energy Efficient": "Энергоэффективный",
  "Electric-drive system reduces energy consumption and lowers operating costs without compromising on bending force": "Система электропривода снижает потребление энергии и эксплуатационные расходы без ущерба для изгибающей силы.",
  "Components": "Компоненты",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Вы можете лучше понять производительность машины с помощью следующего подробного описания машины и текстового описания.",
  "Motor and reducer": "Мотор и редуктор",
  "The main reducer adopts a cylindrical gear reducer, which is installed on the working base together with the pad height.": "В главном редукторе используется цилиндрический зубчатый редуктор, который устанавливается на рабочее основание вместе с высотой колодки.",
  "Roller and frame": "Ролик и рама",
  "The frame is a steel plate welded structure, and the radius of curvature of the arc is adjusted by adjusting the upper roller.": "Рама представляет собой сварную конструкцию из стальных пластин, а радиус кривизны дуги регулируется регулировкой верхнего ролика.",
  "Use the schematic": "Используйте схему",
  "1. Straighten the steel plate; 2. Press and bend the steel plate downwards on the roller shaft; 3. The roller rotates the cylinder.": "1. Выпрямите стальную пластину; ",
  "Multi-purpose machine": "Многоцелевая машина",
  "Buy custom molds, with more functions, you can roll angle iron, flat iron, round square tube, etc.": "Купите специальные формы с большим количеством функций: вы можете катать угловое железо, плоское железо, круглую квадратную трубу и т. Д.",
  "Watch Our Machine in Action": "Посмотрите нашу машину в действии",
  "See the precision and power of our plate rolling machine in real production": "Убедитесь в точности и мощности нашего листопрокатного станка в реальном производстве.",
  "Applications": "Приложения",
  "Our plate rolling machines are widely used across various industries for forming cylindrical and curved metal components": "Наши листопрокатные станки широко используются в различных отраслях промышленности для формирования цилиндрических и изогнутых металлических деталей.",
  "Tank Fabrication": "Изготовление резервуаров",
  "Manufacturing storage tanks, water tanks, and fuel tanks with precise cylindrical shapes for industrial and commercial applications": "Производство резервуаров для хранения, резервуаров для воды и топливных баков точной цилиндрической формы для промышленного и коммерческого применения.",
  "Pressure Vessels": "Сосуды под давлением",
  "Rolling thick plates for pressure vessels, boilers, and heat exchangers requiring high-strength cylindrical construction": "Прокат толстолистового проката для сосудов под давлением, котлов и теплообменников, требующих высокопрочной цилиндрической конструкции.",
  "Pipe Manufacturing": "Производство труб",
  "Forming large-diameter pipes and tubes for industrial piping systems, drainage systems, and structural applications": "Формовка труб и трубок большого диаметра для промышленных трубопроводных систем, дренажных систем и конструкций.",
  "Shipbuilding Industry": "Судостроительная промышленность",
  "Rolling hull plates, deck sections, and curved structural components for ship construction with precise curvature requirements": "Подвижные листы корпуса, секции палубы и изогнутые конструктивные элементы для судостроения с точными требованиями к кривизне.",
  "Wind Power Industry": "Ветроэнергетика",
  "Manufacturing wind turbine tower sections and cylindrical supports requiring large diameters and precise tolerances": "Производство секций башен ветряных турбин и цилиндрических опор, требующих больших диаметров и точных допусков.",
  "HVAC Systems": "Системы отопления, вентиляции и кондиционирования",
  "Rolling sheet metal for ductwork, ventilation cylinders, and air handling system components in commercial buildings": "Прокат листового металла для воздуховодов, вентиляционных цилиндров и компонентов систем кондиционирования в коммерческих зданиях.",
  "Construction Equipment": "Строительное оборудование",
  "Forming cylindrical components for construction machinery, excavators, and heavy equipment manufacturing": "Формовка цилиндрических деталей для строительной техники, экскаваторов и производства тяжелого оборудования.",
  "Steel Structures": "Стальные конструкции",
  "Rolling structural steel plates for columns, arches, and curved architectural elements in building construction": "Прокат листовой конструкционной стали для колонн, арок и изогнутых архитектурных элементов в строительстве зданий.",
  "Standard & Optional Configuration": "Стандартная и дополнительная конфигурация",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Настройте свою машину с помощью стандартных функций и дополнительных обновлений в соответствии с вашими конкретными требованиями.",
  "Standard Configuration": "Стандартная конфигурация",
  "Optional Upgrades": "Дополнительные обновления",
  "Need help choosing the right configuration?": "Нужна помощь в выборе правильной конфигурации?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about our plate rolling machines": "Общие вопросы о наших листопрокатных машинах",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision work and thick plate rolling.": "Трехвалковые станки более экономичны и подходят для общего применения, но требуют предварительного изгиба передней кромки отдельно и могут оставить более длинные прямые кромки. ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength. Softer materials and those with higher ductility are easier to roll to smaller diameters.": "Наши листопрокатные станки могут обрабатывать углеродистую сталь, нержавеющую сталь, алюминиевые сплавы и другие пластичные металлы. ",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency. The CNC system allows precise control of roll positions and automatically calculates the correct settings based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in real-time to maintain consistent quality throughout the operation.": "Наши листопрокатные станки с ЧПУ обеспечивают высокую точность гибки и постоянство диаметра. ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our 4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing and reinserting the plate, which saves time and improves quality.": "Предварительная гибка — это процесс гибки передней и задней кромок листа перед основной операцией прокатки. ",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear, lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system should be serviced annually with oil changes and filter replacements. With proper maintenance, our machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and training with each machine.": "Регулярное техническое обслуживание включает проверку уровня и качества гидравлического масла, проверку поверхностей валков на предмет износа, смазку подшипников и движущихся частей, а также проверку центровки системы валков. ",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting the roll positions to create a gradual taper. The CNC system calculates the required roll positions for the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "Да, с помощью дополнительного приспособления для конической прокатки наши машины могут производить конические формы, регулируя положение валков для создания постепенного сужения. ",
  "Still have questions?": "Остались вопросы?",
  "Download Technical Brochure": "Загрузить техническую брошюру",
  "Get detailed technical specifications, dimensions, and performance data for our plate rolling machines. Download our comprehensive product brochure in PDF format.": "Получите подробные технические характеристики, размеры и характеристики наших листопрокатных станков. "
}