{
  "Plate Rolling Machine": "プレートローリングマシン",
  "Advanced CNC hydraulic plate rolling machine for precision bending of metal sheets into cylinders, cones, and curved shapes. Features 4-roll design with pre-bending capability and eliminates flat spots. Ideal for tank fabrication, pipe manufacturing, and pressure vessel production.": "金属シートを円筒、円錐、湾曲した形状に精密に曲げるための高度な CNC 油圧プレート圧延機。",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "High-performance CNC hydraulic plate rolling machine for precision metal forming and bending": "精密金属成形および曲げ用の高性能CNC油圧プレートローリングマシン",
  "Rolling Capacity": "回転能力",
  "Wide range of thickness options": "幅広い厚さのオプション",
  "Customizable working width": "カスタマイズ可能な作業幅",
  "Materials: Carbon Steel, Stainless, Aluminum": "材質：炭素鋼、ステンレス、アルミニウム",
  "Pre-Bending: Yes (4-Roll)": "事前曲げ: はい (4 ロール)",
  "Control System": "制御システム",
  "CNC System: Digital Control": "CNC システム: デジタル制御",
  "Hydraulic System: High-Precision": "油圧システム: 高精度",
  "High bending accuracy": "高い曲げ精度",
  "Roll Configuration: 4-Roll Design": "ロール構成: 4 ロール設計",
  "Key Features": "主な特長",
  "Pre-bending capability": "プリベンディング機能",
  "Short remaining straight edge": "残りの直線エッジが短い",
  "No flat spot formation": "フラットスポットが形成されない",
  "Energy-efficient electric drive": "エネルギー効率の高い電気駆動装置",
  "Why Choose Our Plate Rolling Machine?": "当社のプレートローリングマシンを選ぶ理由?",
  "Discover the key advantages that make our plate rolling machine the preferred choice for precision metal bending and cylindrical forming operations": "当社のプレートローリングマシンが精密な金属曲げや円筒成形作業に最適な選択肢となる主な利点をご覧ください。",
  "High Precision Bending": "高精度曲げ加工",
  "High bending accuracy with CNC control ensures consistent quality and precise diameter control for cylinders and cones": "CNC 制御による高い曲げ精度により、シリンダーとコーンの一貫した品質と正確な直径制御が保証されます。",
  "4-Roll Pre-Bending": "4ロールプレベンディング",
  "Four-roll design allows pre-bending of leading edge, eliminating the need to remove and reinsert material to avoid flat spots": "4 ロール設計により、リーディングエッジを事前に曲げることができるため、材料を取り外して再挿入する必要がなく、平らな部分が発生しません。",
  "Powerful Hydraulic System": "強力な油圧システム",
  "High-precision hydraulic system handles thick plates with consistent bending force throughout the operation": "高精度油圧システムにより、作業全体を通じて一貫した曲げ力で厚板を処理します。",
  "Short Straight Edge": "短いストレートエッジ",
  "Advanced 4-roll configuration produces extremely short remaining straight edge, maximizing material utilization and reducing waste": "高度な 4 ロール構成により、残りの直線エッジが非常に短くなり、材料の利用率が最大化され、廃棄物が削減されます。",
  "Versatile Material Processing": "多彩な材料加工",
  "Rolls carbon steel, stainless steel, aluminum alloys, and other metals with varying ductility and hardness characteristics": "さまざまな延性と硬度特性を持つ炭素鋼、ステンレス鋼、アルミニウム合金、その他の金属をロールします。",
  "Energy Efficient": "エネルギー効率が高い",
  "Electric-drive system reduces energy consumption and lowers operating costs without compromising on bending force": "電気駆動システムにより、曲げ力を損なうことなくエネルギー消費を削減し、運用コストを削減します。",
  "Components": "コンポーネント",
  "You can better understand the performance of the machine through the following machine detail display and text description": "次のマシンの詳細表示とテキストの説明を通じて、マシンのパフォーマンスをよりよく理解できます。",
  "Motor and reducer": "モーターと減速機",
  "The main reducer adopts a cylindrical gear reducer, which is installed on the working base together with the pad height.": "主減速機は円筒歯車減速機を採用しており、パッド高さとともに作業ベースに取り付けられています。",
  "Roller and frame": "ローラーとフレーム",
  "The frame is a steel plate welded structure, and the radius of curvature of the arc is adjusted by adjusting the upper roller.": "フレームは鋼板溶接構造で、上部ローラーの調整により円弧の曲率半径を調整します。",
  "Use the schematic": "回路図を使用する",
  "1. Straighten the steel plate; 2. Press and bend the steel plate downwards on the roller shaft; 3. The roller rotates the cylinder.": "1. 鋼板をまっすぐにします。 ",
  "Multi-purpose machine": "多目的機",
  "Buy custom molds, with more functions, you can roll angle iron, flat iron, round square tube, etc.": "より多くの機能を備えたカスタム金型を購入すると、アングル鉄、平鉄、丸角管などを圧延することができます。",
  "Watch Our Machine in Action": "機械の動作をご覧ください",
  "See the precision and power of our plate rolling machine in real production": "実際の生産現場で当社のプレートローリングマシンの精度とパワーをご覧ください。",
  "Applications": "アプリケーション",
  "Our plate rolling machines are widely used across various industries for forming cylindrical and curved metal components": "当社のプレート圧延機は、円筒形および曲面の金属部品を成形するためにさまざまな業界で広く使用されています。",
  "Tank Fabrication": "タンクの製作",
  "Manufacturing storage tanks, water tanks, and fuel tanks with precise cylindrical shapes for industrial and commercial applications": "産業用および商業用の精密円筒形状の貯蔵タンク、水タンク、燃料タンクの製造",
  "Pressure Vessels": "圧力容器",
  "Rolling thick plates for pressure vessels, boilers, and heat exchangers requiring high-strength cylindrical construction": "高強度の円筒構造を必要とする圧力容器、ボイラー、熱交換器用の厚板の圧延",
  "Pipe Manufacturing": "パイプ製造",
  "Forming large-diameter pipes and tubes for industrial piping systems, drainage systems, and structural applications": "産業用配管システム、排水システム、構造用途向けの大口径パイプおよびチューブの形成",
  "Shipbuilding Industry": "造船業",
  "Rolling hull plates, deck sections, and curved structural components for ship construction with precise curvature requirements": "正確な曲率要件を伴う船舶建造用の船体プレート、デッキセクション、および湾曲した構造コンポーネントを圧延します。",
  "Wind Power Industry": "風力発電産業",
  "Manufacturing wind turbine tower sections and cylindrical supports requiring large diameters and precise tolerances": "大きな直径と正確な公差が必要な風力タービンのタワーセクションと円筒形サポートの製造",
  "HVAC Systems": "HVAC システム",
  "Rolling sheet metal for ductwork, ventilation cylinders, and air handling system components in commercial buildings": "商業ビルのダクト、換気シリンダー、空気処理システムのコンポーネント用の圧延板金",
  "Construction Equipment": "建設機械",
  "Forming cylindrical components for construction machinery, excavators, and heavy equipment manufacturing": "建設機械、掘削機、重機製造用の円筒部品の成形",
  "Steel Structures": "鋼構造物",
  "Rolling structural steel plates for columns, arches, and curved architectural elements in building construction": "建築工事における柱、アーチ、曲線建築要素などの構造用鋼板の圧延",
  "Standard & Optional Configuration": "標準およびオプションの構成",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "標準機能とオプションのアップグレードを使用してマシンをカスタマイズし、特定の要件を満たすことができます",
  "Standard Configuration": "標準構成",
  "Optional Upgrades": "オプションのアップグレード",
  "Need help choosing the right configuration?": "適切な構成を選択するのにサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about our plate rolling machines": "当社のプレートローリングマシンに関するよくある質問",
  "3-roll machines are more economical and suitable for general applications, but require pre-bending the leading edge separately and may leave longer straight edges. 4-roll machines offer higher precision and efficiency with integrated pre-bending capability, allowing edge bending without removing the plate. They produce shorter remaining straight edges and eliminate flat spots, making them ideal for high-precision work and thick plate rolling.": "3 ロール機はより経済的で一般的な用途に適していますが、前縁を個別に事前に曲げる必要があり、より長い直線エッジが残る場合があります。 ",
  "Our plate rolling machines can process carbon steel, stainless steel, aluminum alloys, and other ductile metals. Different models are available to handle various plate thicknesses. The actual bending performance depends on material ductility, hardness, and yield strength. Softer materials and those with higher ductility are easier to roll to smaller diameters.": "当社のプレートローリングマシンは、炭素鋼、ステンレス鋼、アルミニウム合金、およびその他の延性金属を加工できます。",
  "Our CNC-controlled plate rolling machines achieve high bending precision for diameter consistency. The CNC system allows precise control of roll positions and automatically calculates the correct settings based on plate thickness and desired radius. Digital feedback systems monitor the rolling process in real-time to maintain consistent quality throughout the operation.": "当社の CNC 制御プレートローリングマシンは、直径の一貫性を維持するための高い曲げ精度を実現します。 ",
  "Pre-bending is the process of bending the leading and trailing edges of the plate before the main rolling operation. This prevents flat spots on the finished cylinder and reduces the remaining straight edge. Our 4-roll machines have integrated pre-bending capability, allowing you to pre-bend edges without removing and reinserting the plate, which saves time and improves quality.": "予備曲げは、主な圧延操作の前にプレートの前縁と後縁を曲げるプロセスです。",
  "Regular maintenance includes checking hydraulic oil levels and quality, inspecting roll surfaces for wear, lubricating bearings and moving parts, and verifying alignment of the roll system. The hydraulic system should be serviced annually with oil changes and filter replacements. With proper maintenance, our machines are designed for 20+ years of reliable service. We provide comprehensive maintenance manuals and training with each machine.": "定期的なメンテナンスには、油圧オイルのレベルと品質のチェック、ロール表面の摩耗の検査、ベアリングと可動部品の潤滑、ロール システムのアライメントの確認が含まれます。",
  "Yes, with the optional conical rolling attachment, our machines can produce conical shapes by adjusting the roll positions to create a gradual taper. The CNC system calculates the required roll positions for the desired cone angle. This capability is particularly useful for manufacturing hoppers, funnels, and conical sections for pressure vessels. Standard cylindrical machines can be retrofitted with this option.": "はい、オプションのコニカルローリングアタッチメントを使用すると、当社の機械はロール位置を調整して緩やかなテーパーを作成することにより、円錐形状を生成できます。 ",
  "Still have questions?": "まだ質問がありますか?",
  "Download Technical Brochure": "技術パンフレットをダウンロード",
  "Get detailed technical specifications, dimensions, and performance data for our plate rolling machines. Download our comprehensive product brochure in PDF format.": "当社のプレートローリングマシンの詳細な技術仕様、寸法、性能データを入手してください。"
}