{
  "CNC Bending Machine Arc Mold": "آلة الانحناء باستخدام الحاسب الآلي قالب القوس",
  "Advanced radius bending tooling engineered for precision arc formation on CNC press brakes. Produces consistently smooth curved bends without bend lines, kinking, or material marking. Available in steel and urethane configurations for diverse radius applications from R5 to R200mm.": "تم تصميم أدوات ثني نصف القطر المتقدمة لتكوين قوس دقيق على مكابح الضغط باستخدام الحاسب الآلي. ",
  "Request Quote": "طلب اقتباس",
  "Learn More": "يتعلم أكثر",
  "Technical Specifications": "المواصفات الفنية",
  "Professional radius bending tooling for smooth arc formation on CNC press brake machines": "أدوات ثني نصف قطر احترافية لتشكيل قوس سلس على آلات مكابح الضغط CNC",
  "Arc Radius Capacity": "قدرة نصف قطر القوس",
  "Standard Radius: R5, R8, R10, R15, R20, R25": "نصف القطر القياسي: R5، R8، R10، R15، R20، R25",
  "Large Radius: R30, R40, R50, R60, R80, R100": "نصف القطر الكبير: R30، R40، R50، R60، R80، R100",
  "Extra Large: R120, R150, R200mm": "كبير جدًا: R120، R150، R200 مم",
  "Custom Radius: Available on request": "نصف القطر المخصص: متاح عند الطلب",
  "Material Options": "خيارات المواد",
  "Steel Dies: Heat-treated 42CrMo (HRC 45-52)": "يموت الصلب: المعالجة بالحرارة 42CrMo (HRC 45-52)",
  "Urethane Dies: High-strength polyurethane": "يموت يوريتان: مادة البولي يوريثين عالية القوة",
  "Hybrid: Steel core with urethane surface": "هجين: قلب فولاذي مع سطح يوريتان",
  "Precision ground and polished finish": "أرضية دقيقة ولمسة نهائية مصقولة",
  "Die Configurations": "تكوينات يموت",
  "Single Radius Punches (fixed radius)": "اللكمات ذات نصف القطر الفردي (نصف القطر الثابت)",
  "Adjustable Radius Systems (multi-radius)": "أنظمة نصف قطر قابلة للتعديل (نصف قطر متعدد)",
  "Bump Forming Tooling (segmented arcs)": "أدوات تشكيل النتوء (أقواس مجزأة)",
  "Standard Lengths: 500mm, 835mm, custom": "الأطوال القياسية: 500 مم، 835 مم، مخصص",
  "Why Choose Our Arc Mold Radius Tooling?": "لماذا تختار أدوات نصف قطر قالب القوس لدينا؟",
  "Superior radius bending solutions engineered for smooth arc formation, mar-free finishing, and consistent repeatability in demanding production environments": "حلول ثني نصف قطرية فائقة تم تصميمها لتكوين قوس سلس، وتشطيب خالٍ من المار، وقابلية تكرار متسقة في بيئات الإنتاج الصعبة",
  "Smooth Radius Formation": "تشكيل نصف قطر سلس",
  "Produces consistently smooth curved bends without visible bend lines, kinking, or segmentation marks for superior aesthetic quality": "ينتج انحناءات منحنية ناعمة بشكل متسق بدون خطوط انحناء مرئية أو علامات انحناء أو تجزئة للحصول على جودة جمالية فائقة",
  "Mar-Free Bending": "مارس خالية من الانحناء",
  "Urethane die surfaces achieve entirely clean, mark-free bends allowing use of pre-finished or pre-painted sheet metal materials": "تحقق أسطح قوالب اليوريثان انحناءات نظيفة تمامًا وخالية من العلامات مما يسمح باستخدام مواد الصفائح المعدنية الجاهزة أو المطلية مسبقًا",
  "Versatile Radius Range": "نطاق نصف قطر متعدد الاستخدامات",
  "Wide range from small R5mm radii to large R200mm arcs, with adjustable systems offering multiple radii using the same bottom die": "نطاق واسع من أنصاف أقطار R5mm الصغيرة إلى أقواس R200mm الكبيرة، مع أنظمة قابلة للتعديل توفر أنصاف أقطار متعددة باستخدام نفس القالب السفلي",
  "Reduced Springback": "انخفاض الربيع",
  "Properly matched punch radius (63% of material thickness) minimizes springback and ensures consistent bend angles across production runs": "نصف قطر الثقب المطابق بشكل صحيح (63% من سمك المادة) يقلل من الزنبرك ويضمن زوايا انحناء متسقة عبر عمليات الإنتاج",
  "Extended Tool Life": "تمديد عمر الأداة",
  "Greater die radius reduces friction during bending, minimizing wear and extending tool life for cost-effective production": "يعمل نصف قطر القالب الأكبر على تقليل الاحتكاك أثناء الثني، مما يقلل من التآكل ويطيل عمر الأداة من أجل إنتاج فعال من حيث التكلفة",
  "Cost-Effective Solution": "حل فعال من حيث التكلفة",
  "Eliminates secondary finishing operations and reduces material waste from failed bends, lowering overall production costs": "يزيل عمليات التشطيب الثانوية ويقلل من هدر المواد الناتج عن الانحناءات الفاشلة، مما يقلل تكاليف الإنتاج الإجمالية",
  "Radius Tooling Types & Methods": "أنواع وأساليب أدوات نصف القطر",
  "Comprehensive range of arc mold tooling solutions for diverse radius bending applications and material requirements": "مجموعة شاملة من حلول أدوات قوالب القوس لتطبيقات ثني نصف القطر المتنوعة ومتطلبات المواد",
  "Steel Radius Punches": "اللكمات الشعاعية الفولاذية",
  "Precision-machined steel punches with fixed radius profiles from R5 to R100mm. Manufactured from heat-treated 42CrMo steel with HRC 45-52 hardness for durability. Tip radius designed at minimum 63% of material thickness to prevent stress concentration. Ideal for standard production radius bending with consistent repeatability.": "مثاقب فولاذية دقيقة الصنع ذات مقاطع نصف قطرها ثابتة من R5 إلى R100mm. ",
  "Urethane Radius Dies": "يموت نصف قطر يوريتان",
  "High-strength polyurethane bottom dies providing mar-free bending for pre-finished and pre-painted materials. Forgiving urethane material achieves clean bends without surface marking or scratching. Compatible with standard V-die holders. Ideal for architectural panels, appliances, and decorative metalwork requiring pristine surface finish.": "توفر القوالب السفلية المصنوعة من مادة البولي يوريثين عالية القوة انحناءًا خاليًا من المار للمواد الجاهزة والمطلية مسبقًا. ",
  "Large Radius Tooling Systems": "أنظمة أدوات نصف قطرها كبيرة",
  "Custom-engineered systems for forming large radius arcs (R80-R200mm) that exceed standard press brake table limits. Features modular segmented design for flexible radius adjustment. Compatible with CNC press brakes for automated radius control. Suitable for architectural metalwork, transportation equipment, and large curved panels.": "أنظمة مصممة خصيصًا لتشكيل أقواس نصف قطرها كبيرة (R80-R200mm) تتجاوز حدود طاولة مكابح الضغط القياسية. ",
  "Bump Forming Tooling": "أدوات تشكيل نتوء",
  "Specialized tooling for creating large radius arcs using multi-step bump forming technique. Approximates smooth arc with series of small incremental bends. Uses standard V-dies and punches with CNC programming for consistent results. Cost-effective solution for large radius applications without dedicated radius tooling investment.": "أدوات متخصصة لإنشاء أقواس نصف قطرها كبيرة باستخدام تقنية تشكيل النتوءات متعددة الخطوات. ",
  "Adjustable Radius Systems": "أنظمة نصف قطرها قابلة للتعديل",
  "Versatile tooling allowing multiple radius options using same bottom die by changing interchangeable radius punches. Reduces tooling inventory requirements while maintaining flexibility. Quick-change mounting for rapid setup between different radius specifications. Ideal for job shops handling diverse radius bending requirements.": "أدوات متعددة الاستخدامات تسمح بخيارات نصف قطر متعددة باستخدام نفس القالب السفلي عن طريق تغيير اللكمات نصف القطر القابلة للتبديل. ",
  "Hybrid Steel-Urethane Dies": "يموت الهجين الصلب يوريتان",
  "Advanced tooling combining steel core structural strength with urethane surface layer for mar-free bending. Provides durability of steel with surface protection of urethane. Suitable for high-volume production requiring both strength and surface quality. Extended tool life compared to pure urethane with maintained mar-free performance.": "أدوات متقدمة تجمع بين القوة الهيكلية الأساسية الفولاذية وطبقة سطح اليوريثان من أجل ثني خالٍ من المار. ",
  "Radius Bending in Action": "نصف القطر الانحناء في العمل",
  "Watch how our arc mold tooling produces smooth, consistent radius bends for professional results": "شاهد كيف تنتج أدوات القالب القوسي انحناءات نصف قطرية سلسة ومتسقة للحصول على نتائج احترافية",
  "Applications": "التطبيقات",
  "Arc mold radius tooling is essential for creating smooth curved bends across diverse industries and applications": "تعد أدوات نصف قطر القالب القوسي ضرورية لإنشاء انحناءات منحنية سلسة عبر الصناعات والتطبيقات المتنوعة",
  "Architectural Metalwork": "الأعمال المعدنية المعمارية",
  "Creating curved fascias, decorative panels, rounded building elements, and architectural features with smooth radius bends": "إنشاء واجهات منحنية وألواح زخرفية وعناصر بناء مستديرة وميزات معمارية ذات انحناءات نصف قطرية ناعمة",
  "Automotive Body Panels": "لوحات جسم السيارة",
  "Forming fenders, hoods, door panels, and other curved automotive components requiring smooth radius without surface marking": "تشكيل الرفارف والأغطية وألواح الأبواب ومكونات السيارات المنحنية الأخرى التي تتطلب نصف قطر سلس دون وضع علامات على السطح",
  "HVAC Ductwork": "مجاري الهواء HVAC",
  "Bending curved duct sections, radius elbows, and custom ventilation components for commercial HVAC systems": "أقسام مجاري الهواء المنحنية، والأكواع نصف القطر، ومكونات التهوية المخصصة لأنظمة التدفئة والتهوية وتكييف الهواء التجارية",
  "Furniture & Fixtures": "الأثاث والتركيبات",
  "Manufacturing curved metal furniture frames, shelving with radius bends, and decorative metal fixtures": "تصنيع إطارات الأثاث المعدنية المنحنية، والأرفف ذات الانحناءات نصف القطرية، والتركيبات المعدنية المزخرفة",
  "Appliance Manufacturing": "تصنيع الأجهزة",
  "Creating curved panels for refrigerators, washing machines, and appliances requiring smooth radius edges": "إنشاء ألواح منحنية للثلاجات والغسالات والأجهزة التي تتطلب حواف نصف قطرها ناعمة",
  "Transportation Equipment": "معدات النقل",
  "Forming curved components for buses, trains, trailers, and specialty vehicles requiring large radius bends": "تشكيل مكونات منحنية للحافلات والقطارات والمقطورات والمركبات المتخصصة التي تتطلب انحناءات نصف قطرها كبيرة",
  "Signage & Displays": "اللافتات والشاشات",
  "Creating curved letters, rounded sign faces, and display stands with smooth arc formation": "إنشاء أحرف منحنية ووجوه لافتة مستديرة وحوامل عرض ذات تشكيل قوسي سلس",
  "Industrial Enclosures": "العبوات الصناعية",
  "Bending rounded corners for control cabinets, electrical enclosures, and protective covers": "ثني الزوايا الدائرية لخزائن التحكم، والمرفقات الكهربائية، والأغطية الواقية",
  "Standard & Optional Tooling": "الأدوات القياسية والاختيارية",
  "Complete arc mold solutions with standard radius configurations and optional custom tooling for specialized applications": "حلول كاملة لقوالب القوس مع تكوينات نصف قطرية قياسية وأدوات مخصصة اختيارية للتطبيقات المتخصصة",
  "Standard Radius Tooling": "أدوات نصف القطر القياسية",
  "Optional Upgrades": "ترقيات اختيارية",
  "Need custom radius tooling for your application?": "هل تحتاج إلى أدوات نصف قطرية مخصصة لتطبيقك؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about arc mold and radius bending tooling": "أسئلة شائعة حول قوالب القوس وأدوات ثني نصف القطر",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump forming is cost-effective for occasional large radius work, while dedicated radius tooling provides superior surface finish and faster production for regular radius bending applications.": "يستخدم تشكيل النتوء قوالب V واللكمات القياسية مع برمجة CNC لإنشاء أقواس نصف قطرها كبيرة من خلال الانحناءات الإضافية الصغيرة المتعددة (تقريب القوس بمقاطع خطية). ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative metalwork, and any application where surface quality is critical. Steel dies are preferred for higher production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane combines both benefits.": "استخدم قوالب اليوريثان عند ثني المواد الجاهزة أو المطلية مسبقًا أو المصقولة حيث تكون علامات السطح غير مقبولة. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch tip radius to the natural internal radius created by the die opening for consistent angles. Consider material springback (stainless steel requires 1-2° compensation). Consult our technical team with your material specifications for optimal radius selection.": "يجب أن يكون نصف قطر الثقب 63% على الأقل من سمك المادة لمنع تركيز الضغط. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius dimensions, material specifications, production volume, and part drawings. Our engineering team will design custom arc molds optimized for your specific application. Custom tooling is particularly cost-effective for high-volume production runs requiring consistent radius specifications not available in standard tooling catalogs.": "نعم، نحن متخصصون في أدوات نصف القطر المخصصة للتطبيقات الفريدة. ",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending. Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "يعتمد الحد الأقصى لنصف القطر الذي يمكن تحقيقه على عرض طاولة فرامل الضغط ونظام الأدوات. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback: use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening to reduce stress, and consider coining for zero springback applications. Material-specific springback tables help predict and compensate for springback in production.": "يزداد Springback مع صلابة المادة ويتناقص مع نصف قطر الانحناء الأكبر. ",
  "Have a radius tooling question?": "هل لديك سؤال حول أدوات نصف القطر؟",
  "Download Arc Mold Catalog": "تحميل كتالوج قوالب القوس",
  "Get comprehensive technical specifications, radius charts, material options, and application guides for our complete range of arc mold and radius bending tooling.": "احصل على المواصفات الفنية الشاملة ومخططات نصف القطر وخيارات المواد وأدلة التطبيق لمجموعتنا الكاملة من قوالب القوس وأدوات ثني نصف القطر."
}