{
  "CNC Bending Machine Mold": "CNC曲げ機金型",
  "Professional press brake tooling and bending molds engineered from premium chromium molybdenum steel. Precision-machined dies and punches deliver consistent, high-quality bends with exceptional durability and extended tool life for demanding sheet metal fabrication applications.": "プロフェッショナル向けのプレス ブレーキ ツールと曲げ金型は、高級クロムモリブデン鋼から設計されています。",
  "Request Quote": "見積依頼",
  "Learn More": "もっと詳しく知る",
  "Technical Specifications": "技術仕様",
  "High-performance press brake tooling engineered for precision sheet metal bending operations": "精密な板金曲げ作業用に設計された高性能プレス ブレーキ ツール",
  "Material & Hardness": "材質と硬度",
  "Material: Chromium Molybdenum Steel (42CrMo, Cr12MoV)": "材質：クロムモリブデン鋼（42CrMo、Cr12MoV）",
  "Hardness: HRC 45-58 (heat-treated)": "硬度：HRC 45～58（熱処理済み）",
  "Alternative: T8, T10, H13, HSS grades": "代替品：T8、T10、H13、HSSグレード",
  "Surface Finish: Precision ground and polished": "表面仕上げ: 精密研磨および研磨",
  "Dimensions & Tolerance": "寸法と公差",
  "Standard Length: 500mm, 515mm, 835mm": "標準長さ：500mm、515mm、835mm",
  "Custom Lengths: Available upon request": "カスタム長さ: ご要望に応じてご利用いただけます",
  "Thickness Tolerance: ±0.001mm": "厚さ公差：±0.001mm",
  "Flatness: ±0.001mm (micron-level precision)": "平面度：±0.001mm（ミクロンレベルの精度）",
  "Die Types Available": "利用可能なダイタイプ",
  "V-Dies: Single, double, multi-groove": "V ダイ: シングル、ダブル、マルチグルーブ",
  "Gooseneck Dies: Return-flanging applications": "グースネックダイス: リターンフランジ用途",
  "Hemming Dies: Two-stage flattening": "ヘミングダイス：二段平坦化",
  "Custom Profiles: U-shape, polygonal, semi-circular": "カスタムプロファイル: U 字型、多角形、半円形",
  "Why Choose Our Press Brake Tooling?": "当社のプレス ブレーキ ツールを選ぶ理由",
  "Superior quality tooling engineered for precision, durability, and consistent performance in demanding sheet metal fabrication environments": "要求の厳しい板金製造環境において、精度、耐久性、および一貫したパフォーマンスを実現するように設計された高品質のツール",
  "Micron-Level Precision": "ミクロンレベルの精度",
  "Precision ground surfaces with thickness tolerance within ±0.001mm and flatness ±0.001mm ensure consistent, high-quality bends every time": "厚さ公差±0.001mm以内、平坦度±0.001mmの精密研削面により、毎回一貫した高品質な曲げ加工が保証されます。",
  "Superior Material Quality": "優れた素材品質",
  "Manufactured from premium chromium molybdenum steel with exceptional strength, corrosion resistance, and wear properties": "優れた強度、耐食性、摩耗特性を備えた高級クロムモリブデン鋼から製造",
  "Extended Tool Life": "工具寿命の延長",
  "Advanced heat treatment (HRC 45-58) provides superior hardness and wear resistance for longer service life and reduced replacement costs": "高度な熱処理 (HRC 45 ～ 58) により、優れた硬度と耐摩耗性が得られ、耐用年数が長くなり、交換コストが削減されます。",
  "Consistent Performance": "一貫したパフォーマンス",
  "Uniform hardness distribution and precision geometry ensure stable processing quality even under high-intensity production use": "均一な硬度分布と精密な形状により、高強度の生産用途でも安定した加工品質を保証します",
  "Versatile Die Options": "多彩なダイオプション",
  "Complete range of die types including V-dies, gooseneck, hemming, and custom profiles for diverse bending applications": "V ダイ、グースネック、ヘミング、さまざまな曲げ用途向けのカスタム プロファイルを含む、幅広いダイ タイプ",
  "Reduced Downtime": "ダウンタイムの削減",
  "Durable construction and wear resistance minimize regrind cycles and tool changes, maximizing production uptime": "耐久性のある構造と耐摩耗性により、再研磨サイクルと工具交換を最小限に抑え、生産稼働時間を最大化します。",
  "Tooling Types & Features": "ツーリングの種類と特徴",
  "Comprehensive range of precision-engineered press brake dies and punches for diverse bending applications": "さまざまな曲げ用途向けに精密に設計されたプレス ブレーキ ダイスおよびパンチの包括的な製品群",
  "V-Dies (Bottom Dies)": "Vダイ（下ダイ）",
  "The most common type of press brake tooling, V-dies feature varying die opening widths to accommodate different material thicknesses and bend angles. Available in single, double, and multi-groove configurations. Precision ground surfaces ensure accurate bend angles and consistent repeatability. Standard lengths: 500mm, 515mm, 835mm.": "最も一般的なタイプのプレス ブレーキ ツールである V ダイは、さまざまな材料の厚さと曲げ角度に対応するために、さまざまなダイ開口幅を備えています。",
  "Punches (Upper Tools)": "パンチ（上具）",
  "Precision-machined upper tooling with various nose radii and angles for different bending applications. Standard punch angles include 88°, 90°, and custom profiles. Heat-treated to HRC 45-58 for superior wear resistance. Compatible with quick-change segmented tooling systems for fast setup and changeover.": "さまざまな曲げ用途に対応するさまざまなノーズ半径と角度を備えた、精密機械加工された上部ツール。",
  "Gooseneck Dies (Return-Flanging)": "グースネックダイス（リターンフランジ）",
  "Specialized tooling designed for forming return flanges and working with pre-bent parts. The unique profile provides clearance for existing flanges, preventing interference during secondary bending operations. Essential for complex sheet metal fabrication requiring multiple bends and tight geometries.": "リターン フランジの形成と事前に曲げられた部品の作業用に設計された特殊なツール。",
  "Arc Bending Mold (Radius Dies)": "円弧曲げ金型（ラジアスダイス）",
  "Specialized curved tooling designed to form smooth radius bends and arcs with consistent curvature. Features precision-machined radius profiles (R5, R10, R15, R20, etc.) for creating rounded corners, cylindrical sections, and decorative curves. Essential for HVAC ductwork, pipe fittings, architectural metalwork, and decorative applications. Eliminates the need for post-bending forming operations while ensuring uniform radius along the entire bend length.": "一貫した曲率で滑らかな半径の曲げと円弧を形成するように設計された特殊な湾曲ツール。",
  "Custom Profile Dies": "カスタムプロファイルダイ",
  "Engineered custom tooling for specialized bending applications including U-channels, Z-profiles, radius bends, offset bends, and complex geometries. Manufactured to customer specifications with tight tolerances. Ideal for high-volume production requiring consistent, repeatable custom profiles.": "U チャネル、Z プロファイル、半径曲げ、オフセット曲げ、複雑な形状などの特殊な曲げ用途向けに設計されたカスタム ツールです。",
  "Lower Die (V-Die / Bottom Die)": "下型（V型・下型）",
  "The foundation component of press brake tooling featuring precision-machined V-grooves in various opening widths (6V, 8V, 12V, 16V, etc.). Constructed from hardened chromium molybdenum steel with ground surfaces for superior accuracy. Available in single-groove and multi-groove configurations to accommodate different material thicknesses. The V-opening determines the minimum bend radius and is critical for achieving accurate bend angles. Features secure mounting channels for stable clamping to the press brake bed, ensuring consistent positioning and repeat accuracy across production runs.": "さまざまな開口幅 (6V、8V、12V、16V など) の精密加工された V 溝を備えたプレス ブレーキ ツールの基礎コンポーネントです。",
  "Press Brake Tooling in Action": "動作中のプレス ブレーキ ツール",
  "See how our precision tooling delivers consistent, high-quality bends in production environments": "当社の精密ツーリングが生産環境でどのように一貫した高品質の曲げを実現するかをご覧ください。",
  "Applications": "アプリケーション",
  "Our press brake tooling systems are essential for precision sheet metal bending across diverse industries": "当社のプレス ブレーキ ツーリング システムは、さまざまな業界の精密板金曲げ加工に不可欠です。",
  "Aerospace Manufacturing": "航空宇宙製造",
  "Creating lightweight, high-strength structural components, brackets, and panels for aircraft with tight tolerances": "厳しい公差を備えた航空機用の軽量で高強度の構造コンポーネント、ブラケット、パネルの作成",
  "Automotive Industry": "自動車産業",
  "Bending chassis components, body panels, brackets, and structural parts for cars, trucks, and commercial vehicles": "乗用車、トラック、商用車の曲げシャーシ部品、ボディパネル、ブラケット、構造部品",
  "Shipbuilding": "造船",
  "Forming hull sections, deck plates, bulkheads, and structural steel elements for marine vessels": "船舶の船体部分、甲板板、隔壁、構造用鋼材の成形",
  "Electronics Enclosures": "電子機器の筐体",
  "Precision bending of server racks, control cabinets, electrical panels, and equipment housings": "サーバーラック、制御盤、電気パネル、機器筐体の精密曲げ加工",
  "HVAC & Ventilation": "冷暖房空調設備と換気",
  "Forming ductwork, air handling units, and ventilation components for commercial and industrial applications": "商業および産業用途向けのダクト、エアハンドリングユニット、換気コンポーネントの形成",
  "Appliance Manufacturing": "家電製品の製造",
  "Bending panels and components for refrigerators, ovens, washers, and other household appliances": "冷蔵庫、オーブン、洗濯機、その他の家庭用電化製品用の曲げパネルとコンポーネント",
  "Furniture & Fixtures": "家具と備品",
  "Creating metal furniture frames, shelving systems, and architectural metalwork with decorative bends": "金属製の家具フレーム、棚システム、装飾的な曲げを備えた建築用金属加工品の作成",
  "Construction Equipment": "建設機械",
  "Manufacturing structural components, brackets, and protective covers for heavy machinery and equipment": "重機や設備の構造部品、ブラケット、保護カバーの製造",
  "Standard & Optional Tooling": "標準およびオプションのツール",
  "Complete tooling solutions with standard configurations and optional upgrades for specialized applications": "標準構成と特殊なアプリケーション向けのオプションのアップグレードを備えた完全なツール ソリューション",
  "Standard Tooling Set": "標準ツーリングセット",
  "Optional Upgrades": "オプションのアップグレード",
  "Need custom tooling for your application?": "アプリケーションにカスタム ツールが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about press brake tooling and bending molds": "プレスブレーキツーリングと曲げ金型に関するよくある質問",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength, wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production volume, material being bent, and required tool life.": "クロムモリブデン鋼 (42CrMo、Cr12MoV) は業界標準であり、優れた強度、耐摩耗性、腐食保護を提供します。",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example, 2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider die openings.": "一般的なルールは、材料の厚さの 8 倍の V ダイ開口部を使用することです (8T ルール)。",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness extends tool life but requires careful handling to avoid chipping.": "標準的なプレス ブレーキ ツールの硬度は通常 HRC 45 ～ 52 で、亀裂を防ぐ靭性を維持しながら優れた耐摩耗性を実現します。",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings, material specifications, and bend requirements. Our engineering team will design custom dies for U-channels, Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results for high-volume production runs.": "はい、当社は独自の曲げ用途向けのカスタム ツールを専門としています。",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection maximize longevity. Worn tooling can be reground to restore performance.": "工具寿命は、曲げられる材料、曲げの頻度、適用トン数、およびメンテナンスによって異なります。",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "ヨーロッパのツーリング (Wila、Amada、Trumpf システム) は、標準化されたクランプ システムを備えたセグメント化されたクイックチェンジ ツーリングを使用して、迅速なセットアップを実現します。",
  "Have a specific tooling question?": "特定のツールに関する質問がありますか?",
  "Download Tooling Catalog": "ツーリングカタログをダウンロード",
  "Get comprehensive technical specifications, dimensional drawings, material grades, and tooling selection guides for our complete range of press brake dies and punches.": "当社の全範囲のプレス ブレーキ ダイおよびパンチに関する包括的な技術仕様、寸法図、材料グレード、工具選択ガイドを入手してください。"
}