{
  "CNC Bending Machine Mold": "Moule de machine à cintrer CNC",
  "Professional press brake tooling and bending molds engineered from premium chromium molybdenum steel. Precision-machined dies and punches deliver consistent, high-quality bends with exceptional durability and extended tool life for demanding sheet metal fabrication applications.": "Outillage professionnel pour presse plieuse et moules de pliage fabriqués à partir d'acier au chrome-molybdène de qualité supérieure. ",
  "Request Quote": "Demander un devis",
  "Learn More": "Apprendre encore plus",
  "Technical Specifications": "Spécifications techniques",
  "High-performance press brake tooling engineered for precision sheet metal bending operations": "Outillage de presse plieuse haute performance conçu pour les opérations de pliage de tôle de précision",
  "Material & Hardness": "Matériau et dureté",
  "Material: Chromium Molybdenum Steel (42CrMo, Cr12MoV)": "Matériau : acier au chrome-molybdène (42CrMo, Cr12MoV)",
  "Hardness: HRC 45-58 (heat-treated)": "Dureté : HRC 45-58 (traité thermiquement)",
  "Alternative: T8, T10, H13, HSS grades": "Alternative : nuances T8, T10, H13, HSS",
  "Surface Finish: Precision ground and polished": "Finition de surface : rectifiée et polie avec précision",
  "Dimensions & Tolerance": "Dimensions et tolérance",
  "Standard Length: 500mm, 515mm, 835mm": "Longueur standard : 500 mm, 515 mm, 835 mm",
  "Custom Lengths: Available upon request": "Longueurs personnalisées : disponibles sur demande",
  "Thickness Tolerance: ±0.001mm": "Tolérance d'épaisseur : ±0,001 mm",
  "Flatness: ±0.001mm (micron-level precision)": "Planéité : ±0,001 mm (précision au micron)",
  "Die Types Available": "Types de matrices disponibles",
  "V-Dies: Single, double, multi-groove": "Matrices en V : simples, doubles, multi-rainures",
  "Gooseneck Dies: Return-flanging applications": "Matrices à col de cygne : applications de bridage de retour",
  "Hemming Dies: Two-stage flattening": "Matrices d'ourlet : aplatissement en deux étapes",
  "Custom Profiles: U-shape, polygonal, semi-circular": "Profils personnalisés : en forme de U, polygonal, semi-circulaire",
  "Why Choose Our Press Brake Tooling?": "Pourquoi choisir notre outillage de presse plieuse ?",
  "Superior quality tooling engineered for precision, durability, and consistent performance in demanding sheet metal fabrication environments": "Outillage de qualité supérieure conçu pour la précision, la durabilité et des performances constantes dans les environnements exigeants de fabrication de tôlerie",
  "Micron-Level Precision": "Précision au niveau du micron",
  "Precision ground surfaces with thickness tolerance within ±0.001mm and flatness ±0.001mm ensure consistent, high-quality bends every time": "Les surfaces rectifiées avec précision avec une tolérance d'épaisseur de ± 0,001 mm et une planéité de ± 0,001 mm garantissent des courbures constantes et de haute qualité à chaque fois.",
  "Superior Material Quality": "Qualité supérieure des matériaux",
  "Manufactured from premium chromium molybdenum steel with exceptional strength, corrosion resistance, and wear properties": "Fabriqué à partir d'acier au chrome-molybdène de qualité supérieure avec des propriétés exceptionnelles de résistance, de résistance à la corrosion et d'usure.",
  "Extended Tool Life": "Durée de vie prolongée de l'outil",
  "Advanced heat treatment (HRC 45-58) provides superior hardness and wear resistance for longer service life and reduced replacement costs": "Le traitement thermique avancé (HRC 45-58) offre une dureté et une résistance à l'usure supérieures pour une durée de vie plus longue et des coûts de remplacement réduits.",
  "Consistent Performance": "Performances constantes",
  "Uniform hardness distribution and precision geometry ensure stable processing quality even under high-intensity production use": "La répartition uniforme de la dureté et la géométrie précise garantissent une qualité de traitement stable, même dans des conditions de production à haute intensité.",
  "Versatile Die Options": "Options de matrices polyvalentes",
  "Complete range of die types including V-dies, gooseneck, hemming, and custom profiles for diverse bending applications": "Gamme complète de types de matrices, notamment des matrices en V, des cols de cygne, des ourlets et des profils personnalisés pour diverses applications de pliage",
  "Reduced Downtime": "Temps d'arrêt réduits",
  "Durable construction and wear resistance minimize regrind cycles and tool changes, maximizing production uptime": "La construction durable et la résistance à l'usure minimisent les cycles de réaffûtage et les changements d'outils, maximisant ainsi la disponibilité de la production",
  "Tooling Types & Features": "Types et caractéristiques d'outillage",
  "Comprehensive range of precision-engineered press brake dies and punches for diverse bending applications": "Gamme complète de matrices et de poinçons pour presses plieuses de précision pour diverses applications de pliage",
  "V-Dies (Bottom Dies)": "Matrices en V (matrices inférieures)",
  "The most common type of press brake tooling, V-dies feature varying die opening widths to accommodate different material thicknesses and bend angles. Available in single, double, and multi-groove configurations. Precision ground surfaces ensure accurate bend angles and consistent repeatability. Standard lengths: 500mm, 515mm, 835mm.": "Type d'outillage de presse plieuse le plus courant, les matrices en V présentent différentes largeurs d'ouverture de matrice pour s'adapter à différentes épaisseurs de matériau et angles de pliage. ",
  "Punches (Upper Tools)": "Poinçons (outils supérieurs)",
  "Precision-machined upper tooling with various nose radii and angles for different bending applications. Standard punch angles include 88°, 90°, and custom profiles. Heat-treated to HRC 45-58 for superior wear resistance. Compatible with quick-change segmented tooling systems for fast setup and changeover.": "Outillage supérieur usiné avec précision avec différents rayons et angles de nez pour différentes applications de pliage. ",
  "Gooseneck Dies (Return-Flanging)": "Matrices à col de cygne (retour-bride)",
  "Specialized tooling designed for forming return flanges and working with pre-bent parts. The unique profile provides clearance for existing flanges, preventing interference during secondary bending operations. Essential for complex sheet metal fabrication requiring multiple bends and tight geometries.": "Outillage spécialisé conçu pour former des brides de retour et travailler avec des pièces pré-courbées. ",
  "Arc Bending Mold (Radius Dies)": "Moule de cintrage d'arc (matrices de rayon)",
  "Specialized curved tooling designed to form smooth radius bends and arcs with consistent curvature. Features precision-machined radius profiles (R5, R10, R15, R20, etc.) for creating rounded corners, cylindrical sections, and decorative curves. Essential for HVAC ductwork, pipe fittings, architectural metalwork, and decorative applications. Eliminates the need for post-bending forming operations while ensuring uniform radius along the entire bend length.": "Outillage incurvé spécialisé conçu pour former des courbures et des arcs à rayon lisse avec une courbure constante. ",
  "Custom Profile Dies": "Matrices de profil personnalisées",
  "Engineered custom tooling for specialized bending applications including U-channels, Z-profiles, radius bends, offset bends, and complex geometries. Manufactured to customer specifications with tight tolerances. Ideal for high-volume production requiring consistent, repeatable custom profiles.": "Outillage personnalisé conçu pour les applications de pliage spécialisées, notamment les canaux en U, les profils en Z, les cintrages à rayon, les cintrages décalés et les géométries complexes. ",
  "Lower Die (V-Die / Bottom Die)": "Matrice inférieure (Matrice en V / Matrice inférieure)",
  "The foundation component of press brake tooling featuring precision-machined V-grooves in various opening widths (6V, 8V, 12V, 16V, etc.). Constructed from hardened chromium molybdenum steel with ground surfaces for superior accuracy. Available in single-groove and multi-groove configurations to accommodate different material thicknesses. The V-opening determines the minimum bend radius and is critical for achieving accurate bend angles. Features secure mounting channels for stable clamping to the press brake bed, ensuring consistent positioning and repeat accuracy across production runs.": "Le composant de base de l'outillage de presse plieuse, doté de rainures en V usinées avec précision dans différentes largeurs d'ouverture (6 V, 8 V, 12 V, 16 V, etc.). ",
  "Press Brake Tooling in Action": "L'outillage de presse plieuse en action",
  "See how our precision tooling delivers consistent, high-quality bends in production environments": "Découvrez comment nos outils de précision permettent d'obtenir des pliages constants et de haute qualité dans les environnements de production.",
  "Applications": "Applications",
  "Our press brake tooling systems are essential for precision sheet metal bending across diverse industries": "Nos systèmes d'outillage pour presses plieuses sont essentiels pour le pliage de précision de la tôle dans diverses industries",
  "Aerospace Manufacturing": "Fabrication aérospatiale",
  "Creating lightweight, high-strength structural components, brackets, and panels for aircraft with tight tolerances": "Création de composants structurels, de supports et de panneaux légers et à haute résistance pour les avions avec des tolérances serrées",
  "Automotive Industry": "Industrie automobile",
  "Bending chassis components, body panels, brackets, and structural parts for cars, trucks, and commercial vehicles": "Pliage de composants de châssis, de panneaux de carrosserie, de supports et de pièces structurelles pour voitures, camions et véhicules utilitaires",
  "Shipbuilding": "Construction navale",
  "Forming hull sections, deck plates, bulkheads, and structural steel elements for marine vessels": "Formage de sections de coque, de plaques de pont, de cloisons et d'éléments de construction en acier pour navires marins",
  "Electronics Enclosures": "Boîtiers électroniques",
  "Precision bending of server racks, control cabinets, electrical panels, and equipment housings": "Pliage de précision des racks de serveurs, des armoires de commande, des panneaux électriques et des boîtiers d'équipements",
  "HVAC & Ventilation": "CVC et ventilation",
  "Forming ductwork, air handling units, and ventilation components for commercial and industrial applications": "Formation de conduits, d'unités de traitement d'air et de composants de ventilation pour des applications commerciales et industrielles",
  "Appliance Manufacturing": "Fabrication d'appareils électroménagers",
  "Bending panels and components for refrigerators, ovens, washers, and other household appliances": "Panneaux et composants de pliage pour réfrigérateurs, fours, laveuses et autres appareils électroménagers",
  "Furniture & Fixtures": "Meubles et accessoires",
  "Creating metal furniture frames, shelving systems, and architectural metalwork with decorative bends": "Création de cadres de meubles en métal, de systèmes d'étagères et de ferronnerie architecturale avec des coudes décoratifs",
  "Construction Equipment": "Matériel de construction",
  "Manufacturing structural components, brackets, and protective covers for heavy machinery and equipment": "Fabrication de composants structurels, de supports et de capots de protection pour machines et équipements lourds",
  "Standard & Optional Tooling": "Outillage standard et optionnel",
  "Complete tooling solutions with standard configurations and optional upgrades for specialized applications": "Solutions d'outillage complètes avec configurations standard et mises à niveau facultatives pour les applications spécialisées",
  "Standard Tooling Set": "Ensemble d'outillage standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need custom tooling for your application?": "Besoin d'un outillage personnalisé pour votre application ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about press brake tooling and bending molds": "Questions courantes sur les outils de presse plieuse et les moules de pliage",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength, wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production volume, material being bent, and required tool life.": "L'acier au chrome-molybdène (42CrMo, Cr12MoV) est la norme de l'industrie, offrant une résistance, une résistance à l'usure et une protection contre la corrosion exceptionnelles. ",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example, 2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider die openings.": "La règle générale est d'utiliser une ouverture en V correspondant à 8 fois l'épaisseur du matériau (règle des 8T). ",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness extends tool life but requires careful handling to avoid chipping.": "L'outillage standard des presses plieuses a généralement une dureté de HRC 45-52, ce qui offre une excellente résistance à l'usure tout en conservant la ténacité pour éviter les fissures. ",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings, material specifications, and bend requirements. Our engineering team will design custom dies for U-channels, Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results for high-volume production runs.": "Oui, nous sommes spécialisés dans les outils personnalisés pour des applications de pliage uniques. ",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection maximize longevity. Worn tooling can be reground to restore performance.": "La durée de vie de l'outil dépend du matériau plié, de la fréquence de pliage, du tonnage appliqué et de l'entretien. ",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "L'outillage européen (systèmes Wila, Amada, Trumpf) utilise des outils segmentés à changement rapide avec des systèmes de serrage standardisés pour une installation rapide. ",
  "Have a specific tooling question?": "Vous avez une question spécifique sur l'outillage ?",
  "Download Tooling Catalog": "Télécharger le catalogue d'outillage",
  "Get comprehensive technical specifications, dimensional drawings, material grades, and tooling selection guides for our complete range of press brake dies and punches.": "Obtenez des spécifications techniques complètes, des dessins dimensionnels, des qualités de matériaux et des guides de sélection d'outillage pour notre gamme complète de matrices et de poinçons pour presses plieuses."
}