{
  "CNC Bending Machine Mold": "Molde de máquina dobladora CNC",
  "Professional press brake tooling and bending molds engineered from premium chromium molybdenum steel. Precision-machined dies and punches deliver consistent, high-quality bends with exceptional durability and extended tool life for demanding sheet metal fabrication applications.": "Herramientas profesionales para plegadoras y moldes de doblado diseñados con acero al cromo molibdeno de primera calidad. ",
  "Request Quote": "Solicitar Cotización",
  "Learn More": "Más información",
  "Technical Specifications": "Especificaciones técnicas",
  "High-performance press brake tooling engineered for precision sheet metal bending operations": "Herramientas plegadoras de alto rendimiento diseñadas para operaciones de doblado de chapa de precisión",
  "Material & Hardness": "Material y dureza",
  "Material: Chromium Molybdenum Steel (42CrMo, Cr12MoV)": "Material: Acero al cromo molibdeno (42CrMo, Cr12MoV)",
  "Hardness: HRC 45-58 (heat-treated)": "Dureza: HRC 45-58 (tratado térmicamente)",
  "Alternative: T8, T10, H13, HSS grades": "Alternativa: grados T8, T10, H13, HSS",
  "Surface Finish: Precision ground and polished": "Acabado de la superficie: rectificado y pulido con precisión",
  "Dimensions & Tolerance": "Dimensiones y tolerancia",
  "Standard Length: 500mm, 515mm, 835mm": "Longitud estándar: 500 mm, 515 mm, 835 mm",
  "Custom Lengths: Available upon request": "Longitudes personalizadas: disponibles a pedido",
  "Thickness Tolerance: ±0.001mm": "Tolerancia de espesor: ±0,001 mm",
  "Flatness: ±0.001mm (micron-level precision)": "Planitud: ±0,001 mm (precisión a nivel de micras)",
  "Die Types Available": "Tipos de matrices disponibles",
  "V-Dies: Single, double, multi-groove": "V-Dies: Simple, doble, multi-ranura",
  "Gooseneck Dies: Return-flanging applications": "Matrices de cuello de cisne: aplicaciones de brida de retorno",
  "Hemming Dies: Two-stage flattening": "Troqueles para dobladillo: aplanamiento en dos etapas",
  "Custom Profiles: U-shape, polygonal, semi-circular": "Perfiles personalizados: en forma de U, poligonal, semicircular",
  "Why Choose Our Press Brake Tooling?": "¿Por qué elegir nuestras herramientas para plegadoras?",
  "Superior quality tooling engineered for precision, durability, and consistent performance in demanding sheet metal fabrication environments": "Herramientas de calidad superior diseñadas para brindar precisión, durabilidad y rendimiento constante en entornos exigentes de fabricación de chapa metálica.",
  "Micron-Level Precision": "Precisión a nivel de micras",
  "Precision ground surfaces with thickness tolerance within ±0.001mm and flatness ±0.001mm ensure consistent, high-quality bends every time": "Las superficies rectificadas de precisión con una tolerancia de espesor de ±0,001 mm y una planitud de ±0,001 mm garantizan curvaturas consistentes y de alta calidad en todo momento.",
  "Superior Material Quality": "Calidad superior de los materiales",
  "Manufactured from premium chromium molybdenum steel with exceptional strength, corrosion resistance, and wear properties": "Fabricado con acero al cromo molibdeno de primera calidad con excepcional resistencia, resistencia a la corrosión y propiedades de desgaste.",
  "Extended Tool Life": "Vida útil extendida de la herramienta",
  "Advanced heat treatment (HRC 45-58) provides superior hardness and wear resistance for longer service life and reduced replacement costs": "El tratamiento térmico avanzado (HRC 45-58) proporciona dureza y resistencia al desgaste superiores para una vida útil más larga y costos de reemplazo reducidos.",
  "Consistent Performance": "Rendimiento consistente",
  "Uniform hardness distribution and precision geometry ensure stable processing quality even under high-intensity production use": "La distribución uniforme de la dureza y la geometría de precisión garantizan una calidad de procesamiento estable incluso bajo un uso de producción de alta intensidad.",
  "Versatile Die Options": "Opciones de matrices versátiles",
  "Complete range of die types including V-dies, gooseneck, hemming, and custom profiles for diverse bending applications": "Gama completa de tipos de troqueles, incluidos troqueles en V, cuello de cisne, dobladillos y perfiles personalizados para diversas aplicaciones de plegado",
  "Reduced Downtime": "Tiempo de inactividad reducido",
  "Durable construction and wear resistance minimize regrind cycles and tool changes, maximizing production uptime": "La construcción duradera y la resistencia al desgaste minimizan los ciclos de rectificado y los cambios de herramientas, maximizando el tiempo de actividad de la producción.",
  "Tooling Types & Features": "Tipos y características de herramientas",
  "Comprehensive range of precision-engineered press brake dies and punches for diverse bending applications": "Gama completa de troqueles y punzones para plegadoras diseñados con precisión para diversas aplicaciones de plegado",
  "V-Dies (Bottom Dies)": "Troqueles en V (troqueles inferiores)",
  "The most common type of press brake tooling, V-dies feature varying die opening widths to accommodate different material thicknesses and bend angles. Available in single, double, and multi-groove configurations. Precision ground surfaces ensure accurate bend angles and consistent repeatability. Standard lengths: 500mm, 515mm, 835mm.": "Los troqueles en V, el tipo más común de herramientas para plegadoras, cuentan con diferentes anchos de apertura de troquel para adaptarse a diferentes espesores de material y ángulos de curvatura. ",
  "Punches (Upper Tools)": "Punzones (herramientas superiores)",
  "Precision-machined upper tooling with various nose radii and angles for different bending applications. Standard punch angles include 88°, 90°, and custom profiles. Heat-treated to HRC 45-58 for superior wear resistance. Compatible with quick-change segmented tooling systems for fast setup and changeover.": "Herramientas superiores mecanizadas con precisión con varios radios de punta y ángulos para diferentes aplicaciones de doblado. ",
  "Gooseneck Dies (Return-Flanging)": "Matrices de cuello de cisne (bridas de retorno)",
  "Specialized tooling designed for forming return flanges and working with pre-bent parts. The unique profile provides clearance for existing flanges, preventing interference during secondary bending operations. Essential for complex sheet metal fabrication requiring multiple bends and tight geometries.": "Herramientas especializadas diseñadas para formar bridas de retorno y trabajar con piezas precurvadas. ",
  "Arc Bending Mold (Radius Dies)": "Molde para doblar arco (troqueles de radio)",
  "Specialized curved tooling designed to form smooth radius bends and arcs with consistent curvature. Features precision-machined radius profiles (R5, R10, R15, R20, etc.) for creating rounded corners, cylindrical sections, and decorative curves. Essential for HVAC ductwork, pipe fittings, architectural metalwork, and decorative applications. Eliminates the need for post-bending forming operations while ensuring uniform radius along the entire bend length.": "Herramientas curvas especializadas diseñadas para formar curvas y arcos de radio suave con curvatura constante. ",
  "Custom Profile Dies": "Troqueles de perfil personalizados",
  "Engineered custom tooling for specialized bending applications including U-channels, Z-profiles, radius bends, offset bends, and complex geometries. Manufactured to customer specifications with tight tolerances. Ideal for high-volume production requiring consistent, repeatable custom profiles.": "Herramientas personalizadas diseñadas para aplicaciones de plegado especializadas, incluidos canales en U, perfiles en Z, plegados de radio, plegados desplazados y geometrías complejas. ",
  "Lower Die (V-Die / Bottom Die)": "Troquel inferior (troquel en V / troquel inferior)",
  "The foundation component of press brake tooling featuring precision-machined V-grooves in various opening widths (6V, 8V, 12V, 16V, etc.). Constructed from hardened chromium molybdenum steel with ground surfaces for superior accuracy. Available in single-groove and multi-groove configurations to accommodate different material thicknesses. The V-opening determines the minimum bend radius and is critical for achieving accurate bend angles. Features secure mounting channels for stable clamping to the press brake bed, ensuring consistent positioning and repeat accuracy across production runs.": "El componente básico de las herramientas de plegadora con ranuras en V mecanizadas con precisión en varios anchos de apertura (6V, 8V, 12V, 16V, etc.). ",
  "Press Brake Tooling in Action": "Herramientas para prensa plegadora en acción",
  "See how our precision tooling delivers consistent, high-quality bends in production environments": "Vea cómo nuestras herramientas de precisión ofrecen plegados consistentes y de alta calidad en entornos de producción.",
  "Applications": "Aplicaciones",
  "Our press brake tooling systems are essential for precision sheet metal bending across diverse industries": "Nuestros sistemas de herramientas para plegadoras son esenciales para el doblado de chapa de precisión en diversas industrias.",
  "Aerospace Manufacturing": "Fabricación aeroespacial",
  "Creating lightweight, high-strength structural components, brackets, and panels for aircraft with tight tolerances": "Creación de componentes estructurales, soportes y paneles livianos y de alta resistencia para aeronaves con tolerancias estrictas.",
  "Automotive Industry": "Industria automotriz",
  "Bending chassis components, body panels, brackets, and structural parts for cars, trucks, and commercial vehicles": "Doblado de componentes de chasis, paneles de carrocería, soportes y piezas estructurales para automóviles, camiones y vehículos comerciales.",
  "Shipbuilding": "Construcción naval",
  "Forming hull sections, deck plates, bulkheads, and structural steel elements for marine vessels": "Conformado de secciones de casco, placas de cubierta, mamparos y elementos estructurales de acero para embarcaciones marinas.",
  "Electronics Enclosures": "Cajas electrónicas",
  "Precision bending of server racks, control cabinets, electrical panels, and equipment housings": "Doblado de precisión de bastidores de servidores, gabinetes de control, paneles eléctricos y carcasas de equipos",
  "HVAC & Ventilation": "Climatización y ventilación",
  "Forming ductwork, air handling units, and ventilation components for commercial and industrial applications": "Formación de conductos, unidades de tratamiento de aire y componentes de ventilación para aplicaciones comerciales e industriales.",
  "Appliance Manufacturing": "Fabricación de electrodomésticos",
  "Bending panels and components for refrigerators, ovens, washers, and other household appliances": "Curvado de paneles y componentes para frigoríficos, hornos, lavadoras y otros electrodomésticos.",
  "Furniture & Fixtures": "Muebles y accesorios",
  "Creating metal furniture frames, shelving systems, and architectural metalwork with decorative bends": "Creación de marcos de muebles metálicos, sistemas de estanterías y carpintería metálica arquitectónica con curvas decorativas.",
  "Construction Equipment": "Equipo de construcción",
  "Manufacturing structural components, brackets, and protective covers for heavy machinery and equipment": "Fabricación de componentes estructurales, soportes y cubiertas protectoras para maquinaria y equipo pesado.",
  "Standard & Optional Tooling": "Herramientas estándar y opcionales",
  "Complete tooling solutions with standard configurations and optional upgrades for specialized applications": "Soluciones completas de herramientas con configuraciones estándar y actualizaciones opcionales para aplicaciones especializadas",
  "Standard Tooling Set": "Juego de herramientas estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need custom tooling for your application?": "¿Necesita herramientas personalizadas para su aplicación?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about press brake tooling and bending molds": "Preguntas comunes sobre herramientas para plegadoras y moldes para doblar",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength, wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production volume, material being bent, and required tool life.": "El acero al cromo molibdeno (42CrMo, Cr12MoV) es el estándar de la industria y ofrece resistencia excepcional, resistencia al desgaste y protección contra la corrosión. ",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example, 2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider die openings.": "La regla general es utilizar una abertura de matriz en V que sea 8 veces el espesor del material (regla 8T). ",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness extends tool life but requires careful handling to avoid chipping.": "Las herramientas estándar para plegadoras suelen tener una dureza de HRC 45-52, lo que proporciona una excelente resistencia al desgaste y al mismo tiempo mantiene la tenacidad para evitar grietas. ",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings, material specifications, and bend requirements. Our engineering team will design custom dies for U-channels, Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results for high-volume production runs.": "Sí, nos especializamos en herramientas personalizadas para aplicaciones de doblado únicas. ",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection maximize longevity. Worn tooling can be reground to restore performance.": "La vida útil de la herramienta depende del material que se dobla, la frecuencia de doblado, el tonelaje aplicado y el mantenimiento. ",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "Las herramientas europeas (sistemas Wila, Amada, Trumpf) utilizan herramientas segmentadas de cambio rápido con sistemas de sujeción estandarizados para una configuración rápida. ",
  "Have a specific tooling question?": "¿Tiene alguna pregunta específica sobre herramientas?",
  "Download Tooling Catalog": "Descargar catálogo de herramientas",
  "Get comprehensive technical specifications, dimensional drawings, material grades, and tooling selection guides for our complete range of press brake dies and punches.": "Obtenga especificaciones técnicas completas, dibujos dimensionales, grados de materiales y guías de selección de herramientas para nuestra gama completa de troqueles y punzones para plegadoras."
}