{
  "CNC Bending Machine Mold": "Пресс-форма для гибочной машины с ЧПУ",
  "Professional press brake tooling and bending molds engineered from premium chromium molybdenum steel. Precision-machined dies and punches deliver consistent, high-quality bends with exceptional durability and extended tool life for demanding sheet metal fabrication applications.": "Профессиональные листогибочные инструменты и гибочные формы, изготовленные из хромомолибденовой стали премиум-класса. ",
  "Request Quote": "Запросить цену",
  "Learn More": "Узнать больше",
  "Technical Specifications": "Технические характеристики",
  "High-performance press brake tooling engineered for precision sheet metal bending operations": "Высокопроизводительный листогибочный пресс, разработанный для операций прецизионной гибки листового металла.",
  "Material & Hardness": "Материал и твердость",
  "Material: Chromium Molybdenum Steel (42CrMo, Cr12MoV)": "Материал: хромомолибденовая сталь (42CrMo, Cr12MoV).",
  "Hardness: HRC 45-58 (heat-treated)": "Твердость: HRC 45-58 (термообработанный).",
  "Alternative: T8, T10, H13, HSS grades": "Альтернатива: марки T8, T10, H13, HSS.",
  "Surface Finish: Precision ground and polished": "Поверхностная обработка: прецизионная шлифовка и полировка.",
  "Dimensions & Tolerance": "Размеры и допуски",
  "Standard Length: 500mm, 515mm, 835mm": "Стандартная длина: 500 мм, 515 мм, 835 мм",
  "Custom Lengths: Available upon request": "Нестандартная длина: доступна по запросу.",
  "Thickness Tolerance: ±0.001mm": "Допуск толщины: ± 0,001 мм",
  "Flatness: ±0.001mm (micron-level precision)": "Плоскостность: ±0,001 мм (точность на уровне микрона)",
  "Die Types Available": "Доступные типы штампов",
  "V-Dies: Single, double, multi-groove": "V-образные матрицы: одинарные, двойные, с несколькими канавками.",
  "Gooseneck Dies: Return-flanging applications": "Пластины на гибкой шейке: применение для обратного отбортовывания",
  "Hemming Dies: Two-stage flattening": "Штамповочные штампы: двухэтапное плющение",
  "Custom Profiles: U-shape, polygonal, semi-circular": "Пользовательские профили: U-образный, многоугольный, полукруглый.",
  "Why Choose Our Press Brake Tooling?": "Почему стоит выбрать наши инструменты для листогибочного пресса?",
  "Superior quality tooling engineered for precision, durability, and consistent performance in demanding sheet metal fabrication environments": "Инструменты превосходного качества, разработанные для обеспечения точности, долговечности и стабильной производительности в сложных условиях производства листового металла.",
  "Micron-Level Precision": "Микронная точность",
  "Precision ground surfaces with thickness tolerance within ±0.001mm and flatness ±0.001mm ensure consistent, high-quality bends every time": "Прецизионные шлифованные поверхности с допуском по толщине в пределах ±0,001 мм и плоскостностью ±0,001 мм обеспечивают постоянные и высококачественные изгибы каждый раз.",
  "Superior Material Quality": "Превосходное качество материала",
  "Manufactured from premium chromium molybdenum steel with exceptional strength, corrosion resistance, and wear properties": "Изготовлен из хромомолибденовой стали премиум-класса с исключительной прочностью, коррозионной стойкостью и износостойкостью.",
  "Extended Tool Life": "Увеличенный срок службы инструмента",
  "Advanced heat treatment (HRC 45-58) provides superior hardness and wear resistance for longer service life and reduced replacement costs": "Усовершенствованная термообработка (HRC 45-58) обеспечивает превосходную твердость и износостойкость, что продлевает срок службы и снижает затраты на замену.",
  "Consistent Performance": "Стабильная производительность",
  "Uniform hardness distribution and precision geometry ensure stable processing quality even under high-intensity production use": "Равномерное распределение твердости и прецизионная геометрия обеспечивают стабильное качество обработки даже при высокой интенсивности производственного использования.",
  "Versatile Die Options": "Универсальные варианты штампов",
  "Complete range of die types including V-dies, gooseneck, hemming, and custom profiles for diverse bending applications": "Полный спектр типов штампов, включая V-образные, гибкие, кромкогибочные и специальные профили для различных операций гибки.",
  "Reduced Downtime": "Сокращение времени простоя",
  "Durable construction and wear resistance minimize regrind cycles and tool changes, maximizing production uptime": "Прочная конструкция и износостойкость сводят к минимуму циклы переточки и смены инструмента, максимально увеличивая время безотказной работы производства.",
  "Tooling Types & Features": "Типы и особенности инструментов",
  "Comprehensive range of precision-engineered press brake dies and punches for diverse bending applications": "Обширный ассортимент прецизионных штампов и пуансонов для листогибочных прессов для различных операций гибки.",
  "V-Dies (Bottom Dies)": "V-образные матрицы (нижние матрицы)",
  "The most common type of press brake tooling, V-dies feature varying die opening widths to accommodate different material thicknesses and bend angles. Available in single, double, and multi-groove configurations. Precision ground surfaces ensure accurate bend angles and consistent repeatability. Standard lengths: 500mm, 515mm, 835mm.": "V-образные штампы, наиболее распространенный тип гибочного инструмента, имеют различную ширину отверстия для работы с материалами разной толщины и углами изгиба. ",
  "Punches (Upper Tools)": "Пуансоны (верхние инструменты)",
  "Precision-machined upper tooling with various nose radii and angles for different bending applications. Standard punch angles include 88°, 90°, and custom profiles. Heat-treated to HRC 45-58 for superior wear resistance. Compatible with quick-change segmented tooling systems for fast setup and changeover.": "Прецизионно обработанная верхняя оснастка с различными радиусами при вершине и углами для различных операций гибки. ",
  "Gooseneck Dies (Return-Flanging)": "Пластины на гибкой стойке (обратная отбортовка)",
  "Specialized tooling designed for forming return flanges and working with pre-bent parts. The unique profile provides clearance for existing flanges, preventing interference during secondary bending operations. Essential for complex sheet metal fabrication requiring multiple bends and tight geometries.": "Специализированная оснастка, предназначенная для формирования возвратных фланцев и работы с предварительно изогнутыми деталями. ",
  "Arc Bending Mold (Radius Dies)": "Форма для дуговой гибки (радиусные штампы)",
  "Specialized curved tooling designed to form smooth radius bends and arcs with consistent curvature. Features precision-machined radius profiles (R5, R10, R15, R20, etc.) for creating rounded corners, cylindrical sections, and decorative curves. Essential for HVAC ductwork, pipe fittings, architectural metalwork, and decorative applications. Eliminates the need for post-bending forming operations while ensuring uniform radius along the entire bend length.": "Специализированные изогнутые инструменты, предназначенные для формирования плавных радиусных изгибов и дуг постоянной кривизны. ",
  "Custom Profile Dies": "Штампы индивидуального профиля",
  "Engineered custom tooling for specialized bending applications including U-channels, Z-profiles, radius bends, offset bends, and complex geometries. Manufactured to customer specifications with tight tolerances. Ideal for high-volume production requiring consistent, repeatable custom profiles.": "Разработанный по индивидуальному заказу инструмент для специализированных операций гибки, включая U-образные каналы, Z-профили, радиусные изгибы, смещенные изгибы и сложные геометрические формы. ",
  "Lower Die (V-Die / Bottom Die)": "Нижняя матрица (V-Die / Нижняя матрица)",
  "The foundation component of press brake tooling featuring precision-machined V-grooves in various opening widths (6V, 8V, 12V, 16V, etc.). Constructed from hardened chromium molybdenum steel with ground surfaces for superior accuracy. Available in single-groove and multi-groove configurations to accommodate different material thicknesses. The V-opening determines the minimum bend radius and is critical for achieving accurate bend angles. Features secure mounting channels for stable clamping to the press brake bed, ensuring consistent positioning and repeat accuracy across production runs.": "Основополагающий компонент гибочного пресса с прецизионно обработанными V-образными канавками различной ширины раскрытия (6V, 8V, 12V, 16V и т. д.). ",
  "Press Brake Tooling in Action": "Инструмент для листогибочного пресса в действии",
  "See how our precision tooling delivers consistent, high-quality bends in production environments": "Посмотрите, как наши прецизионные инструменты обеспечивают стабильные и высококачественные изгибы в производственных условиях.",
  "Applications": "Приложения",
  "Our press brake tooling systems are essential for precision sheet metal bending across diverse industries": "Наши системы гибочного пресса необходимы для прецизионной гибки листового металла в различных отраслях промышленности.",
  "Aerospace Manufacturing": "Аэрокосмическое производство",
  "Creating lightweight, high-strength structural components, brackets, and panels for aircraft with tight tolerances": "Создание легких, высокопрочных конструктивных элементов, кронштейнов и панелей для самолетов с жесткими допусками.",
  "Automotive Industry": "Автомобильная промышленность",
  "Bending chassis components, body panels, brackets, and structural parts for cars, trucks, and commercial vehicles": "Гибка компонентов шасси, панелей кузова, кронштейнов и деталей конструкций легковых, грузовых и коммерческих автомобилей.",
  "Shipbuilding": "Судостроение",
  "Forming hull sections, deck plates, bulkheads, and structural steel elements for marine vessels": "Формирование корпусных секций, палубных плит, переборок и элементов стальных конструкций морских судов.",
  "Electronics Enclosures": "Корпуса для электроники",
  "Precision bending of server racks, control cabinets, electrical panels, and equipment housings": "Прецизионная гибка серверных стоек, шкафов управления, электрических панелей и корпусов оборудования.",
  "HVAC & Ventilation": "ОВиК и Вентиляция",
  "Forming ductwork, air handling units, and ventilation components for commercial and industrial applications": "Формирование воздуховодов, вентиляционных установок и компонентов вентиляции для коммерческого и промышленного применения.",
  "Appliance Manufacturing": "Производство бытовой техники",
  "Bending panels and components for refrigerators, ovens, washers, and other household appliances": "Гибка панелей и комплектующих для холодильников, духовок, стиральных машин и другой бытовой техники",
  "Furniture & Fixtures": "Мебель и фурнитура",
  "Creating metal furniture frames, shelving systems, and architectural metalwork with decorative bends": "Изготовление металлических каркасов мебели, стеллажных систем и архитектурных металлоконструкций с декоративными изгибами.",
  "Construction Equipment": "Строительное оборудование",
  "Manufacturing structural components, brackets, and protective covers for heavy machinery and equipment": "Производство конструктивных элементов, кронштейнов и защитных чехлов для тяжелых машин и оборудования.",
  "Standard & Optional Tooling": "Стандартный и дополнительный инструмент",
  "Complete tooling solutions with standard configurations and optional upgrades for specialized applications": "Комплексные инструментальные решения со стандартными конфигурациями и дополнительными обновлениями для специализированных применений.",
  "Standard Tooling Set": "Стандартный набор инструментов",
  "Optional Upgrades": "Дополнительные обновления",
  "Need custom tooling for your application?": "Нужен специальный инструмент для вашего приложения?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about press brake tooling and bending molds": "Распространенные вопросы об инструментах для гибочных прессов и гибочных формах",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength, wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production volume, material being bent, and required tool life.": "Хромомолибденовая сталь (42CrMo, Cr12MoV) является отраслевым стандартом, обеспечивающим исключительную прочность, износостойкость и защиту от коррозии. ",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example, 2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider die openings.": "Общее правило заключается в использовании V-образного отверстия, размер которого в 8 раз превышает толщину материала (правило 8T). ",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness extends tool life but requires careful handling to avoid chipping.": "Стандартный листогибочный пресс обычно имеет твердость 45–52 HRC, что обеспечивает превосходную износостойкость, сохраняя при этом прочность и предотвращая растрескивание. ",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings, material specifications, and bend requirements. Our engineering team will design custom dies for U-channels, Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results for high-volume production runs.": "Да, мы специализируемся на изготовлении специального инструмента для уникальных задач гибки. ",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection maximize longevity. Worn tooling can be reground to restore performance.": "Срок службы инструмента зависит от сгибаемого материала, частоты изгиба, применяемого тоннажа и технического обслуживания. ",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "В европейской оснастке (системы Wila, Amada, Trumpf) используется сегментированный быстросменный инструмент со стандартизированными системами зажима для быстрой установки. ",
  "Have a specific tooling question?": "У вас есть конкретный вопрос по инструментам?",
  "Download Tooling Catalog": "Скачать каталог инструментов",
  "Get comprehensive technical specifications, dimensional drawings, material grades, and tooling selection guides for our complete range of press brake dies and punches.": "Получите подробные технические характеристики, габаритные чертежи, марки материалов и руководства по выбору инструментов для всей нашей линейки штампов и пуансонов для листогибочных прессов."
}