{
  "CNC Bending Machine Mold": "CNC-Biegemaschinenform",
  "Professional press brake tooling and bending molds engineered from premium chromium molybdenum steel. Precision-machined dies and punches deliver consistent, high-quality bends with exceptional durability and extended tool life for demanding sheet metal fabrication applications.": "Professionelle Abkantwerkzeuge und Biegeformen aus hochwertigem Chrom-Molybdän-Stahl. ",
  "Request Quote": "Angebot anfordern",
  "Learn More": "Erfahren Sie mehr",
  "Technical Specifications": "Technische Spezifikationen",
  "High-performance press brake tooling engineered for precision sheet metal bending operations": "Hochleistungs-Abkantwerkzeuge für präzise Blechbiegevorgänge",
  "Material & Hardness": "Material und Härte",
  "Material: Chromium Molybdenum Steel (42CrMo, Cr12MoV)": "Material: Chrom-Molybdän-Stahl (42CrMo, Cr12MoV)",
  "Hardness: HRC 45-58 (heat-treated)": "Härte: HRC 45-58 (wärmebehandelt)",
  "Alternative: T8, T10, H13, HSS grades": "Alternativ: T8, T10, H13, HSS-Sorten",
  "Surface Finish: Precision ground and polished": "Oberflächenbeschaffenheit: Präzisionsgeschliffen und poliert",
  "Dimensions & Tolerance": "Abmessungen und Toleranzen",
  "Standard Length: 500mm, 515mm, 835mm": "Standardlänge: 500 mm, 515 mm, 835 mm",
  "Custom Lengths: Available upon request": "Benutzerdefinierte Längen: Auf Anfrage erhältlich",
  "Thickness Tolerance: ±0.001mm": "Dickentoleranz: ±0,001 mm",
  "Flatness: ±0.001mm (micron-level precision)": "Ebenheit: ±0,001 mm (Präzision im Mikrometerbereich)",
  "Die Types Available": "Verfügbare Matrizentypen",
  "V-Dies: Single, double, multi-groove": "V-Matrizen: Einzel-, Doppel-, Mehrfachnut",
  "Gooseneck Dies: Return-flanging applications": "Schwanenhals-Matrizen: Rückflanschanwendungen",
  "Hemming Dies: Two-stage flattening": "Falzwerkzeuge: Zweistufiges Abflachen",
  "Custom Profiles: U-shape, polygonal, semi-circular": "Kundenspezifische Profile: U-Form, vieleckig, halbrund",
  "Why Choose Our Press Brake Tooling?": "Warum sollten Sie sich für unsere Abkantwerkzeuge entscheiden?",
  "Superior quality tooling engineered for precision, durability, and consistent performance in demanding sheet metal fabrication environments": "Hochwertige Werkzeuge, die für Präzision, Haltbarkeit und konstante Leistung in anspruchsvollen Blechbearbeitungsumgebungen entwickelt wurden",
  "Micron-Level Precision": "Präzision im Mikrometerbereich",
  "Precision ground surfaces with thickness tolerance within ±0.001mm and flatness ±0.001mm ensure consistent, high-quality bends every time": "Präzise geschliffene Oberflächen mit einer Dickentoleranz von ±0,001 mm und einer Ebenheit von ±0,001 mm sorgen stets für gleichbleibende, hochwertige Biegungen",
  "Superior Material Quality": "Überlegene Materialqualität",
  "Manufactured from premium chromium molybdenum steel with exceptional strength, corrosion resistance, and wear properties": "Hergestellt aus hochwertigem Chrom-Molybdän-Stahl mit außergewöhnlicher Festigkeit, Korrosionsbeständigkeit und Verschleißeigenschaften",
  "Extended Tool Life": "Längere Werkzeuglebensdauer",
  "Advanced heat treatment (HRC 45-58) provides superior hardness and wear resistance for longer service life and reduced replacement costs": "Die fortschrittliche Wärmebehandlung (HRC 45–58) sorgt für überlegene Härte und Verschleißfestigkeit für eine längere Lebensdauer und geringere Austauschkosten",
  "Consistent Performance": "Konsistente Leistung",
  "Uniform hardness distribution and precision geometry ensure stable processing quality even under high-intensity production use": "Eine gleichmäßige Härteverteilung und eine präzise Geometrie gewährleisten eine stabile Verarbeitungsqualität auch bei hochintensivem Produktionseinsatz",
  "Versatile Die Options": "Vielseitige Matrizenoptionen",
  "Complete range of die types including V-dies, gooseneck, hemming, and custom profiles for diverse bending applications": "Komplettes Sortiment an Matrizentypen, einschließlich V-Matrizen, Schwanenhals-, Falz- und kundenspezifischen Profilen für verschiedene Biegeanwendungen",
  "Reduced Downtime": "Reduzierte Ausfallzeiten",
  "Durable construction and wear resistance minimize regrind cycles and tool changes, maximizing production uptime": "Robuste Konstruktion und Verschleißfestigkeit minimieren Nachschleifzyklen und Werkzeugwechsel und maximieren so die Produktionsverfügbarkeit",
  "Tooling Types & Features": "Werkzeugtypen und -funktionen",
  "Comprehensive range of precision-engineered press brake dies and punches for diverse bending applications": "Umfassendes Sortiment an präzisionsgefertigten Abkantbacken und -stempeln für verschiedene Biegeanwendungen",
  "V-Dies (Bottom Dies)": "V-Matrizen (Untermatrizen)",
  "The most common type of press brake tooling, V-dies feature varying die opening widths to accommodate different material thicknesses and bend angles. Available in single, double, and multi-groove configurations. Precision ground surfaces ensure accurate bend angles and consistent repeatability. Standard lengths: 500mm, 515mm, 835mm.": "V-Matrizen sind die gebräuchlichste Art von Abkantwerkzeugen und verfügen über unterschiedliche Matrizenöffnungsweiten, um unterschiedlichen Materialstärken und Biegewinkeln gerecht zu werden. ",
  "Punches (Upper Tools)": "Stempel (Oberwerkzeuge)",
  "Precision-machined upper tooling with various nose radii and angles for different bending applications. Standard punch angles include 88°, 90°, and custom profiles. Heat-treated to HRC 45-58 for superior wear resistance. Compatible with quick-change segmented tooling systems for fast setup and changeover.": "Präzisionsgefertigtes Oberwerkzeug mit verschiedenen Nasenradien und -winkeln für verschiedene Biegeanwendungen. ",
  "Gooseneck Dies (Return-Flanging)": "Schwanenhalsmatrizen (Rückflanschung)",
  "Specialized tooling designed for forming return flanges and working with pre-bent parts. The unique profile provides clearance for existing flanges, preventing interference during secondary bending operations. Essential for complex sheet metal fabrication requiring multiple bends and tight geometries.": "Spezialwerkzeuge für die Formung von Rücklaufflanschen und die Bearbeitung vorgebogener Teile. ",
  "Arc Bending Mold (Radius Dies)": "Bogenbiegeform (Radius-Matrizen)",
  "Specialized curved tooling designed to form smooth radius bends and arcs with consistent curvature. Features precision-machined radius profiles (R5, R10, R15, R20, etc.) for creating rounded corners, cylindrical sections, and decorative curves. Essential for HVAC ductwork, pipe fittings, architectural metalwork, and decorative applications. Eliminates the need for post-bending forming operations while ensuring uniform radius along the entire bend length.": "Spezialisierte gebogene Werkzeuge zum Formen von Biegungen und Bögen mit glattem Radius und gleichmäßiger Krümmung. ",
  "Custom Profile Dies": "Stanzformen mit individuellem Profil",
  "Engineered custom tooling for specialized bending applications including U-channels, Z-profiles, radius bends, offset bends, and complex geometries. Manufactured to customer specifications with tight tolerances. Ideal for high-volume production requiring consistent, repeatable custom profiles.": "Entwickelte kundenspezifische Werkzeuge für spezielle Biegeanwendungen, einschließlich U-Kanäle, Z-Profile, Radiusbiegungen, versetzte Biegungen und komplexe Geometrien. ",
  "Lower Die (V-Die / Bottom Die)": "Unteres Gesenk (V-Gesenk / Unteres Gesenk)",
  "The foundation component of press brake tooling featuring precision-machined V-grooves in various opening widths (6V, 8V, 12V, 16V, etc.). Constructed from hardened chromium molybdenum steel with ground surfaces for superior accuracy. Available in single-groove and multi-groove configurations to accommodate different material thicknesses. The V-opening determines the minimum bend radius and is critical for achieving accurate bend angles. Features secure mounting channels for stable clamping to the press brake bed, ensuring consistent positioning and repeat accuracy across production runs.": "Die Grundkomponente von Abkantwerkzeugen mit präzisionsgefertigten V-Nuten in verschiedenen Öffnungsweiten (6 V, 8 V, 12 V, 16 V usw.). ",
  "Press Brake Tooling in Action": "Abkantwerkzeuge in Aktion",
  "See how our precision tooling delivers consistent, high-quality bends in production environments": "Erfahren Sie, wie unsere Präzisionswerkzeuge in Produktionsumgebungen konsistente, hochwertige Biegungen liefern",
  "Applications": "Anwendungen",
  "Our press brake tooling systems are essential for precision sheet metal bending across diverse industries": "Unsere Abkantpressen-Werkzeugsysteme sind für das präzise Biegen von Blechen in verschiedenen Branchen unerlässlich",
  "Aerospace Manufacturing": "Luft- und Raumfahrtfertigung",
  "Creating lightweight, high-strength structural components, brackets, and panels for aircraft with tight tolerances": "Herstellung leichter, hochfester Strukturbauteile, Halterungen und Paneele für Flugzeuge mit engen Toleranzen",
  "Automotive Industry": "Automobilindustrie",
  "Bending chassis components, body panels, brackets, and structural parts for cars, trucks, and commercial vehicles": "Biegen von Fahrwerkskomponenten, Karosserieteilen, Halterungen und Strukturteilen für Pkw, Lkw und Nutzfahrzeuge",
  "Shipbuilding": "Schiffbau",
  "Forming hull sections, deck plates, bulkheads, and structural steel elements for marine vessels": "Formen von Rumpfabschnitten, Deckplatten, Schotten und Baustahlelementen für Seeschiffe",
  "Electronics Enclosures": "Elektronikgehäuse",
  "Precision bending of server racks, control cabinets, electrical panels, and equipment housings": "Präzisionsbiegen von Serverracks, Schaltschränken, Schalttafeln und Gerätegehäusen",
  "HVAC & Ventilation": "HLK und Lüftung",
  "Forming ductwork, air handling units, and ventilation components for commercial and industrial applications": "Formen von Rohrleitungen, Lüftungsgeräten und Lüftungskomponenten für gewerbliche und industrielle Anwendungen",
  "Appliance Manufacturing": "Geräteherstellung",
  "Bending panels and components for refrigerators, ovens, washers, and other household appliances": "Biegen von Platten und Komponenten für Kühlschränke, Öfen, Waschmaschinen und andere Haushaltsgeräte",
  "Furniture & Fixtures": "Möbel und Einrichtungsgegenstände",
  "Creating metal furniture frames, shelving systems, and architectural metalwork with decorative bends": "Herstellung von Metallmöbelrahmen, Regalsystemen und architektonischen Metallarbeiten mit dekorativen Biegungen",
  "Construction Equipment": "Baumaschinen",
  "Manufacturing structural components, brackets, and protective covers for heavy machinery and equipment": "Herstellung von Strukturbauteilen, Halterungen und Schutzabdeckungen für schwere Maschinen und Geräte",
  "Standard & Optional Tooling": "Standard- und optionale Werkzeuge",
  "Complete tooling solutions with standard configurations and optional upgrades for specialized applications": "Komplette Werkzeuglösungen mit Standardkonfigurationen und optionalen Upgrades für spezielle Anwendungen",
  "Standard Tooling Set": "Standardwerkzeugsatz",
  "Optional Upgrades": "Optionale Upgrades",
  "Need custom tooling for your application?": "Benötigen Sie maßgeschneiderte Werkzeuge für Ihre Anwendung?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about press brake tooling and bending molds": "Häufige Fragen zu Abkantwerkzeugen und Biegeformen",
  "Chromium molybdenum steel (42CrMo, Cr12MoV) is the industry standard, offering exceptional strength, wear resistance, and corrosion protection. For heavy-duty applications or extended tool life, premium HSS (high-speed steel) or carbide materials can be specified. The material choice depends on production volume, material being bent, and required tool life.": "Chrom-Molybdän-Stahl (42CrMo, Cr12MoV) ist der Industriestandard und bietet außergewöhnliche Festigkeit, Verschleißfestigkeit und Korrosionsschutz. ",
  "The general rule is to use a V-die opening that is 8 times the material thickness (8T rule). For example, 2mm thick material requires a 16mm die opening. This ratio ensures proper bend formation, prevents cracking, and maintains consistent bend angles. Thicker materials or harder metals may require wider die openings.": "Die allgemeine Regel besteht darin, eine V-Matrizenöffnung zu verwenden, die das 8-fache der Materialstärke beträgt (8T-Regel). ",
  "Standard press brake tooling typically has a hardness of HRC 45-52, which provides excellent wear resistance while maintaining toughness to prevent cracking. For demanding applications or hard materials (stainless steel, high-tensile steel), tooling with HRC 54-58 hardness is recommended. Higher hardness extends tool life but requires careful handling to avoid chipping.": "Standardwerkzeuge für Abkantpressen haben typischerweise eine Härte von HRC 45–52, was eine hervorragende Verschleißfestigkeit bei gleichzeitiger Beibehaltung der Zähigkeit zur Vermeidung von Rissen bietet. ",
  "Yes, we specialize in custom tooling for unique bending applications. Provide us with your part drawings, material specifications, and bend requirements. Our engineering team will design custom dies for U-channels, Z-profiles, radius bends, offset bends, or any special geometry. Custom tooling ensures consistent results for high-volume production runs.": "Ja, wir sind auf kundenspezifische Werkzeuge für einzigartige Biegeanwendungen spezialisiert. ",
  "Tool life depends on material being bent, bending frequency, tonnage applied, and maintenance. Quality heat-treated tooling can last 100,000+ bends for mild steel. Stainless steel or high-tensile materials reduce tool life. Proper maintenance (cleaning, storage, periodic inspection) and correct die selection maximize longevity. Worn tooling can be reground to restore performance.": "Die Werkzeuglebensdauer hängt vom zu biegenden Material, der Biegefrequenz, der angewandten Tonnage und der Wartung ab. ",
  "European tooling (Wila, Amada, Trumpf systems) uses segmented quick-change tooling with standardized clamping systems for rapid setup. American-style tooling typically uses full-length dies with mechanical or hydraulic clamping. European systems offer greater flexibility and faster changeover, while American systems provide robust, economical solutions. We manufacture tooling compatible with both standards.": "Europäische Werkzeuge (Wila-, Amada-, Trumpf-Systeme) verwenden segmentierte Schnellwechselwerkzeuge mit standardisierten Spannsystemen für eine schnelle Einrichtung. ",
  "Have a specific tooling question?": "Haben Sie eine spezielle Frage zu Werkzeugen?",
  "Download Tooling Catalog": "Laden Sie den Werkzeugkatalog herunter",
  "Get comprehensive technical specifications, dimensional drawings, material grades, and tooling selection guides for our complete range of press brake dies and punches.": "Erhalten Sie umfassende technische Spezifikationen, Maßzeichnungen, Materialqualitäten und Werkzeugauswahlhilfen für unser komplettes Sortiment an Abkantbacken und -stempeln."
}