{
  "CNC Bending Machine Arc Mold": "CNCベンディングマシンアークモールド",
  "Advanced radius bending tooling engineered for precision arc formation on CNC press brakes. Produces consistently smooth curved bends without bend lines, kinking, or material marking. Available in steel and urethane configurations for diverse radius applications from R5 to R200mm.": "CNC プレス ブレーキで正確な円弧を形成するように設計された高度なラジアス曲げツール。",
  "Request Quote": "見積依頼",
  "Learn More": "もっと詳しく知る",
  "Technical Specifications": "技術仕様",
  "Professional radius bending tooling for smooth arc formation on CNC press brake machines": "CNC プレス ブレーキ機でスムーズな円弧を形成するためのプロ仕様のラジアス曲げツール",
  "Arc Radius Capacity": "アーク半径容量",
  "Standard Radius: R5, R8, R10, R15, R20, R25": "標準半径：R5、R8、R10、R15、R20、R25",
  "Large Radius: R30, R40, R50, R60, R80, R100": "大半径: R30、R40、R50、R60、R80、R100",
  "Extra Large: R120, R150, R200mm": "特大：R120、R150、R200mm",
  "Custom Radius: Available on request": "カスタム半径: ご要望に応じて利用可能",
  "Material Options": "材質のオプション",
  "Steel Dies: Heat-treated 42CrMo (HRC 45-52)": "スチールダイス: 熱処理済み 42CrMo (HRC 45-52)",
  "Urethane Dies: High-strength polyurethane": "ウレタン型：高強度ポリウレタン",
  "Hybrid: Steel core with urethane surface": "ハイブリッド: スチールコアとウレタン表面",
  "Precision ground and polished finish": "精密な研削と研磨仕上げ",
  "Die Configurations": "ダイ構成",
  "Single Radius Punches (fixed radius)": "シングルラジアスパンチ（半径固定）",
  "Adjustable Radius Systems (multi-radius)": "調整可能な半径システム (マルチ半径)",
  "Bump Forming Tooling (segmented arcs)": "バンプ成形ツール (セグメント化された円弧)",
  "Standard Lengths: 500mm, 835mm, custom": "標準長さ: 500mm、835mm、カスタム",
  "Why Choose Our Arc Mold Radius Tooling?": "当社のアーク モールド ラジアス ツーリングを選ぶ理由",
  "Superior radius bending solutions engineered for smooth arc formation, mar-free finishing, and consistent repeatability in demanding production environments": "要求の厳しい生産環境において、滑らかな円弧の形成、傷のない仕上げ、一貫した再現性を実現するように設計された優れた半径曲げソリューション",
  "Smooth Radius Formation": "スムーズな半径形成",
  "Produces consistently smooth curved bends without visible bend lines, kinking, or segmentation marks for superior aesthetic quality": "目に見える曲げ線、よじれ、分割マークがなく、一貫して滑らかな曲線曲げを実現し、優れた美的品質を実現します。",
  "Mar-Free Bending": "マーフリーベンディング",
  "Urethane die surfaces achieve entirely clean, mark-free bends allowing use of pre-finished or pre-painted sheet metal materials": "ウレタン金型の表面は完全にきれいで跡のない曲げを実現し、仕上げ済みまたは塗装済みの板金材料の使用を可能にします。",
  "Versatile Radius Range": "多彩な半径範囲",
  "Wide range from small R5mm radii to large R200mm arcs, with adjustable systems offering multiple radii using the same bottom die": "小さな半径 R5mm から大きな R200mm 円弧までの幅広い範囲に対応し、同じ底部ダイを使用して複数の半径を提供する調整可能なシステムを備えています",
  "Reduced Springback": "スプリングバックの低減",
  "Properly matched punch radius (63% of material thickness) minimizes springback and ensures consistent bend angles across production runs": "適切に一致したパンチ半径 (材料の厚さの 63%) によりスプリングバックが最小限に抑えられ、生産工程全体で一貫した曲げ角度が確保されます。",
  "Extended Tool Life": "工具寿命の延長",
  "Greater die radius reduces friction during bending, minimizing wear and extending tool life for cost-effective production": "ダイの半径が大きいため、曲げ時の摩擦が軽減され、摩耗が最小限に抑えられ、工具寿命が延長されるため、コスト効率の高い生産が可能になります。",
  "Cost-Effective Solution": "費用対効果の高いソリューション",
  "Eliminates secondary finishing operations and reduces material waste from failed bends, lowering overall production costs": "二次仕上げ作業が不要になり、曲げの失敗による材料の無駄が削減され、全体の生産コストが削減されます。",
  "Radius Tooling Types & Methods": "ラジアスツーリングの種類と方法",
  "Comprehensive range of arc mold tooling solutions for diverse radius bending applications and material requirements": "多様な半径曲げ用途と材料要件に対応する包括的なアークモールドツーリングソリューション",
  "Steel Radius Punches": "スチールラジアスパンチ",
  "Precision-machined steel punches with fixed radius profiles from R5 to R100mm. Manufactured from heat-treated 42CrMo steel with HRC 45-52 hardness for durability. Tip radius designed at minimum 63% of material thickness to prevent stress concentration. Ideal for standard production radius bending with consistent repeatability.": "R5 ～ R100mm の固定半径プロファイルを備えた、精密機械加工されたスチール製パンチです。",
  "Urethane Radius Dies": "ウレタンラジアスダイス",
  "High-strength polyurethane bottom dies providing mar-free bending for pre-finished and pre-painted materials. Forgiving urethane material achieves clean bends without surface marking or scratching. Compatible with standard V-die holders. Ideal for architectural panels, appliances, and decorative metalwork requiring pristine surface finish.": "高強度ポリウレタン底ダイにより、仕上げ済みおよび塗装済みの材料に傷のない曲げを提供します。",
  "Large Radius Tooling Systems": "大半径ツーリングシステム",
  "Custom-engineered systems for forming large radius arcs (R80-R200mm) that exceed standard press brake table limits. Features modular segmented design for flexible radius adjustment. Compatible with CNC press brakes for automated radius control. Suitable for architectural metalwork, transportation equipment, and large curved panels.": "標準のプレス ブレーキ テーブルの制限を超える大きな半径の円弧 (R80 ～ R200mm) を形成するためのカスタム設計のシステム。",
  "Bump Forming Tooling": "バンプ形成ツール",
  "Specialized tooling for creating large radius arcs using multi-step bump forming technique. Approximates smooth arc with series of small incremental bends. Uses standard V-dies and punches with CNC programming for consistent results. Cost-effective solution for large radius applications without dedicated radius tooling investment.": "マルチステップバンプ形成技術を使用して大きな半径の円弧を作成するための専用ツール。",
  "Adjustable Radius Systems": "調整可能な半径システム",
  "Versatile tooling allowing multiple radius options using same bottom die by changing interchangeable radius punches. Reduces tooling inventory requirements while maintaining flexibility. Quick-change mounting for rapid setup between different radius specifications. Ideal for job shops handling diverse radius bending requirements.": "交換可能なラジアスパンチを交換することで、同じ下型を使用して複数のラジアスオプションを可能にする多用途ツール。",
  "Hybrid Steel-Urethane Dies": "ハイブリッドスチール-ウレタンダイス",
  "Advanced tooling combining steel core structural strength with urethane surface layer for mar-free bending. Provides durability of steel with surface protection of urethane. Suitable for high-volume production requiring both strength and surface quality. Extended tool life compared to pure urethane with maintained mar-free performance.": "スチールコアの構造強度とウレタン表面層を組み合わせた高度なツールで、損傷のない曲げを実現します。",
  "Radius Bending in Action": "動作中の半径曲げ",
  "Watch how our arc mold tooling produces smooth, consistent radius bends for professional results": "当社のアークモールドツールが滑らかで一貫した半径の曲げを生成し、プロフェッショナルな結果を生み出す様子をご覧ください。",
  "Applications": "アプリケーション",
  "Arc mold radius tooling is essential for creating smooth curved bends across diverse industries and applications": "アークモールドラジアスツーリングは、さまざまな業界や用途にわたって滑らかな曲線の曲げを作成するために不可欠です",
  "Architectural Metalwork": "建築金工",
  "Creating curved fascias, decorative panels, rounded building elements, and architectural features with smooth radius bends": "曲線状の鼻隠し、装飾パネル、丸みを帯びた建築要素、滑らかな半径の曲げによる建築フィーチャーの作成",
  "Automotive Body Panels": "自動車ボディパネル",
  "Forming fenders, hoods, door panels, and other curved automotive components requiring smooth radius without surface marking": "表面マーキングのない滑らかな半径を必要とするフェンダー、ボンネット、ドアパネル、その他の湾曲した自動車部品の成形",
  "HVAC Ductwork": "HVAC ダクト工事",
  "Bending curved duct sections, radius elbows, and custom ventilation components for commercial HVAC systems": "商用 HVAC システム用の曲げ湾曲ダクト セクション、ラジアス エルボ、およびカスタム換気コンポーネント",
  "Furniture & Fixtures": "家具と備品",
  "Manufacturing curved metal furniture frames, shelving with radius bends, and decorative metal fixtures": "曲面金属家具フレーム、アール曲げ棚、装飾金具の製造",
  "Appliance Manufacturing": "家電製品の製造",
  "Creating curved panels for refrigerators, washing machines, and appliances requiring smooth radius edges": "滑らかなアールエッジを必要とする冷蔵庫、洗濯機、家電製品用の曲面パネルの作成",
  "Transportation Equipment": "輸送機器",
  "Forming curved components for buses, trains, trailers, and specialty vehicles requiring large radius bends": "大きな曲げ半径が必要なバス、電車、トレーラー、特殊車両用の曲面コンポーネントの成形",
  "Signage & Displays": "看板とディスプレイ",
  "Creating curved letters, rounded sign faces, and display stands with smooth arc formation": "曲線状の文字、丸みを帯びたサイン面、滑らかな円弧を描く表示台を実現",
  "Industrial Enclosures": "産業用エンクロージャ",
  "Bending rounded corners for control cabinets, electrical enclosures, and protective covers": "制御盤、電気筐体、保護カバーの丸い角の曲げ加工",
  "Standard & Optional Tooling": "標準およびオプションのツール",
  "Complete arc mold solutions with standard radius configurations and optional custom tooling for specialized applications": "標準半径構成と特殊用途向けのオプションのカスタム ツールを備えた完全なアーク モールド ソリューション",
  "Standard Radius Tooling": "標準ラジアスツーリング",
  "Optional Upgrades": "オプションのアップグレード",
  "Need custom radius tooling for your application?": "アプリケーションにカスタム半径ツールが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about arc mold and radius bending tooling": "円弧金型および半径曲げツールに関するよくある質問",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump forming is cost-effective for occasional large radius work, while dedicated radius tooling provides superior surface finish and faster production for regular radius bending applications.": "バンプ成形では、CNC プログラミングによる標準の V ダイとパンチを使用して、複数の小さな段階的な曲げ (直線セグメントで円弧を近似) を通じて大きな半径の円弧を作成します。",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative metalwork, and any application where surface quality is critical. Steel dies are preferred for higher production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane combines both benefits.": "表面マーキングが許容できない、仕上げ済み、塗装済み、または研磨済みの材料を曲げる場合は、ウレタン ダイスを使用します。",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch tip radius to the natural internal radius created by the die opening for consistent angles. Consider material springback (stainless steel requires 1-2° compensation). Consult our technical team with your material specifications for optimal radius selection.": "応力集中を防ぐために、パンチ半径は材料の厚さの少なくとも 63% である必要があります。",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius dimensions, material specifications, production volume, and part drawings. Our engineering team will design custom arc molds optimized for your specific application. Custom tooling is particularly cost-effective for high-volume production runs requiring consistent radius specifications not available in standard tooling catalogs.": "はい、当社は独自の用途向けのカスタム半径ツールを専門としています。",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending. Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "達成可能な最大半径は、プレス ブレーキ テーブルの幅とツーリング システムによって異なります。",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback: use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening to reduce stress, and consider coining for zero springback applications. Material-specific springback tables help predict and compensate for springback in production.": "スプリングバックは材料の硬度とともに増加し、曲げ半径が大きくなるほど減少します。",
  "Have a radius tooling question?": "RADIUS ツールについて質問がありますか?",
  "Download Arc Mold Catalog": "アークモールドカタログをダウンロード",
  "Get comprehensive technical specifications, radius charts, material options, and application guides for our complete range of arc mold and radius bending tooling.": "当社の全範囲の円弧モールドおよび半径曲げツールの包括的な技術仕様、半径チャート、材料オプション、アプリケーション ガイドを入手してください。"
}