{
  "CNC Bending Machine Arc Mold": "Дуговая пресс-форма для гибочной машины с ЧПУ",
  "Advanced radius bending tooling engineered for precision arc formation on CNC press brakes. Produces consistently smooth curved bends without bend lines, kinking, or material marking. Available in steel and urethane configurations for diverse radius applications from R5 to R200mm.": "Усовершенствованный инструмент для гибки радиусов, разработанный для точного формирования дуги на листогибочных прессах с ЧПУ. ",
  "Request Quote": "Запросить цену",
  "Learn More": "Узнать больше",
  "Technical Specifications": "Технические характеристики",
  "Professional radius bending tooling for smooth arc formation on CNC press brake machines": "Профессиональный инструмент для гибки радиусов для плавного формирования дуги на листогибочных станках с ЧПУ.",
  "Arc Radius Capacity": "Радиус дуги",
  "Standard Radius: R5, R8, R10, R15, R20, R25": "Стандартный радиус: R5, R8, R10, R15, R20, R25.",
  "Large Radius: R30, R40, R50, R60, R80, R100": "Большой радиус: R30, R40, R50, R60, R80, R100.",
  "Extra Large: R120, R150, R200mm": "Очень большой: R120, R150, R200 мм",
  "Custom Radius: Available on request": "Пользовательский радиус: доступен по запросу.",
  "Material Options": "Варианты материалов",
  "Steel Dies: Heat-treated 42CrMo (HRC 45-52)": "Стальные матрицы: термообработанный 42CrMo (HRC 45-52).",
  "Urethane Dies: High-strength polyurethane": "Уретановые матрицы: высокопрочный полиуретан.",
  "Hybrid: Steel core with urethane surface": "Гибрид: стальной сердечник с уретановой поверхностью.",
  "Precision ground and polished finish": "Прецизионная шлифовка и полировка",
  "Die Configurations": "Конфигурации штампов",
  "Single Radius Punches (fixed radius)": "Пуансоны одинарного радиуса (фиксированный радиус)",
  "Adjustable Radius Systems (multi-radius)": "Системы регулируемого радиуса (многорадиусные)",
  "Bump Forming Tooling (segmented arcs)": "Инструменты для формирования выпуклостей (сегментированные дуги)",
  "Standard Lengths: 500mm, 835mm, custom": "Стандартная длина: 500 мм, 835 мм, по индивидуальному заказу.",
  "Why Choose Our Arc Mold Radius Tooling?": "Почему стоит выбрать нашу оснастку для изготовления дуговых форм?",
  "Superior radius bending solutions engineered for smooth arc formation, mar-free finishing, and consistent repeatability in demanding production environments": "Превосходные решения для гибки по радиусу, разработанные для плавного формирования дуги, отделки без дефектов и стабильной повторяемости в сложных производственных условиях.",
  "Smooth Radius Formation": "Плавное формирование радиуса",
  "Produces consistently smooth curved bends without visible bend lines, kinking, or segmentation marks for superior aesthetic quality": "Обеспечивает плавные изогнутые изгибы без видимых линий сгиба, перегибов или следов сегментации, что обеспечивает превосходное эстетическое качество.",
  "Mar-Free Bending": "Гибка без повреждений",
  "Urethane die surfaces achieve entirely clean, mark-free bends allowing use of pre-finished or pre-painted sheet metal materials": "Поверхности уретановых штампов обеспечивают абсолютно чистые изгибы без следов, что позволяет использовать предварительно обработанные или окрашенные листовые металлические материалы.",
  "Versatile Radius Range": "Универсальный диапазон радиусов",
  "Wide range from small R5mm radii to large R200mm arcs, with adjustable systems offering multiple radii using the same bottom die": "Широкий диапазон от небольших радиусов R5 мм до больших дуг R200 мм с регулируемыми системами, обеспечивающими несколько радиусов с использованием одной и той же нижней матрицы.",
  "Reduced Springback": "Уменьшенный пружинящий эффект",
  "Properly matched punch radius (63% of material thickness) minimizes springback and ensures consistent bend angles across production runs": "Правильно подобранный радиус пуансона (63 % толщины материала) сводит к минимуму пружинение и обеспечивает одинаковые углы изгиба на протяжении всего производственного цикла.",
  "Extended Tool Life": "Увеличенный срок службы инструмента",
  "Greater die radius reduces friction during bending, minimizing wear and extending tool life for cost-effective production": "Увеличенный радиус матрицы снижает трение во время гибки, сводя к минимуму износ и продлевая срок службы инструмента, что обеспечивает экономически эффективное производство.",
  "Cost-Effective Solution": "Экономичное решение",
  "Eliminates secondary finishing operations and reduces material waste from failed bends, lowering overall production costs": "Устраняет операции вторичной отделки и сокращает отходы материала из-за неудачных изгибов, снижая общие производственные затраты.",
  "Radius Tooling Types & Methods": "Типы и методы радиусных инструментов",
  "Comprehensive range of arc mold tooling solutions for diverse radius bending applications and material requirements": "Комплексный ассортимент инструментов для дуговой формовки для различных применений, связанных с гибкой радиусов и требований к материалам.",
  "Steel Radius Punches": "Стальные радиусные пуансоны",
  "Precision-machined steel punches with fixed radius profiles from R5 to R100mm. Manufactured from heat-treated 42CrMo steel with HRC 45-52 hardness for durability. Tip radius designed at minimum 63% of material thickness to prevent stress concentration. Ideal for standard production radius bending with consistent repeatability.": "Прецизионные стальные пуансоны с профилями фиксированного радиуса от R5 до R100 мм. ",
  "Urethane Radius Dies": "Уретановые радиусные матрицы",
  "High-strength polyurethane bottom dies providing mar-free bending for pre-finished and pre-painted materials. Forgiving urethane material achieves clean bends without surface marking or scratching. Compatible with standard V-die holders. Ideal for architectural panels, appliances, and decorative metalwork requiring pristine surface finish.": "Высокопрочные полиуретановые нижние матрицы обеспечивают гибку без дефектов предварительно обработанных и окрашенных материалов. ",
  "Large Radius Tooling Systems": "Инструментальные системы большого радиуса",
  "Custom-engineered systems for forming large radius arcs (R80-R200mm) that exceed standard press brake table limits. Features modular segmented design for flexible radius adjustment. Compatible with CNC press brakes for automated radius control. Suitable for architectural metalwork, transportation equipment, and large curved panels.": "Специально разработанные системы для формирования дуг большого радиуса (R80-R200 мм), которые превышают стандартные пределы листогибочного пресса. ",
  "Bump Forming Tooling": "Инструменты для формирования выпуклостей",
  "Specialized tooling for creating large radius arcs using multi-step bump forming technique. Approximates smooth arc with series of small incremental bends. Uses standard V-dies and punches with CNC programming for consistent results. Cost-effective solution for large radius applications without dedicated radius tooling investment.": "Специализированный инструмент для создания дуг большого радиуса с использованием техники многоэтапного формирования выпуклостей. ",
  "Adjustable Radius Systems": "Системы регулируемого радиуса",
  "Versatile tooling allowing multiple radius options using same bottom die by changing interchangeable radius punches. Reduces tooling inventory requirements while maintaining flexibility. Quick-change mounting for rapid setup between different radius specifications. Ideal for job shops handling diverse radius bending requirements.": "Универсальные инструменты, позволяющие использовать несколько вариантов радиусов с использованием одной и той же нижней матрицы за счет замены взаимозаменяемых радиусных пуансонов. ",
  "Hybrid Steel-Urethane Dies": "Гибридные стально-уретановые штампы",
  "Advanced tooling combining steel core structural strength with urethane surface layer for mar-free bending. Provides durability of steel with surface protection of urethane. Suitable for high-volume production requiring both strength and surface quality. Extended tool life compared to pure urethane with maintained mar-free performance.": "Усовершенствованный инструмент, сочетающий структурную прочность стального сердечника с уретановым поверхностным слоем для изгиба без повреждений. ",
  "Radius Bending in Action": "Радиусный изгиб в действии",
  "Watch how our arc mold tooling produces smooth, consistent radius bends for professional results": "Посмотрите, как наши инструменты для дуговой формовки обеспечивают плавные и равномерные изгибы по радиусу для достижения профессиональных результатов.",
  "Applications": "Приложения",
  "Arc mold radius tooling is essential for creating smooth curved bends across diverse industries and applications": "Инструменты для создания радиусов дуговых форм необходимы для создания плавных криволинейных изгибов в различных отраслях промышленности и применениях.",
  "Architectural Metalwork": "Архитектурные Металлоконструкции",
  "Creating curved fascias, decorative panels, rounded building elements, and architectural features with smooth radius bends": "Создание изогнутых фасадов, декоративных панелей, закругленных элементов зданий и архитектурных элементов с плавными радиусами изгибов.",
  "Automotive Body Panels": "Автомобильные кузовные панели",
  "Forming fenders, hoods, door panels, and other curved automotive components requiring smooth radius without surface marking": "Формование крыльев, капотов, дверных панелей и других изогнутых автомобильных компонентов, требующих плавного радиуса без маркировки поверхности.",
  "HVAC Ductwork": "Воздуховоды для систем отопления, вентиляции и кондиционирования воздуха",
  "Bending curved duct sections, radius elbows, and custom ventilation components for commercial HVAC systems": "Гибка изогнутых секций воздуховодов, радиусных колен и нестандартных вентиляционных компонентов для коммерческих систем отопления, вентиляции и кондиционирования.",
  "Furniture & Fixtures": "Мебель и фурнитура",
  "Manufacturing curved metal furniture frames, shelving with radius bends, and decorative metal fixtures": "Изготовление гнутых металлических каркасов мебели, стеллажей с радиусными изгибами и декоративных металлических креплений.",
  "Appliance Manufacturing": "Производство бытовой техники",
  "Creating curved panels for refrigerators, washing machines, and appliances requiring smooth radius edges": "Создание изогнутых панелей для холодильников, стиральных машин и бытовой техники, требующей гладких закругленных кромок.",
  "Transportation Equipment": "Транспортное оборудование",
  "Forming curved components for buses, trains, trailers, and specialty vehicles requiring large radius bends": "Формование изогнутых деталей для автобусов, поездов, прицепов и специальных транспортных средств, требующих изгибов большого радиуса.",
  "Signage & Displays": "Вывески и дисплеи",
  "Creating curved letters, rounded sign faces, and display stands with smooth arc formation": "Создание изогнутых букв, закругленных поверхностей знаков и стендов с плавным формированием дуг.",
  "Industrial Enclosures": "Промышленные корпуса",
  "Bending rounded corners for control cabinets, electrical enclosures, and protective covers": "Изгиб закругленных углов шкафов управления, электрических шкафов и защитных крышек",
  "Standard & Optional Tooling": "Стандартный и дополнительный инструмент",
  "Complete arc mold solutions with standard radius configurations and optional custom tooling for specialized applications": "Комплексные решения для изготовления дуговых форм со стандартными конфигурациями радиусов и дополнительными специальными инструментами для специализированных применений.",
  "Standard Radius Tooling": "Стандартный радиусный инструмент",
  "Optional Upgrades": "Дополнительные обновления",
  "Need custom radius tooling for your application?": "Нужен специальный инструмент для вашего применения?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about arc mold and radius bending tooling": "Общие вопросы об инструментах для дуговой формовки и радиусной гибки",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump forming is cost-effective for occasional large radius work, while dedicated radius tooling provides superior surface finish and faster production for regular radius bending applications.": "Для формирования рельефа используются стандартные V-образные штампы и пуансоны с программным управлением ЧПУ для создания дуг большого радиуса посредством множества небольших постепенных изгибов (аппроксимация дуги линейными сегментами). ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative metalwork, and any application where surface quality is critical. Steel dies are preferred for higher production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane combines both benefits.": "Используйте уретановые матрицы при гибке предварительно обработанных, окрашенных или полированных материалов, где маркировка поверхности недопустима. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch tip radius to the natural internal radius created by the die opening for consistent angles. Consider material springback (stainless steel requires 1-2° compensation). Consult our technical team with your material specifications for optimal radius selection.": "Радиус пуансона должен составлять не менее 63% толщины материала, чтобы предотвратить концентрацию напряжений. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius dimensions, material specifications, production volume, and part drawings. Our engineering team will design custom arc molds optimized for your specific application. Custom tooling is particularly cost-effective for high-volume production runs requiring consistent radius specifications not available in standard tooling catalogs.": "Да, мы специализируемся на инструментах нестандартного радиуса для уникальных применений. ",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending. Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "Максимально достижимый радиус зависит от ширины листогибочного стола и системы инструментов. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback: use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening to reduce stress, and consider coining for zero springback applications. Material-specific springback tables help predict and compensate for springback in production.": "Упругость увеличивается с увеличением твердости материала и уменьшается с увеличением радиуса изгиба. ",
  "Have a radius tooling question?": "У вас есть вопрос по радиусному инструменту?",
  "Download Arc Mold Catalog": "Загрузить каталог дуговых пресс-форм",
  "Get comprehensive technical specifications, radius charts, material options, and application guides for our complete range of arc mold and radius bending tooling.": "Получите подробные технические характеристики, таблицы радиусов, варианты материалов и руководства по применению для всей нашей линейки инструментов для дуговой формовки и радиальной гибки."
}