{
  "CNC Bending Machine Arc Mold": "Moule à arc pour machine à cintrer CNC",
  "Advanced radius bending tooling engineered for precision arc formation on CNC press brakes. Produces consistently smooth curved bends without bend lines, kinking, or material marking. Available in steel and urethane configurations for diverse radius applications from R5 to R200mm.": "Outillage de cintrage de rayon avancé conçu pour la formation d'arc de précision sur les presses plieuses CNC. ",
  "Request Quote": "Demander un devis",
  "Learn More": "Apprendre encore plus",
  "Technical Specifications": "Spécifications techniques",
  "Professional radius bending tooling for smooth arc formation on CNC press brake machines": "Outillage de cintrage à rayon professionnel pour une formation d'arc en douceur sur les presses plieuses CNC",
  "Arc Radius Capacity": "Capacité de rayon d'arc",
  "Standard Radius: R5, R8, R10, R15, R20, R25": "Rayon standard : R5, R8, R10, R15, R20, R25",
  "Large Radius: R30, R40, R50, R60, R80, R100": "Grand rayon : R30, R40, R50, R60, R80, R100",
  "Extra Large: R120, R150, R200mm": "Très grand : R120, R150, R200 mm",
  "Custom Radius: Available on request": "Rayon personnalisé : disponible sur demande",
  "Material Options": "Options matérielles",
  "Steel Dies: Heat-treated 42CrMo (HRC 45-52)": "Matrices en acier : 42CrMo traité thermiquement (HRC 45-52)",
  "Urethane Dies: High-strength polyurethane": "Matrices en uréthane : polyuréthane haute résistance",
  "Hybrid: Steel core with urethane surface": "Hybride : noyau en acier avec surface en uréthane",
  "Precision ground and polished finish": "Finition rectifiée et polie avec précision",
  "Die Configurations": "Configurations de matrices",
  "Single Radius Punches (fixed radius)": "Poinçons à rayon unique (rayon fixe)",
  "Adjustable Radius Systems (multi-radius)": "Systèmes à rayon réglable (multi-rayons)",
  "Bump Forming Tooling (segmented arcs)": "Outillage de formage de bosses (arcs segmentés)",
  "Standard Lengths: 500mm, 835mm, custom": "Longueurs standard : 500 mm, 835 mm, sur mesure",
  "Why Choose Our Arc Mold Radius Tooling?": "Pourquoi choisir notre outillage de rayon de moule à arc ?",
  "Superior radius bending solutions engineered for smooth arc formation, mar-free finishing, and consistent repeatability in demanding production environments": "Solutions de cintrage à rayon supérieur conçues pour une formation d'arc douce, une finition sans traces et une répétabilité constante dans les environnements de production exigeants",
  "Smooth Radius Formation": "Formation de rayon lisse",
  "Produces consistently smooth curved bends without visible bend lines, kinking, or segmentation marks for superior aesthetic quality": "Produit des courbures incurvées uniformément lisses sans lignes de courbure visibles, vrilles ou marques de segmentation pour une qualité esthétique supérieure",
  "Mar-Free Bending": "Pliage sans Mar",
  "Urethane die surfaces achieve entirely clean, mark-free bends allowing use of pre-finished or pre-painted sheet metal materials": "Les surfaces des matrices en uréthane permettent d'obtenir des courbures entièrement propres et sans marques permettant l'utilisation de matériaux en tôle préfinis ou pré-peints",
  "Versatile Radius Range": "Gamme de rayon polyvalente",
  "Wide range from small R5mm radii to large R200mm arcs, with adjustable systems offering multiple radii using the same bottom die": "Large gamme allant des petits rayons R5 mm aux grands arcs R200 mm, avec des systèmes réglables offrant plusieurs rayons en utilisant la même matrice inférieure",
  "Reduced Springback": "Retour élastique réduit",
  "Properly matched punch radius (63% of material thickness) minimizes springback and ensures consistent bend angles across production runs": "Un rayon de poinçon correctement adapté (63 % de l'épaisseur du matériau) minimise le retour élastique et garantit des angles de courbure constants tout au long des cycles de production.",
  "Extended Tool Life": "Durée de vie prolongée de l'outil",
  "Greater die radius reduces friction during bending, minimizing wear and extending tool life for cost-effective production": "Un plus grand rayon de matrice réduit la friction lors du pliage, minimisant ainsi l'usure et prolongeant la durée de vie de l'outil pour une production rentable",
  "Cost-Effective Solution": "Solution rentable",
  "Eliminates secondary finishing operations and reduces material waste from failed bends, lowering overall production costs": "Élimine les opérations de finition secondaire et réduit les déchets de matériaux dus aux pliages défectueux, réduisant ainsi les coûts de production globaux",
  "Radius Tooling Types & Methods": "Types et méthodes d'outillage à rayon",
  "Comprehensive range of arc mold tooling solutions for diverse radius bending applications and material requirements": "Gamme complète de solutions d'outillage pour moules à arc pour diverses applications de cintrage à rayon et exigences en matière de matériaux",
  "Steel Radius Punches": "Poinçons à rayon en acier",
  "Precision-machined steel punches with fixed radius profiles from R5 to R100mm. Manufactured from heat-treated 42CrMo steel with HRC 45-52 hardness for durability. Tip radius designed at minimum 63% of material thickness to prevent stress concentration. Ideal for standard production radius bending with consistent repeatability.": "Poinçons en acier usinés avec précision avec des profils à rayon fixe de R5 à R100 mm. ",
  "Urethane Radius Dies": "Matrices de rayon en uréthane",
  "High-strength polyurethane bottom dies providing mar-free bending for pre-finished and pre-painted materials. Forgiving urethane material achieves clean bends without surface marking or scratching. Compatible with standard V-die holders. Ideal for architectural panels, appliances, and decorative metalwork requiring pristine surface finish.": "Matrices inférieures en polyuréthane haute résistance permettant une flexion sans traces pour les matériaux préfinis et pré-peints. ",
  "Large Radius Tooling Systems": "Systèmes d'outillage à grand rayon",
  "Custom-engineered systems for forming large radius arcs (R80-R200mm) that exceed standard press brake table limits. Features modular segmented design for flexible radius adjustment. Compatible with CNC press brakes for automated radius control. Suitable for architectural metalwork, transportation equipment, and large curved panels.": "Systèmes conçus sur mesure pour former des arcs à grand rayon (R80-R200mm) qui dépassent les limites standard des tables de presse plieuse. ",
  "Bump Forming Tooling": "Outillage de formage de bosses",
  "Specialized tooling for creating large radius arcs using multi-step bump forming technique. Approximates smooth arc with series of small incremental bends. Uses standard V-dies and punches with CNC programming for consistent results. Cost-effective solution for large radius applications without dedicated radius tooling investment.": "Outillage spécialisé pour créer des arcs à grand rayon à l'aide d'une technique de formage de bosses en plusieurs étapes. ",
  "Adjustable Radius Systems": "Systèmes à rayon réglable",
  "Versatile tooling allowing multiple radius options using same bottom die by changing interchangeable radius punches. Reduces tooling inventory requirements while maintaining flexibility. Quick-change mounting for rapid setup between different radius specifications. Ideal for job shops handling diverse radius bending requirements.": "Outillage polyvalent permettant plusieurs options de rayon en utilisant la même matrice inférieure en changeant les poinçons à rayon interchangeables. ",
  "Hybrid Steel-Urethane Dies": "Matrices hybrides acier-uréthane",
  "Advanced tooling combining steel core structural strength with urethane surface layer for mar-free bending. Provides durability of steel with surface protection of urethane. Suitable for high-volume production requiring both strength and surface quality. Extended tool life compared to pure urethane with maintained mar-free performance.": "Outillage avancé combinant la résistance structurelle du noyau en acier avec une couche de surface en uréthane pour une flexion sans traces. ",
  "Radius Bending in Action": "Courbure du rayon en action",
  "Watch how our arc mold tooling produces smooth, consistent radius bends for professional results": "Regardez comment nos outils de moulage à arc produisent des courbures à rayon lisse et constant pour des résultats professionnels",
  "Applications": "Applications",
  "Arc mold radius tooling is essential for creating smooth curved bends across diverse industries and applications": "L'outillage à rayon de moule en arc est essentiel pour créer des courbures courbes douces dans diverses industries et applications",
  "Architectural Metalwork": "Ferronnerie architecturale",
  "Creating curved fascias, decorative panels, rounded building elements, and architectural features with smooth radius bends": "Création de façades incurvées, de panneaux décoratifs, d'éléments de construction arrondis et d'éléments architecturaux avec des courbures à rayon lisse",
  "Automotive Body Panels": "Panneaux de carrosserie automobile",
  "Forming fenders, hoods, door panels, and other curved automotive components requiring smooth radius without surface marking": "Former des ailes, des capots, des panneaux de porte et d'autres composants automobiles incurvés nécessitant un rayon lisse sans marquage de surface",
  "HVAC Ductwork": "Conduits CVC",
  "Bending curved duct sections, radius elbows, and custom ventilation components for commercial HVAC systems": "Pliage de sections de conduits incurvés, de coudes à rayon et de composants de ventilation personnalisés pour les systèmes CVC commerciaux",
  "Furniture & Fixtures": "Meubles et accessoires",
  "Manufacturing curved metal furniture frames, shelving with radius bends, and decorative metal fixtures": "Fabrication de cadres de meubles en métal courbé, d'étagères avec courbures arrondies et de luminaires décoratifs en métal",
  "Appliance Manufacturing": "Fabrication d'appareils électroménagers",
  "Creating curved panels for refrigerators, washing machines, and appliances requiring smooth radius edges": "Création de panneaux incurvés pour les réfrigérateurs, les machines à laver et les appareils nécessitant des bords à rayon lisse",
  "Transportation Equipment": "Équipement de transport",
  "Forming curved components for buses, trains, trailers, and specialty vehicles requiring large radius bends": "Former des composants incurvés pour les bus, les trains, les remorques et les véhicules spéciaux nécessitant des coudes à grand rayon",
  "Signage & Displays": "Signalisation et affichages",
  "Creating curved letters, rounded sign faces, and display stands with smooth arc formation": "Création de lettres courbes, de faces de panneaux arrondies et de présentoirs avec formation d'arcs lisses",
  "Industrial Enclosures": "Boîtiers industriels",
  "Bending rounded corners for control cabinets, electrical enclosures, and protective covers": "Pliage des coins arrondis pour armoires de commande, coffrets électriques et capots de protection",
  "Standard & Optional Tooling": "Outillage standard et optionnel",
  "Complete arc mold solutions with standard radius configurations and optional custom tooling for specialized applications": "Solutions complètes de moules à arc avec configurations de rayon standard et outillage personnalisé en option pour les applications spécialisées",
  "Standard Radius Tooling": "Outillage à rayon standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need custom radius tooling for your application?": "Besoin d'un outillage à rayon personnalisé pour votre application ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about arc mold and radius bending tooling": "Questions courantes sur les moules à arc et les outils de cintrage à rayon",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump forming is cost-effective for occasional large radius work, while dedicated radius tooling provides superior surface finish and faster production for regular radius bending applications.": "Le formage de bosses utilise des matrices en V et des poinçons standard avec une programmation CNC pour créer des arcs à grand rayon à travers plusieurs petits coudes incrémentiels (rapprochant l'arc avec des segments linéaires). ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative metalwork, and any application where surface quality is critical. Steel dies are preferred for higher production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane combines both benefits.": "Utilisez des matrices en uréthane pour plier des matériaux préfinis, pré-peints ou polis où le marquage de surface est inacceptable. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch tip radius to the natural internal radius created by the die opening for consistent angles. Consider material springback (stainless steel requires 1-2° compensation). Consult our technical team with your material specifications for optimal radius selection.": "Le rayon du poinçon doit être d'au moins 63 % de l'épaisseur du matériau pour éviter la concentration des contraintes. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius dimensions, material specifications, production volume, and part drawings. Our engineering team will design custom arc molds optimized for your specific application. Custom tooling is particularly cost-effective for high-volume production runs requiring consistent radius specifications not available in standard tooling catalogs.": "Oui, nous sommes spécialisés dans les outils à rayon personnalisé pour des applications uniques. ",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending. Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "Le rayon maximum réalisable dépend de la largeur de la table de la presse plieuse et du système d'outillage. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback: use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening to reduce stress, and consider coining for zero springback applications. Material-specific springback tables help predict and compensate for springback in production.": "Le retour élastique augmente avec la dureté du matériau et diminue avec un rayon de courbure plus grand. ",
  "Have a radius tooling question?": "Vous avez une question sur l'outillage à rayon ?",
  "Download Arc Mold Catalog": "Télécharger le catalogue de moules à arc",
  "Get comprehensive technical specifications, radius charts, material options, and application guides for our complete range of arc mold and radius bending tooling.": "Obtenez des spécifications techniques complètes, des tableaux de rayons, des options de matériaux et des guides d'application pour notre gamme complète d'outils de moulage à arc et de cintrage à rayon."
}