{
  "CNC Bending Machine Arc Mold": "Molde de arco de máquina dobladora CNC",
  "Advanced radius bending tooling engineered for precision arc formation on CNC press brakes. Produces consistently smooth curved bends without bend lines, kinking, or material marking. Available in steel and urethane configurations for diverse radius applications from R5 to R200mm.": "Herramientas avanzadas de doblado de radio diseñadas para la formación de arcos de precisión en plegadoras CNC. ",
  "Request Quote": "Solicitar Cotización",
  "Learn More": "Más información",
  "Technical Specifications": "Especificaciones técnicas",
  "Professional radius bending tooling for smooth arc formation on CNC press brake machines": "Herramientas profesionales de doblado de radio para una formación de arco suave en máquinas plegadoras CNC",
  "Arc Radius Capacity": "Capacidad del radio del arco",
  "Standard Radius: R5, R8, R10, R15, R20, R25": "Radio estándar: R5, R8, R10, R15, R20, R25",
  "Large Radius: R30, R40, R50, R60, R80, R100": "Radio grande: R30, R40, R50, R60, R80, R100",
  "Extra Large: R120, R150, R200mm": "Extra grande: R120, R150, R200 mm",
  "Custom Radius: Available on request": "Radio personalizado: disponible bajo pedido",
  "Material Options": "Opciones de materiales",
  "Steel Dies: Heat-treated 42CrMo (HRC 45-52)": "Troqueles de acero: 42CrMo tratado térmicamente (HRC 45-52)",
  "Urethane Dies: High-strength polyurethane": "Troqueles de uretano: poliuretano de alta resistencia",
  "Hybrid: Steel core with urethane surface": "Híbrido: Núcleo de acero con superficie de uretano",
  "Precision ground and polished finish": "Acabado pulido y rectificado de precisión",
  "Die Configurations": "Configuraciones de matriz",
  "Single Radius Punches (fixed radius)": "Punzones de radio único (radio fijo)",
  "Adjustable Radius Systems (multi-radius)": "Sistemas de radio ajustable (multiradio)",
  "Bump Forming Tooling (segmented arcs)": "Herramientas de formación de relieve (arcos segmentados)",
  "Standard Lengths: 500mm, 835mm, custom": "Longitudes estándar: 500 mm, 835 mm, personalizadas",
  "Why Choose Our Arc Mold Radius Tooling?": "¿Por qué elegir nuestras herramientas de radio de molde de arco?",
  "Superior radius bending solutions engineered for smooth arc formation, mar-free finishing, and consistent repeatability in demanding production environments": "Soluciones superiores de doblado de radio diseñadas para una formación de arco suave, un acabado sin marcas y una repetibilidad constante en entornos de producción exigentes.",
  "Smooth Radius Formation": "Formación de radio suave",
  "Produces consistently smooth curved bends without visible bend lines, kinking, or segmentation marks for superior aesthetic quality": "Produce curvaturas consistentemente suaves sin líneas de curvatura visibles, torceduras o marcas de segmentación para una calidad estética superior.",
  "Mar-Free Bending": "Doblado sin marcas",
  "Urethane die surfaces achieve entirely clean, mark-free bends allowing use of pre-finished or pre-painted sheet metal materials": "Las superficies de los troqueles de uretano logran curvaturas completamente limpias y sin marcas, lo que permite el uso de materiales de lámina metálica preacabados o prepintados.",
  "Versatile Radius Range": "Rango de radio versátil",
  "Wide range from small R5mm radii to large R200mm arcs, with adjustable systems offering multiple radii using the same bottom die": "Amplia gama desde radios pequeños de R5 mm hasta arcos grandes de R200 mm, con sistemas ajustables que ofrecen múltiples radios utilizando el mismo troquel inferior",
  "Reduced Springback": "Springback reducido",
  "Properly matched punch radius (63% of material thickness) minimizes springback and ensures consistent bend angles across production runs": "El radio del punzón correctamente adaptado (63% del espesor del material) minimiza la recuperación elástica y garantiza ángulos de curvatura consistentes en todas las tiradas de producción.",
  "Extended Tool Life": "Vida útil extendida de la herramienta",
  "Greater die radius reduces friction during bending, minimizing wear and extending tool life for cost-effective production": "Un mayor radio de matriz reduce la fricción durante el doblado, minimizando el desgaste y extendiendo la vida útil de la herramienta para una producción rentable.",
  "Cost-Effective Solution": "Solución rentable",
  "Eliminates secondary finishing operations and reduces material waste from failed bends, lowering overall production costs": "Elimina las operaciones de acabado secundario y reduce el desperdicio de material por dobleces fallidos, lo que reduce los costos generales de producción.",
  "Radius Tooling Types & Methods": "Tipos y métodos de herramientas de radio",
  "Comprehensive range of arc mold tooling solutions for diverse radius bending applications and material requirements": "Gama completa de soluciones de herramientas de moldeo por arco para diversas aplicaciones de doblado de radios y requisitos de materiales",
  "Steel Radius Punches": "Punzones de radio de acero",
  "Precision-machined steel punches with fixed radius profiles from R5 to R100mm. Manufactured from heat-treated 42CrMo steel with HRC 45-52 hardness for durability. Tip radius designed at minimum 63% of material thickness to prevent stress concentration. Ideal for standard production radius bending with consistent repeatability.": "Punzones de acero mecanizados con precisión con perfiles de radio fijo desde R5 hasta R100mm. ",
  "Urethane Radius Dies": "Troqueles de radio de uretano",
  "High-strength polyurethane bottom dies providing mar-free bending for pre-finished and pre-painted materials. Forgiving urethane material achieves clean bends without surface marking or scratching. Compatible with standard V-die holders. Ideal for architectural panels, appliances, and decorative metalwork requiring pristine surface finish.": "Troqueles inferiores de poliuretano de alta resistencia que proporcionan un doblado sin marcas para materiales preacabados y prepintados. ",
  "Large Radius Tooling Systems": "Sistemas de herramientas de gran radio",
  "Custom-engineered systems for forming large radius arcs (R80-R200mm) that exceed standard press brake table limits. Features modular segmented design for flexible radius adjustment. Compatible with CNC press brakes for automated radius control. Suitable for architectural metalwork, transportation equipment, and large curved panels.": "Sistemas diseñados a medida para formar arcos de gran radio (R80-R200 mm) que superan los límites de la mesa de plegadora estándar. ",
  "Bump Forming Tooling": "Herramientas de formación de protuberancias",
  "Specialized tooling for creating large radius arcs using multi-step bump forming technique. Approximates smooth arc with series of small incremental bends. Uses standard V-dies and punches with CNC programming for consistent results. Cost-effective solution for large radius applications without dedicated radius tooling investment.": "Herramientas especializadas para crear arcos de gran radio mediante la técnica de formación de protuberancias de varios pasos. ",
  "Adjustable Radius Systems": "Sistemas de radio ajustable",
  "Versatile tooling allowing multiple radius options using same bottom die by changing interchangeable radius punches. Reduces tooling inventory requirements while maintaining flexibility. Quick-change mounting for rapid setup between different radius specifications. Ideal for job shops handling diverse radius bending requirements.": "Herramientas versátiles que permiten múltiples opciones de radio utilizando el mismo troquel inferior cambiando punzones de radio intercambiables. ",
  "Hybrid Steel-Urethane Dies": "Matrices híbridas de acero y uretano",
  "Advanced tooling combining steel core structural strength with urethane surface layer for mar-free bending. Provides durability of steel with surface protection of urethane. Suitable for high-volume production requiring both strength and surface quality. Extended tool life compared to pure urethane with maintained mar-free performance.": "Herramientas avanzadas que combinan la resistencia estructural del núcleo de acero con una capa superficial de uretano para una flexión sin marcas. ",
  "Radius Bending in Action": "Radio de flexión en acción",
  "Watch how our arc mold tooling produces smooth, consistent radius bends for professional results": "Vea cómo nuestras herramientas de moldeo por arco producen curvaturas de radio uniformes y uniformes para obtener resultados profesionales",
  "Applications": "Aplicaciones",
  "Arc mold radius tooling is essential for creating smooth curved bends across diverse industries and applications": "Las herramientas con radio de molde de arco son esenciales para crear curvas suaves y curvas en diversas industrias y aplicaciones.",
  "Architectural Metalwork": "Metalistería arquitectónica",
  "Creating curved fascias, decorative panels, rounded building elements, and architectural features with smooth radius bends": "Crear fascias curvas, paneles decorativos, elementos de construcción redondeados y características arquitectónicas con curvas de radio suave.",
  "Automotive Body Panels": "Paneles de carrocería para automóviles",
  "Forming fenders, hoods, door panels, and other curved automotive components requiring smooth radius without surface marking": "Formar guardabarros, capós, paneles de puertas y otros componentes automotrices curvos que requieren un radio suave sin marcar la superficie",
  "HVAC Ductwork": "Conductos de climatización",
  "Bending curved duct sections, radius elbows, and custom ventilation components for commercial HVAC systems": "Doblado de secciones de conductos curvos, codos radiales y componentes de ventilación personalizados para sistemas HVAC comerciales",
  "Furniture & Fixtures": "Muebles y accesorios",
  "Manufacturing curved metal furniture frames, shelving with radius bends, and decorative metal fixtures": "Fabricación de marcos de muebles metálicos curvos, estanterías con curvaturas radiales y accesorios metálicos decorativos.",
  "Appliance Manufacturing": "Fabricación de electrodomésticos",
  "Creating curved panels for refrigerators, washing machines, and appliances requiring smooth radius edges": "Creación de paneles curvos para refrigeradores, lavadoras y electrodomésticos que requieren bordes con radios suaves",
  "Transportation Equipment": "Equipo de transporte",
  "Forming curved components for buses, trains, trailers, and specialty vehicles requiring large radius bends": "Formar componentes curvos para autobuses, trenes, remolques y vehículos especiales que requieren curvaturas de gran radio.",
  "Signage & Displays": "Señalización y pantallas",
  "Creating curved letters, rounded sign faces, and display stands with smooth arc formation": "Creación de letras curvas, caras de letreros redondeadas y expositores con una formación de arco suave",
  "Industrial Enclosures": "Cerramientos Industriales",
  "Bending rounded corners for control cabinets, electrical enclosures, and protective covers": "Doblado de esquinas redondeadas para armarios de control, armarios eléctricos y cubiertas protectoras",
  "Standard & Optional Tooling": "Herramientas estándar y opcionales",
  "Complete arc mold solutions with standard radius configurations and optional custom tooling for specialized applications": "Soluciones completas de moldeo por arco con configuraciones de radio estándar y herramientas personalizadas opcionales para aplicaciones especializadas",
  "Standard Radius Tooling": "Herramientas de radio estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need custom radius tooling for your application?": "¿Necesita herramientas de radio personalizadas para su aplicación?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about arc mold and radius bending tooling": "Preguntas comunes sobre moldes de arco y herramientas de curvatura de radio",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump forming is cost-effective for occasional large radius work, while dedicated radius tooling provides superior surface finish and faster production for regular radius bending applications.": "El conformado por relieve utiliza troqueles en V estándar y punzones con programación CNC para crear arcos de gran radio a través de múltiples curvaturas incrementales pequeñas (aproximando el arco con segmentos lineales). ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative metalwork, and any application where surface quality is critical. Steel dies are preferred for higher production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane combines both benefits.": "Utilice troqueles de uretano al doblar materiales preacabados, prepintados o pulidos donde las marcas en la superficie son inaceptables. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch tip radius to the natural internal radius created by the die opening for consistent angles. Consider material springback (stainless steel requires 1-2° compensation). Consult our technical team with your material specifications for optimal radius selection.": "El radio del punzón debe ser al menos el 63% del espesor del material para evitar la concentración de tensiones. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius dimensions, material specifications, production volume, and part drawings. Our engineering team will design custom arc molds optimized for your specific application. Custom tooling is particularly cost-effective for high-volume production runs requiring consistent radius specifications not available in standard tooling catalogs.": "Sí, nos especializamos en herramientas de radio personalizadas para aplicaciones únicas. ",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending. Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "El radio máximo alcanzable depende del ancho de la mesa plegadora y del sistema de herramientas. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback: use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening to reduce stress, and consider coining for zero springback applications. Material-specific springback tables help predict and compensate for springback in production.": "La recuperación elástica aumenta con la dureza del material y disminuye con un radio de curvatura mayor. ",
  "Have a radius tooling question?": "¿Tiene alguna pregunta sobre herramientas de radio?",
  "Download Arc Mold Catalog": "Descargar el catálogo de moldes de arco",
  "Get comprehensive technical specifications, radius charts, material options, and application guides for our complete range of arc mold and radius bending tooling.": "Obtenga especificaciones técnicas completas, tablas de radios, opciones de materiales y guías de aplicación para nuestra gama completa de herramientas de doblado de radios y moldes de arco."
}