{
  "CNC Bending Machine Arc Mold": "CNC-Biegemaschine Lichtbogenform",
  "Advanced radius bending tooling engineered for precision arc formation on CNC press brakes. Produces consistently smooth curved bends without bend lines, kinking, or material marking. Available in steel and urethane configurations for diverse radius applications from R5 to R200mm.": "Fortschrittliche Radiusbiegewerkzeuge, die für die präzise Bogenbildung auf CNC-Abkantpressen entwickelt wurden. ",
  "Request Quote": "Angebot anfordern",
  "Learn More": "Erfahren Sie mehr",
  "Technical Specifications": "Technische Spezifikationen",
  "Professional radius bending tooling for smooth arc formation on CNC press brake machines": "Professionelle Radiusbiegewerkzeuge für eine reibungslose Bogenbildung auf CNC-Abkantpressen",
  "Arc Radius Capacity": "Bogenradiuskapazität",
  "Standard Radius: R5, R8, R10, R15, R20, R25": "Standardradius: R5, R8, R10, R15, R20, R25",
  "Large Radius: R30, R40, R50, R60, R80, R100": "Großer Radius: R30, R40, R50, R60, R80, R100",
  "Extra Large: R120, R150, R200mm": "Extragroß: R120, R150, R200 mm",
  "Custom Radius: Available on request": "Benutzerdefinierter Radius: Auf Anfrage erhältlich",
  "Material Options": "Materialoptionen",
  "Steel Dies: Heat-treated 42CrMo (HRC 45-52)": "Stahlmatrizen: Wärmebehandeltes 42CrMo (HRC 45-52)",
  "Urethane Dies: High-strength polyurethane": "Urethan-Matrizen: Hochfestes Polyurethan",
  "Hybrid: Steel core with urethane surface": "Hybrid: Stahlkern mit Urethanoberfläche",
  "Precision ground and polished finish": "Präzise geschliffene und polierte Oberfläche",
  "Die Configurations": "Die Konfigurationen",
  "Single Radius Punches (fixed radius)": "Einzelradiusstanzen (fester Radius)",
  "Adjustable Radius Systems (multi-radius)": "Systeme mit einstellbarem Radius (Multiradius)",
  "Bump Forming Tooling (segmented arcs)": "Bump Forming Tooling (segmentierte Bögen)",
  "Standard Lengths: 500mm, 835mm, custom": "Standardlängen: 500 mm, 835 mm, kundenspezifisch",
  "Why Choose Our Arc Mold Radius Tooling?": "Warum sollten Sie sich für unser Arc Mould Radius Tooling entscheiden?",
  "Superior radius bending solutions engineered for smooth arc formation, mar-free finishing, and consistent repeatability in demanding production environments": "Überlegene Lösungen für das Radiusbiegen, die für eine gleichmäßige Lichtbogenbildung, kratzfreie Endbearbeitung und konsistente Wiederholgenauigkeit in anspruchsvollen Produktionsumgebungen entwickelt wurden",
  "Smooth Radius Formation": "Glatte Radiusbildung",
  "Produces consistently smooth curved bends without visible bend lines, kinking, or segmentation marks for superior aesthetic quality": "Erzeugt gleichmäßig glatte, gebogene Biegungen ohne sichtbare Biegelinien, Knicke oder Segmentierungsmarkierungen für eine hervorragende ästhetische Qualität",
  "Mar-Free Bending": "Bruchfreies Biegen",
  "Urethane die surfaces achieve entirely clean, mark-free bends allowing use of pre-finished or pre-painted sheet metal materials": "Urethan-Matrizenoberflächen ermöglichen völlig saubere, abdruckfreie Biegungen und ermöglichen die Verwendung vorgefertigter oder vorlackierter Blechmaterialien",
  "Versatile Radius Range": "Vielseitiges Radiussortiment",
  "Wide range from small R5mm radii to large R200mm arcs, with adjustable systems offering multiple radii using the same bottom die": "Große Auswahl von kleinen R5-mm-Radien bis hin zu großen R200-mm-Bögen, wobei einstellbare Systeme mehrere Radien mit derselben Untermatrize ermöglichen",
  "Reduced Springback": "Reduzierte Rückfederung",
  "Properly matched punch radius (63% of material thickness) minimizes springback and ensures consistent bend angles across production runs": "Ein richtig abgestimmter Stempelradius (63 % der Materialstärke) minimiert die Rückfederung und gewährleistet konsistente Biegewinkel über alle Produktionsläufe hinweg",
  "Extended Tool Life": "Längere Werkzeuglebensdauer",
  "Greater die radius reduces friction during bending, minimizing wear and extending tool life for cost-effective production": "Ein größerer Matrizenradius reduziert die Reibung beim Biegen, minimiert den Verschleiß und verlängert die Werkzeuglebensdauer für eine kostengünstige Produktion",
  "Cost-Effective Solution": "Kostengünstige Lösung",
  "Eliminates secondary finishing operations and reduces material waste from failed bends, lowering overall production costs": "Eliminiert sekundäre Nachbearbeitungsvorgänge und reduziert Materialverschwendung durch fehlerhafte Biegungen, wodurch die Gesamtproduktionskosten gesenkt werden",
  "Radius Tooling Types & Methods": "Arten und Methoden von Radiuswerkzeugen",
  "Comprehensive range of arc mold tooling solutions for diverse radius bending applications and material requirements": "Umfassendes Sortiment an Lichtbogenformwerkzeuglösungen für unterschiedliche Radiusbiegeanwendungen und Materialanforderungen",
  "Steel Radius Punches": "Radius-Stanzer aus Stahl",
  "Precision-machined steel punches with fixed radius profiles from R5 to R100mm. Manufactured from heat-treated 42CrMo steel with HRC 45-52 hardness for durability. Tip radius designed at minimum 63% of material thickness to prevent stress concentration. Ideal for standard production radius bending with consistent repeatability.": "Präzisionsgefertigte Stahlstempel mit Profilen mit festem Radius von R5 bis R100 mm. ",
  "Urethane Radius Dies": "Urethan-Radiusmatrizen",
  "High-strength polyurethane bottom dies providing mar-free bending for pre-finished and pre-painted materials. Forgiving urethane material achieves clean bends without surface marking or scratching. Compatible with standard V-die holders. Ideal for architectural panels, appliances, and decorative metalwork requiring pristine surface finish.": "Hochfeste Polyurethan-Untermatrizen ermöglichen ein kratzfreies Biegen vorgefertigter und vorlackierter Materialien. ",
  "Large Radius Tooling Systems": "Werkzeugsysteme mit großem Radius",
  "Custom-engineered systems for forming large radius arcs (R80-R200mm) that exceed standard press brake table limits. Features modular segmented design for flexible radius adjustment. Compatible with CNC press brakes for automated radius control. Suitable for architectural metalwork, transportation equipment, and large curved panels.": "Maßgeschneiderte Systeme zum Formen von Bögen mit großen Radien (R80–R200 mm), die die Standardgrenzen für Abkantpresstische überschreiten. ",
  "Bump Forming Tooling": "Werkzeuge zur Bump-Formung",
  "Specialized tooling for creating large radius arcs using multi-step bump forming technique. Approximates smooth arc with series of small incremental bends. Uses standard V-dies and punches with CNC programming for consistent results. Cost-effective solution for large radius applications without dedicated radius tooling investment.": "Spezialwerkzeug zum Erstellen von Bögen mit großem Radius mithilfe der mehrstufigen Bump-Forming-Technik. ",
  "Adjustable Radius Systems": "Systeme mit einstellbarem Radius",
  "Versatile tooling allowing multiple radius options using same bottom die by changing interchangeable radius punches. Reduces tooling inventory requirements while maintaining flexibility. Quick-change mounting for rapid setup between different radius specifications. Ideal for job shops handling diverse radius bending requirements.": "Vielseitige Werkzeuge, die mehrere Radiusoptionen mit derselben unteren Matrize ermöglichen, indem austauschbare Radiusstempel ausgetauscht werden. ",
  "Hybrid Steel-Urethane Dies": "Hybrid-Stahl-Urethan-Matrizen",
  "Advanced tooling combining steel core structural strength with urethane surface layer for mar-free bending. Provides durability of steel with surface protection of urethane. Suitable for high-volume production requiring both strength and surface quality. Extended tool life compared to pure urethane with maintained mar-free performance.": "Fortschrittliche Werkzeuge, die die Strukturfestigkeit eines Stahlkerns mit einer Urethan-Oberflächenschicht für kratzfreies Biegen kombinieren. ",
  "Radius Bending in Action": "Radiusbiegen in Aktion",
  "Watch how our arc mold tooling produces smooth, consistent radius bends for professional results": "Sehen Sie, wie unsere Lichtbogenformwerkzeuge glatte Biegungen mit gleichmäßigem Radius für professionelle Ergebnisse erzeugen",
  "Applications": "Anwendungen",
  "Arc mold radius tooling is essential for creating smooth curved bends across diverse industries and applications": "Arc-Formradiuswerkzeuge sind für die Erzeugung glatter Kurvenbiegungen in verschiedenen Branchen und Anwendungen unerlässlich",
  "Architectural Metalwork": "Architektonische Metallarbeiten",
  "Creating curved fascias, decorative panels, rounded building elements, and architectural features with smooth radius bends": "Erstellen Sie geschwungene Fassaden, dekorative Paneele, abgerundete Gebäudeelemente und architektonische Elemente mit sanften Biegungen",
  "Automotive Body Panels": "Karosserieteile für Kraftfahrzeuge",
  "Forming fenders, hoods, door panels, and other curved automotive components requiring smooth radius without surface marking": "Formen von Kotflügeln, Motorhauben, Türverkleidungen und anderen gebogenen Automobilkomponenten, die einen glatten Radius ohne Oberflächenmarkierung erfordern",
  "HVAC Ductwork": "HVAC-Rohrleitungen",
  "Bending curved duct sections, radius elbows, and custom ventilation components for commercial HVAC systems": "Biegen gebogener Kanalabschnitte, Radiusbögen und kundenspezifischer Lüftungskomponenten für gewerbliche HVAC-Systeme",
  "Furniture & Fixtures": "Möbel und Einrichtungsgegenstände",
  "Manufacturing curved metal furniture frames, shelving with radius bends, and decorative metal fixtures": "Herstellung von gebogenen Möbelrahmen aus Metall, Regalen mit Radiusbiegungen und dekorativen Metallbeschlägen",
  "Appliance Manufacturing": "Geräteherstellung",
  "Creating curved panels for refrigerators, washing machines, and appliances requiring smooth radius edges": "Erstellen gebogener Paneele für Kühlschränke, Waschmaschinen und Geräte, die Kanten mit glattem Radius erfordern",
  "Transportation Equipment": "Transportausrüstung",
  "Forming curved components for buses, trains, trailers, and specialty vehicles requiring large radius bends": "Formen gebogener Komponenten für Busse, Züge, Anhänger und Spezialfahrzeuge, die große Biegeradien erfordern",
  "Signage & Displays": "Beschilderung und Displays",
  "Creating curved letters, rounded sign faces, and display stands with smooth arc formation": "Erstellen Sie geschwungene Buchstaben, abgerundete Schilderflächen und Präsentationsständer mit sanfter Bogenbildung",
  "Industrial Enclosures": "Industriegehäuse",
  "Bending rounded corners for control cabinets, electrical enclosures, and protective covers": "Biegen abgerundeter Ecken für Schaltschränke, Elektrogehäuse und Schutzabdeckungen",
  "Standard & Optional Tooling": "Standard- und optionale Werkzeuge",
  "Complete arc mold solutions with standard radius configurations and optional custom tooling for specialized applications": "Komplette Lichtbogenformlösungen mit Standardradiuskonfigurationen und optionalen kundenspezifischen Werkzeugen für spezielle Anwendungen",
  "Standard Radius Tooling": "Standard-Radiuswerkzeuge",
  "Optional Upgrades": "Optionale Upgrades",
  "Need custom radius tooling for your application?": "Benötigen Sie maßgeschneiderte Radiuswerkzeuge für Ihre Anwendung?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about arc mold and radius bending tooling": "Häufige Fragen zu Lichtbogenform- und Radiusbiegewerkzeugen",
  "Bump forming uses standard V-dies and punches with CNC programming to create large radius arcs through multiple small incremental bends (approximating the arc with linear segments). Dedicated radius tooling uses specially profiled punches and dies to create smooth radius bends in a single operation. Bump forming is cost-effective for occasional large radius work, while dedicated radius tooling provides superior surface finish and faster production for regular radius bending applications.": "Beim Bump-Forming werden Standard-V-Matrizen und -Stempel mit CNC-Programmierung verwendet, um Bögen mit großem Radius durch mehrere kleine inkrementelle Biegungen zu erzeugen (Annäherung des Bogens an lineare Segmente). ",
  "Use urethane dies when bending pre-finished, pre-painted, or polished materials where surface marking is unacceptable. Urethane provides mar-free bending ideal for architectural panels, appliances, decorative metalwork, and any application where surface quality is critical. Steel dies are preferred for higher production volumes, harder materials, or when surface marking isn't a concern. Hybrid steel-urethane combines both benefits.": "Verwenden Sie Urethan-Matrizen, wenn Sie vorgefertigte, vorlackierte oder polierte Materialien biegen, bei denen Oberflächenmarkierungen nicht akzeptabel sind. ",
  "The punch radius should be at least 63% of material thickness to prevent stress concentration. For air bending, the internal radius forms at approximately 15-20% of the V-die opening width. Match your punch tip radius to the natural internal radius created by the die opening for consistent angles. Consider material springback (stainless steel requires 1-2° compensation). Consult our technical team with your material specifications for optimal radius selection.": "Der Stempelradius sollte mindestens 63 % der Materialstärke betragen, um Spannungskonzentrationen zu vermeiden. ",
  "Yes, we specialize in custom radius tooling for unique applications. Provide your required radius dimensions, material specifications, production volume, and part drawings. Our engineering team will design custom arc molds optimized for your specific application. Custom tooling is particularly cost-effective for high-volume production runs requiring consistent radius specifications not available in standard tooling catalogs.": "Ja, wir sind auf kundenspezifische Radiuswerkzeuge für einzigartige Anwendungen spezialisiert. ",
  "Maximum achievable radius depends on press brake table width and tooling system. Standard radius punches typically range from R5 to R100mm. Large radius tooling systems can achieve R120-R200mm. For radii exceeding these limits, bump forming can create virtually any radius through programmed multi-step bending. Large radius applications may require specialized extended-reach tooling or custom engineered solutions.": "Der maximal erreichbare Radius hängt von der Tischbreite der Abkantpresse und dem Werkzeugsystem ab. ",
  "Springback increases with material hardness and decreases with larger bend radius. To minimize springback: use properly matched punch radius (63% minimum of material thickness), apply sufficient tonnage for bottom bending rather than air bending, compensate bend angle 1-2° for stainless steel, use larger die opening to reduce stress, and consider coining for zero springback applications. Material-specific springback tables help predict and compensate for springback in production.": "Die Rückfederung nimmt mit zunehmender Materialhärte zu und mit größerem Biegeradius ab. ",
  "Have a radius tooling question?": "Haben Sie eine Frage zu Radiuswerkzeugen?",
  "Download Arc Mold Catalog": "Laden Sie den Arc Mould-Katalog herunter",
  "Get comprehensive technical specifications, radius charts, material options, and application guides for our complete range of arc mold and radius bending tooling.": "Erhalten Sie umfassende technische Spezifikationen, Radiustabellen, Materialoptionen und Anwendungsleitfäden für unser komplettes Sortiment an Lichtbogenform- und Radiusbiegewerkzeugen."
}