{
  "Gooseneck Scimitar Punch": "Poinçon cimeterre à col de cygne",
  "Advanced gooseneck scimitar punch combining deep relief clearance with offset profile geometry. Engineered for complex box forming, return flanging, and channel bending operations where standard punches cause interference. Precision-machined from heat-treated alloy steel for exceptional durability.": "Poinçon cimeterre à col de cygne avancé combinant un dégagement en relief profond avec une géométrie de profil décalée. ",
  "Request Quote": "Demander un devis",
  "Learn More": "Apprendre encore plus",
  "Technical Specifications": "Spécifications techniques",
  "Specialized gooseneck scimitar tooling for return flanging and deep box forming on CNC press brakes": "Outillage de cimeterre à col de cygne spécialisé pour le bridage de retour et le formage de boîtes profondes sur les presses plieuses CNC",
  "Material & Heat Treatment": "Matériau et traitement thermique",
  "Material: 42CrMo, T10A, Cr12MoV steel": "Matériau : acier 42CrMo, T10A, Cr12MoV",
  "Quenching Hardness: HRC 47±2": "Dureté de trempe : HRC 47 ± 2",
  "Optional: Induction hardening or Nitrex® treatment": "En option : Trempe par induction ou traitement Nitrex®",
  "Surface Finish: Precision ground and polished": "Finition de surface : rectifiée et polie avec précision",
  "Punch Configuration": "Configuration du pointage",
  "Profile: Gooseneck with scimitar offset": "Profil : Col de cygne avec déport cimeterre",
  "Relief Depth: Custom per application": "Profondeur du relief : personnalisée par application",
  "Return Flange Capacity: Variable length": "Capacité de la bride de retour : longueur variable",
  "Standard Lengths: 500mm, 835mm, custom": "Longueurs standard : 500 mm, 835 mm, sur mesure",
  "Mounting Compatibility": "Compatibilité de montage",
  "American Standard (Planed/Machined)": "Norme américaine (raboté/usiné)",
  "European Standard (Wila, Amada, Trumpf)": "Norme européenne (Wila, Amada, Trumpf)",
  "Quick-change systems compatible": "Compatible avec les systèmes de changement rapide",
  "Custom mounting upon request": "Montage personnalisé sur demande",
  "Why Choose Gooseneck Scimitar Punches?": "Pourquoi choisir les poinçons cimeterre à col de cygne ?",
  "Specialized tooling engineered to solve complex bending challenges where standard punches fail due to interference with existing flanges and deep box geometries": "Outillage spécialisé conçu pour résoudre les problèmes de pliage complexes où les poinçons standard échouent en raison d'interférences avec les brides existantes et les géométries des boîtes profondes.",
  "Interference-Free Bending": "Pliage sans interférence",
  "Deep relief gooseneck design provides clearance for existing flanges, enabling complex multi-bend operations without tool interference": "La conception à col de cygne à dégagement profond offre un dégagement pour les brides existantes, permettant des opérations complexes à plusieurs cintrages sans interférence avec l'outil",
  "Return Flange Specialist": "Spécialiste des brides de retour",
  "Specifically engineered for forming channels and parts with return flanges in two strokes, ideal for door frames and box assemblies": "Spécialement conçu pour former des canaux et des pièces avec des brides de retour en deux temps, idéal pour les cadres de portes et les assemblages de caissons",
  "Offset Scimitar Profile": "Profil de cimeterre décalé",
  "Scimitar offset geometry enables complex channel formations and deep box work that standard straight punches cannot achieve": "La géométrie décalée Scimitar permet des formations de canaux complexes et des travaux de boîtes profondes que les poinçons droits standards ne peuvent pas réaliser",
  "Right Angle Precision": "Précision à angle droit",
  "Forms precise 90° right angle bends in channels and U-profiles where conventional tooling would cause material deformation": "Forme des courbures précises à angle droit de 90° dans les canaux et les profils en U là où un outillage conventionnel provoquerait une déformation du matériau.",
  "Extended Tool Life": "Durée de vie prolongée de l'outil",
  "Heat-treated alloy steel construction with HRC 47±2 hardness ensures superior wear resistance and long service life": "Construction en alliage d'acier traité thermiquement avec une dureté HRC 47 ± 2 pour une résistance supérieure à l'usure et une longue durée de vie.",
  "Increased Productivity": "Productivité accrue",
  "Eliminates secondary operations and complex fixturing, reducing setup time and increasing throughput for box and channel production": "Élimine les opérations secondaires et les montages complexes, réduisant ainsi le temps de configuration et augmentant le débit pour la production de boîtes et de canaux",
  "Gooseneck Tooling Variations": "Variations d'outillage à col de cygne",
  "Comprehensive range of gooseneck and offset punch configurations for diverse return flanging and box forming applications": "Gamme complète de configurations de cols de cygne et de poinçons décalés pour diverses applications de bridage à retour et de formage de boîtes",
  "Standard Gooseneck Punch": "Poinçon col de cygne standard",
  "Traditional gooseneck design with deep relief for channel forming and return flanging. Features symmetric profile optimized for right angle bends. Available in various throat depths and face widths to accommodate different flange lengths. Hardened to HRC 47±2 for durability. Ideal for standard box and pan forming operations requiring interference clearance.": "Conception traditionnelle à col de cygne avec un relief profond pour la formation de canaux et le bridage de retour. ",
  "Gooseneck Scimitar Combination": "Combinaison cimeterre à col de cygne",
  "Advanced hybrid design combining gooseneck deep relief with scimitar offset profile. Provides exceptional clearance for complex multi-bend operations where both depth and offset are required. Enables formation of deep channels with return flanges in confined geometries. Custom engineered for specialized box forming and container manufacturing applications.": "Conception hybride avancée combinant un relief profond en col de cygne et un profil décalé en cimeterre. ",
  "Offset Saber Punch": "Poinçon Sabre Décalé",
  "Specialized offset punch with saber/scimitar profile for creating Z-bends and offset flanges. Forms two parallel bends in single operation with guaranteed parallelism. Ideal for overlapped assemblies and joining applications. Available in various offset distances and bend angles. Precision ground surfaces ensure consistent repeatability.": "Poinçon offset spécialisé avec profil sabre/cimeterre pour créer des coudes en Z et des brides décalées. ",
  "Acute Angle Gooseneck": "Col de cygne à angle aigu",
  "Gooseneck punch with acute angle tip (30°, 45°, 60°) for specialized applications requiring sharp bends with deep relief clearance. Commonly used for hemming operations, acute channels, and specialized box corners. Compatible with standard V-dies. Heat-treated for edge retention on sharp tip geometry.": "Poinçon col de cygne avec pointe à angle aigu (30°, 45°, 60°) pour les applications spécialisées nécessitant des courbures prononcées avec un dégagement de dépouille profond. ",
  "Variable Relief Gooseneck": "Col de cygne à soulagement variable",
  "Adjustable gooseneck system allowing variable throat depth for different return flange lengths without tooling changes. Modular design accommodates multiple flange dimensions. Quick-change components reduce setup time for job shops. Provides versatility for low to medium volume production with varying flange requirements.": "Système de col de cygne réglable permettant une profondeur de gorge variable pour différentes longueurs de bride de retour sans changement d'outillage. ",
  "Custom Profile Gooseneck": "Col de cygne à profil personnalisé",
  "Engineered custom gooseneck profiles for specialized applications requiring unique geometries. Designed to customer specifications based on part drawings and production requirements. Can incorporate radius bends, compound angles, or specialized clearance features. Ideal for high-volume production of proprietary box and channel designs.": "Profils de col de cygne personnalisés pour les applications spécialisées nécessitant des géométries uniques. ",
  "Gooseneck Tooling in Action": "L'outillage à col de cygne en action",
  "See how gooseneck scimitar punches solve complex bending challenges for box and channel forming": "Découvrez comment les poinçons cimeterre à col de cygne résolvent les problèmes de pliage complexes pour le formage de boîtes et de canaux.",
  "Applications": "Applications",
  "Gooseneck scimitar punches solve complex forming challenges across diverse industries requiring return flanges and deep box geometries": "Les poinçons cimeterre à col de cygne résolvent des problèmes de formage complexes dans diverses industries nécessitant des brides de retour et des géométries de boîtes profondes.",
  "Box & Pan Forming": "Formage de boîtes et de poêles",
  "Manufacturing deep boxes, pans, and containers requiring multiple bends with return flanges and tight internal geometries": "Fabrication de boîtes profondes, de casseroles et de conteneurs nécessitant plusieurs courbures avec des brides de retour et des géométries internes serrées",
  "Door Frame Manufacturing": "Fabrication de cadres de porte",
  "Forming door frames, window frames, and architectural profiles with return flanges for structural rigidity": "Former des cadres de portes, des cadres de fenêtres et des profilés architecturaux avec des brides de retour pour une rigidité structurelle",
  "Channel & U-Profile Bending": "Cintrage des canaux et des profils en U",
  "Creating channels, U-profiles, and C-sections in two strokes with precise right angle bends": "Création de canaux, de profils en U et de sections en C en deux temps avec des coudes précis à angle droit",
  "Electronics Enclosures": "Boîtiers électroniques",
  "Fabricating server racks, control cabinets, and electrical enclosures with complex flange requirements": "Fabrication de racks de serveurs, d'armoires de commande et de boîtiers électriques avec des exigences de brides complexes",
  "HVAC Equipment": "Équipement CVC",
  "Manufacturing ductwork transitions, air handler housings, and ventilation components with return flanges": "Fabrication de transitions de conduits, de boîtiers de centrale de traitement d'air et de composants de ventilation avec brides de retour",
  "Industrial Containers": "Conteneurs industriels",
  "Producing storage containers, parts bins, and industrial trays with reinforced return flange edges": "Production de conteneurs de stockage, de bacs à pièces et de plateaux industriels avec bords de bride de retour renforcés",
  "Automotive Components": "Composants automobiles",
  "Forming structural channels, brackets, and reinforcement members requiring deep relief clearance": "Formation de canaux structurels, de supports et d'éléments de renforcement nécessitant un dégagement en relief profond",
  "Appliance Manufacturing": "Fabrication d'appareils électroménagers",
  "Creating appliance panels, housings, and structural components with complex flange geometries": "Création de panneaux d'appareils, de boîtiers et de composants structurels avec des géométries de brides complexes",
  "Standard & Custom Tooling": "Outillage standard et personnalisé",
  "Standard gooseneck configurations with optional custom profiles for specialized return flanging applications": "Configurations standard à col de cygne avec profils personnalisés en option pour les applications spécialisées de brides de retour",
  "Custom Upgrades": "Mises à niveau personnalisées",
  "Need custom gooseneck tooling for your application?": "Besoin d'un outillage col de cygne personnalisé pour votre application ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about gooseneck and scimitar press brake tooling": "Questions courantes sur les outils de presse plieuse à col de cygne et à cimeterre",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing the punch from hitting previously formed flanges, making them essential for box forming, door frames, and channel bending applications.": "Un poinçon à col de cygne présente une conception en relief profond (profil décalé) qui offre un dégagement pour les brides existantes et les géométries de boîtes profondes. ",
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both deep relief clearance and offset capability for the most challenging box and channel forming operations.": "« Cimeterre » ou « sabre » fait référence à une conception de profil incurvé et décalé similaire à la lame incurvée d'une épée cimeterre. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and face width for your application.": "La profondeur de la gorge doit être déterminée par la longueur de la bride de retour que vous devez former. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending operations where deep relief clearance is required. These combine the interference-free benefits of gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming tooling.": "Oui, les poinçons à col de cygne à angle aigu (30°, 45°, 60°) sont spécialement conçus pour les opérations d'ourlage et de pliage aigu où un dégagement profond est requis. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface hardness while maintaining core toughness.": "Les poinçons à col de cygne standard sont fabriqués à partir d'acier allié T10A, 42CrMo ou Cr12MoV avec une dureté de trempe de HRC 47±2. ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications. Provide part drawings showing flange dimensions, bend angles, material specifications, and production volume. Our engineering team will design custom gooseneck tooling optimized for your specific application, including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "Absolument. ",
  "Have a gooseneck tooling question?": "Vous avez une question sur l'outillage à col de cygne ?",
  "Download Gooseneck Tooling Guide": "Télécharger le guide d'outillage col de cygne",
  "Get comprehensive technical specifications, throat depth selection charts, application guides, and dimensional drawings for our complete range of gooseneck and scimitar press brake tooling.": "Obtenez des spécifications techniques complètes, des tableaux de sélection de profondeur de gorge, des guides d'application et des dessins dimensionnels pour notre gamme complète d'outils de presse plieuse à col de cygne et à cimeterre."
}