{
  "Gooseneck Scimitar Punch": "Puñetazo de cimitarra de cuello de cisne",
  "Advanced gooseneck scimitar punch combining deep relief clearance with offset profile geometry. Engineered for complex box forming, return flanging, and channel bending operations where standard punches cause interference. Precision-machined from heat-treated alloy steel for exceptional durability.": "Puñetazo de cimitarra con cuello de cisne avanzado que combina un espacio de relieve profundo con una geometría de perfil desplazada. ",
  "Request Quote": "Solicitar Cotización",
  "Learn More": "Más información",
  "Technical Specifications": "Especificaciones técnicas",
  "Specialized gooseneck scimitar tooling for return flanging and deep box forming on CNC press brakes": "Herramientas de cimitarra de cuello de cisne especializadas para bridas de retorno y formación de cajas profundas en plegadoras CNC",
  "Material & Heat Treatment": "Tratamiento térmico y de materiales",
  "Material: 42CrMo, T10A, Cr12MoV steel": "Material: acero 42CrMo, T10A, Cr12MoV",
  "Quenching Hardness: HRC 47±2": "Dureza de enfriamiento: HRC 47±2",
  "Optional: Induction hardening or Nitrex® treatment": "Opcional: endurecimiento por inducción o tratamiento Nitrex®",
  "Surface Finish: Precision ground and polished": "Acabado de la superficie: rectificado y pulido con precisión",
  "Punch Configuration": "Configuración de perforación",
  "Profile: Gooseneck with scimitar offset": "Perfil: cuello de cisne con desplazamiento de cimitarra",
  "Relief Depth: Custom per application": "Profundidad de relieve: personalizado por aplicación",
  "Return Flange Capacity: Variable length": "Capacidad de brida de retorno: longitud variable",
  "Standard Lengths: 500mm, 835mm, custom": "Longitudes estándar: 500 mm, 835 mm, personalizadas",
  "Mounting Compatibility": "Compatibilidad de montaje",
  "American Standard (Planed/Machined)": "Estándar americano (cepillado/mecanizado)",
  "European Standard (Wila, Amada, Trumpf)": "Estándar europeo (Wila, Amada, Trumpf)",
  "Quick-change systems compatible": "Compatible con sistemas de cambio rápido",
  "Custom mounting upon request": "Montaje personalizado bajo pedido",
  "Why Choose Gooseneck Scimitar Punches?": "¿Por qué elegir los punzones de cimitarra con cuello de cisne?",
  "Specialized tooling engineered to solve complex bending challenges where standard punches fail due to interference with existing flanges and deep box geometries": "Herramientas especializadas diseñadas para resolver desafíos complejos de flexión donde los punzones estándar fallan debido a la interferencia con bridas existentes y geometrías de caja profunda.",
  "Interference-Free Bending": "Doblado sin interferencias",
  "Deep relief gooseneck design provides clearance for existing flanges, enabling complex multi-bend operations without tool interference": "El diseño de cuello de cisne de relieve profundo proporciona espacio para las bridas existentes, lo que permite operaciones complejas de múltiples curvaturas sin interferencia de herramientas.",
  "Return Flange Specialist": "Especialista en bridas de retorno",
  "Specifically engineered for forming channels and parts with return flanges in two strokes, ideal for door frames and box assemblies": "Diseñado específicamente para formar canales y piezas con bridas de retorno en dos tiempos, ideal para marcos de puertas y conjuntos de cajas.",
  "Offset Scimitar Profile": "Perfil de cimitarra compensada",
  "Scimitar offset geometry enables complex channel formations and deep box work that standard straight punches cannot achieve": "La geometría desplazada de cimitarra permite formaciones de canales complejas y trabajos de caja profunda que los punzones rectos estándar no pueden lograr.",
  "Right Angle Precision": "Precisión de ángulo recto",
  "Forms precise 90° right angle bends in channels and U-profiles where conventional tooling would cause material deformation": "Forma curvas precisas en ángulo recto de 90° en canales y perfiles en U donde las herramientas convencionales causarían deformación del material.",
  "Extended Tool Life": "Vida útil extendida de la herramienta",
  "Heat-treated alloy steel construction with HRC 47±2 hardness ensures superior wear resistance and long service life": "La construcción de acero de aleación tratado térmicamente con dureza HRC 47±2 garantiza una resistencia superior al desgaste y una larga vida útil.",
  "Increased Productivity": "Mayor productividad",
  "Eliminates secondary operations and complex fixturing, reducing setup time and increasing throughput for box and channel production": "Elimina operaciones secundarias y accesorios complejos, lo que reduce el tiempo de configuración y aumenta el rendimiento de la producción de cajas y canales.",
  "Gooseneck Tooling Variations": "Variaciones de herramientas de cuello de cisne",
  "Comprehensive range of gooseneck and offset punch configurations for diverse return flanging and box forming applications": "Amplia gama de configuraciones de punzones con cuello de cisne y desplazados para diversas aplicaciones de formación de cajas y bridas de retorno",
  "Standard Gooseneck Punch": "Punzón de cuello de cisne estándar",
  "Traditional gooseneck design with deep relief for channel forming and return flanging. Features symmetric profile optimized for right angle bends. Available in various throat depths and face widths to accommodate different flange lengths. Hardened to HRC 47±2 for durability. Ideal for standard box and pan forming operations requiring interference clearance.": "Diseño tradicional de cuello de cisne con relieve profundo para la formación de canales y bridas de retorno. ",
  "Gooseneck Scimitar Combination": "Combinación de cimitarra de cuello de cisne",
  "Advanced hybrid design combining gooseneck deep relief with scimitar offset profile. Provides exceptional clearance for complex multi-bend operations where both depth and offset are required. Enables formation of deep channels with return flanges in confined geometries. Custom engineered for specialized box forming and container manufacturing applications.": "Diseño híbrido avanzado que combina un relieve profundo de cuello de cisne con un perfil desplazado de cimitarra. ",
  "Offset Saber Punch": "Puñetazo de sable compensado",
  "Specialized offset punch with saber/scimitar profile for creating Z-bends and offset flanges. Forms two parallel bends in single operation with guaranteed parallelism. Ideal for overlapped assemblies and joining applications. Available in various offset distances and bend angles. Precision ground surfaces ensure consistent repeatability.": "Punzón desplazado especializado con perfil de sable/cimitarra para crear curvas en Z y bridas desplazadas. ",
  "Acute Angle Gooseneck": "Cuello de cisne de ángulo agudo",
  "Gooseneck punch with acute angle tip (30°, 45°, 60°) for specialized applications requiring sharp bends with deep relief clearance. Commonly used for hemming operations, acute channels, and specialized box corners. Compatible with standard V-dies. Heat-treated for edge retention on sharp tip geometry.": "Punzón de cuello de cisne con punta de ángulo agudo (30°, 45°, 60°) para aplicaciones especializadas que requieren curvas pronunciadas con espacio de relieve profundo. ",
  "Variable Relief Gooseneck": "Cuello de cisne con relieve variable",
  "Adjustable gooseneck system allowing variable throat depth for different return flange lengths without tooling changes. Modular design accommodates multiple flange dimensions. Quick-change components reduce setup time for job shops. Provides versatility for low to medium volume production with varying flange requirements.": "Sistema de cuello de cisne ajustable que permite una profundidad de garganta variable para diferentes longitudes de brida de retorno sin cambios de herramientas. ",
  "Custom Profile Gooseneck": "Cuello de cisne de perfil personalizado",
  "Engineered custom gooseneck profiles for specialized applications requiring unique geometries. Designed to customer specifications based on part drawings and production requirements. Can incorporate radius bends, compound angles, or specialized clearance features. Ideal for high-volume production of proprietary box and channel designs.": "Perfiles de cuello de cisne personalizados diseñados para aplicaciones especializadas que requieren geometrías únicas. ",
  "Gooseneck Tooling in Action": "Herramientas de cuello de cisne en acción",
  "See how gooseneck scimitar punches solve complex bending challenges for box and channel forming": "Vea cómo los punzones de cimitarra con cuello de cisne resuelven desafíos complejos de doblado para la formación de cajas y canales.",
  "Applications": "Aplicaciones",
  "Gooseneck scimitar punches solve complex forming challenges across diverse industries requiring return flanges and deep box geometries": "Los punzones de cimitarra con cuello de cisne resuelven desafíos de conformado complejos en diversas industrias que requieren bridas de retorno y geometrías de caja profunda",
  "Box & Pan Forming": "Formado de cajas y bandejas",
  "Manufacturing deep boxes, pans, and containers requiring multiple bends with return flanges and tight internal geometries": "Fabricación de cajas, bandejas y contenedores profundos que requieren múltiples curvaturas con bridas de retorno y geometrías internas ajustadas.",
  "Door Frame Manufacturing": "Fabricación de marcos de puertas",
  "Forming door frames, window frames, and architectural profiles with return flanges for structural rigidity": "Formar marcos de puertas, marcos de ventanas y perfiles arquitectónicos con bridas de retorno para rigidez estructural",
  "Channel & U-Profile Bending": "Doblado de canales y perfiles en U",
  "Creating channels, U-profiles, and C-sections in two strokes with precise right angle bends": "Creación de canales, perfiles en U y secciones en C en dos pasadas con curvaturas precisas en ángulo recto",
  "Electronics Enclosures": "Cajas electrónicas",
  "Fabricating server racks, control cabinets, and electrical enclosures with complex flange requirements": "Fabricación de bastidores de servidores, gabinetes de control y gabinetes eléctricos con requisitos de bridas complejos",
  "HVAC Equipment": "Equipos de climatización",
  "Manufacturing ductwork transitions, air handler housings, and ventilation components with return flanges": "Fabricación de transiciones de conductos, carcasas de controladores de aire y componentes de ventilación con bridas de retorno.",
  "Industrial Containers": "Contenedores Industriales",
  "Producing storage containers, parts bins, and industrial trays with reinforced return flange edges": "Producción de contenedores de almacenamiento, contenedores de piezas y bandejas industriales con bordes de brida de retorno reforzados.",
  "Automotive Components": "Componentes automotrices",
  "Forming structural channels, brackets, and reinforcement members requiring deep relief clearance": "Formar canales estructurales, soportes y miembros de refuerzo que requieren un espacio de relieve profundo.",
  "Appliance Manufacturing": "Fabricación de electrodomésticos",
  "Creating appliance panels, housings, and structural components with complex flange geometries": "Creación de paneles de electrodomésticos, carcasas y componentes estructurales con geometrías de bridas complejas",
  "Standard & Custom Tooling": "Herramientas estándar y personalizadas",
  "Standard gooseneck configurations with optional custom profiles for specialized return flanging applications": "Configuraciones de cuello de cisne estándar con perfiles personalizados opcionales para aplicaciones especializadas de bridas de retorno",
  "Custom Upgrades": "Actualizaciones personalizadas",
  "Need custom gooseneck tooling for your application?": "¿Necesita herramientas de cuello de cisne personalizadas para su aplicación?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about gooseneck and scimitar press brake tooling": "Preguntas comunes sobre herramientas plegadoras de cuello de cisne y cimitarra",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing the punch from hitting previously formed flanges, making them essential for box forming, door frames, and channel bending applications.": "Un punzón de cuello de cisne presenta un diseño de relieve profundo (perfil desplazado) que proporciona espacio para bridas existentes y geometrías de caja profunda. ",
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both deep relief clearance and offset capability for the most challenging box and channel forming operations.": "\"Cimitarra\" o \"sable\" se refiere a un diseño de perfil curvo y desplazado similar a la hoja curva de una espada cimitarra. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and face width for your application.": "La profundidad de la garganta debe estar determinada por la longitud de la brida de retorno que necesita formar. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending operations where deep relief clearance is required. These combine the interference-free benefits of gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming tooling.": "Sí, los punzones de cuello de cisne de ángulo agudo (30°, 45°, 60°) están diseñados específicamente para operaciones de doblado y doblado agudo donde se requiere un espacio de alivio profundo. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface hardness while maintaining core toughness.": "Los punzones de cuello de cisne estándar se fabrican con acero de aleación T10A, 42CrMo o Cr12MoV con una dureza de enfriamiento de HRC 47±2. ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications. Provide part drawings showing flange dimensions, bend angles, material specifications, and production volume. Our engineering team will design custom gooseneck tooling optimized for your specific application, including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "Absolutamente. ",
  "Have a gooseneck tooling question?": "¿Tiene alguna pregunta sobre herramientas de cuello de cisne?",
  "Download Gooseneck Tooling Guide": "Descargar la guía de herramientas de cuello de cisne",
  "Get comprehensive technical specifications, throat depth selection charts, application guides, and dimensional drawings for our complete range of gooseneck and scimitar press brake tooling.": "Obtenga especificaciones técnicas completas, tablas de selección de profundidad de garganta, guías de aplicación y dibujos dimensionales para nuestra gama completa de herramientas plegadoras de cimitarra y cuello de cisne."
}