{
  "Gooseneck Scimitar Punch": "グースネックシミターパンチ",
  "Advanced gooseneck scimitar punch combining deep relief clearance with offset profile geometry. Engineered for complex box forming, return flanging, and channel bending operations where standard punches cause interference. Precision-machined from heat-treated alloy steel for exceptional durability.": "深いレリーフクリアランスとオフセットプロファイル形状を組み合わせた高度なグースネックシミターパンチ。",
  "Request Quote": "見積依頼",
  "Learn More": "もっと詳しく知る",
  "Technical Specifications": "技術仕様",
  "Specialized gooseneck scimitar tooling for return flanging and deep box forming on CNC press brakes": "CNC プレス ブレーキでのリターン フランジ加工とディープ ボックス成形用の特殊なグースネック シミター ツール",
  "Material & Heat Treatment": "材料と熱処理",
  "Material: 42CrMo, T10A, Cr12MoV steel": "材質: 42CrMo、T10A、Cr12MoV スチール",
  "Quenching Hardness: HRC 47±2": "焼入硬度：HRC 47±2",
  "Optional: Induction hardening or Nitrex® treatment": "オプション: 高周波焼き入れまたは Nitrex® 処理",
  "Surface Finish: Precision ground and polished": "表面仕上げ: 精密研磨および研磨",
  "Punch Configuration": "パンチの構成",
  "Profile: Gooseneck with scimitar offset": "プロフィール: シミターオフセット付きグースネック",
  "Relief Depth: Custom per application": "逃げの深さ: アプリケーションごとにカスタム",
  "Return Flange Capacity: Variable length": "リターンフランジ容量:可変長",
  "Standard Lengths: 500mm, 835mm, custom": "標準長さ: 500mm、835mm、カスタム",
  "Mounting Compatibility": "取付互換性",
  "American Standard (Planed/Machined)": "アメリカ規格（カンナ仕上げ/機械加工）",
  "European Standard (Wila, Amada, Trumpf)": "欧州規格 (Wila、Amada、Trumpf)",
  "Quick-change systems compatible": "クイックチェンジシステム対応",
  "Custom mounting upon request": "ご要望に応じてカスタム取り付け",
  "Why Choose Gooseneck Scimitar Punches?": "グースネックシミターパンチを選ぶ理由?",
  "Specialized tooling engineered to solve complex bending challenges where standard punches fail due to interference with existing flanges and deep box geometries": "既存のフランジや深いボックスの形状との干渉により標準のパンチが機能しない複雑な曲げの課題を解決するために設計された特殊なツール",
  "Interference-Free Bending": "干渉のない曲げ",
  "Deep relief gooseneck design provides clearance for existing flanges, enabling complex multi-bend operations without tool interference": "深い逃げのグースネック設計により、既存のフランジにクリアランスが提供され、工具の干渉なしに複雑な複数の曲げ操作が可能になります",
  "Return Flange Specialist": "リターンフランジスペシャリスト",
  "Specifically engineered for forming channels and parts with return flanges in two strokes, ideal for door frames and box assemblies": "2 ストロークでリターン フランジを備えたチャネルと部品を形成するために特別に設計されており、ドア フレームやボックス アセンブリに最適です",
  "Offset Scimitar Profile": "オフセットシミタープロファイル",
  "Scimitar offset geometry enables complex channel formations and deep box work that standard straight punches cannot achieve": "シミターのオフセット形状により、標準のストレートパンチでは実現できない複雑なチャネル形成と深いボックス加工が可能になります",
  "Right Angle Precision": "直角精度",
  "Forms precise 90° right angle bends in channels and U-profiles where conventional tooling would cause material deformation": "従来のツールでは材料の変形が発生するチャネルや U プロファイルに、正確な 90° の直角曲げを形成します。",
  "Extended Tool Life": "工具寿命の延長",
  "Heat-treated alloy steel construction with HRC 47±2 hardness ensures superior wear resistance and long service life": "HRC 47±2 硬度の熱処理合金鋼構造により、優れた耐摩耗性と長寿命を保証します。",
  "Increased Productivity": "生産性の向上",
  "Eliminates secondary operations and complex fixturing, reducing setup time and increasing throughput for box and channel production": "二次的な作業と複雑な治具を排除し、セットアップ時間を短縮し、ボックスとチャネルの生産のスループットを向上させます。",
  "Gooseneck Tooling Variations": "グースネックツーリングのバリエーション",
  "Comprehensive range of gooseneck and offset punch configurations for diverse return flanging and box forming applications": "さまざまな戻りフランジ加工やボックス成形用途に対応する、グースネックおよびオフセット パンチ構成の包括的なラインナップ",
  "Standard Gooseneck Punch": "スタンダードグースネックパンチ",
  "Traditional gooseneck design with deep relief for channel forming and return flanging. Features symmetric profile optimized for right angle bends. Available in various throat depths and face widths to accommodate different flange lengths. Hardened to HRC 47±2 for durability. Ideal for standard box and pan forming operations requiring interference clearance.": "チャンネル形成と戻りフランジ加工のための深いレリーフを備えた伝統的なグースネック設計。",
  "Gooseneck Scimitar Combination": "グースネックシミターコンビネーション",
  "Advanced hybrid design combining gooseneck deep relief with scimitar offset profile. Provides exceptional clearance for complex multi-bend operations where both depth and offset are required. Enables formation of deep channels with return flanges in confined geometries. Custom engineered for specialized box forming and container manufacturing applications.": "グースネックの深いレリーフとシミターのオフセットプロファイルを組み合わせた高度なハイブリッドデザイン。",
  "Offset Saber Punch": "オフセットサーベルパンチ",
  "Specialized offset punch with saber/scimitar profile for creating Z-bends and offset flanges. Forms two parallel bends in single operation with guaranteed parallelism. Ideal for overlapped assemblies and joining applications. Available in various offset distances and bend angles. Precision ground surfaces ensure consistent repeatability.": "Z ベンドとオフセット フランジを作成するための、サーベル/シミター プロファイルを備えた特殊なオフセット パンチ。",
  "Acute Angle Gooseneck": "鋭角グースネック",
  "Gooseneck punch with acute angle tip (30°, 45°, 60°) for specialized applications requiring sharp bends with deep relief clearance. Commonly used for hemming operations, acute channels, and specialized box corners. Compatible with standard V-dies. Heat-treated for edge retention on sharp tip geometry.": "深い逃げクリアランスを持つ鋭い曲げを必要とする特殊用途向けの鋭角チップ (30°、45°、60°) を備えたグースネック パンチ。",
  "Variable Relief Gooseneck": "可変リリーフグースネック",
  "Adjustable gooseneck system allowing variable throat depth for different return flange lengths without tooling changes. Modular design accommodates multiple flange dimensions. Quick-change components reduce setup time for job shops. Provides versatility for low to medium volume production with varying flange requirements.": "調節可能なグースネックシステムにより、工具を変更することなく、さまざまなリターンフランジの長さに合わせてスロートの深さを変更できます。",
  "Custom Profile Gooseneck": "カスタムプロファイルグースネック",
  "Engineered custom gooseneck profiles for specialized applications requiring unique geometries. Designed to customer specifications based on part drawings and production requirements. Can incorporate radius bends, compound angles, or specialized clearance features. Ideal for high-volume production of proprietary box and channel designs.": "独自の形状を必要とする特殊な用途向けにカスタム グースネック プロファイルを設計しました。",
  "Gooseneck Tooling in Action": "動作中のグースネックツール",
  "See how gooseneck scimitar punches solve complex bending challenges for box and channel forming": "グースネックシミターパンチがボックスやチャンネルの成形における複雑な曲げの課題をどのように解決するかをご覧ください。",
  "Applications": "アプリケーション",
  "Gooseneck scimitar punches solve complex forming challenges across diverse industries requiring return flanges and deep box geometries": "グースネックシミターパンチは、リターンフランジとディープボックス形状を必要とするさまざまな業界にわたる複雑な成形の課題を解決します",
  "Box & Pan Forming": "ボックス＆パンフォーミング",
  "Manufacturing deep boxes, pans, and containers requiring multiple bends with return flanges and tight internal geometries": "戻りフランジとタイトな内部形状を備えた複数の曲げが必要な深い箱、パン、コンテナの製造",
  "Door Frame Manufacturing": "ドア枠の製造",
  "Forming door frames, window frames, and architectural profiles with return flanges for structural rigidity": "構造的剛性を高めるためのリターン フランジを備えたドア枠、窓枠、建築プロファイルの形成",
  "Channel & U-Profile Bending": "チャネルと U プロファイルの曲げ",
  "Creating channels, U-profiles, and C-sections in two strokes with precise right angle bends": "正確な直角曲げによる 2 ストロークでのチャネル、U プロファイル、C セクションの作成",
  "Electronics Enclosures": "電子機器の筐体",
  "Fabricating server racks, control cabinets, and electrical enclosures with complex flange requirements": "複雑なフランジ要件を備えたサーバー ラック、制御キャビネット、電気エンクロージャの製造",
  "HVAC Equipment": "空調設備",
  "Manufacturing ductwork transitions, air handler housings, and ventilation components with return flanges": "ダクト移行部、エアハンドラーハウジング、リターンフランジ付き換気コンポーネントの製造",
  "Industrial Containers": "産業用コンテナ",
  "Producing storage containers, parts bins, and industrial trays with reinforced return flange edges": "強化されたリターンフランジエッジを備えた保管コンテナ、部品箱、工業用トレイの製造",
  "Automotive Components": "自動車部品",
  "Forming structural channels, brackets, and reinforcement members requiring deep relief clearance": "深いリリーフクリアランスを必要とする構造チャネル、ブラケット、補強部材の形成",
  "Appliance Manufacturing": "家電製品の製造",
  "Creating appliance panels, housings, and structural components with complex flange geometries": "複雑なフランジ形状を備えたアプライアンス パネル、ハウジング、構造コンポーネントの作成",
  "Standard & Custom Tooling": "標準およびカスタム ツール",
  "Standard gooseneck configurations with optional custom profiles for specialized return flanging applications": "特殊な戻りフランジ加工用途向けのオプションのカスタム プロファイルを備えた標準グースネック構成",
  "Custom Upgrades": "カスタムアップグレード",
  "Need custom gooseneck tooling for your application?": "アプリケーションにカスタムのグースネック ツールが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about gooseneck and scimitar press brake tooling": "グースネックおよびシミター プレス ブレーキ ツールに関するよくある質問",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing the punch from hitting previously formed flanges, making them essential for box forming, door frames, and channel bending applications.": "グースネック パンチは、既存のフランジや深いボックス形状にクリアランスを提供する深いレリーフ設計 (オフセット プロファイル) を特徴としています。",
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both deep relief clearance and offset capability for the most challenging box and channel forming operations.": "「シミター」または「サーベル」は、シミター剣の湾曲した刃に似た、オフセットされた湾曲した輪郭デザインを指します。",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and face width for your application.": "スロートの深さは、形成する必要があるリターン フランジの長さによって決定する必要があります。",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending operations where deep relief clearance is required. These combine the interference-free benefits of gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming tooling.": "はい、鋭角グースネック パンチ (30°、45°、60°) は、深い逃げクリアランスが必要なヘミング加工や鋭角曲げ加工用に特別に設計されています。",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface hardness while maintaining core toughness.": "標準グースネックパンチは、焼き入れ硬度 HRC 47±2 の T10A、42CrMo、または Cr12MoV 合金鋼から製造されています。",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications. Provide part drawings showing flange dimensions, bend angles, material specifications, and production volume. Our engineering team will design custom gooseneck tooling optimized for your specific application, including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "絶対に。",
  "Have a gooseneck tooling question?": "グースネック ツールについて質問がありますか?",
  "Download Gooseneck Tooling Guide": "グースネックツーリングガイドをダウンロード",
  "Get comprehensive technical specifications, throat depth selection charts, application guides, and dimensional drawings for our complete range of gooseneck and scimitar press brake tooling.": "当社のグースネックおよびシミター プレス ブレーキ ツールの全製品について、包括的な技術仕様、スロート深さ選択チャート、アプリケーション ガイド、寸法図を入手してください。"
}