{
  "Gooseneck Scimitar Punch": "Удар ятагана на гибкой шее",
  "Advanced gooseneck scimitar punch combining deep relief clearance with offset profile geometry. Engineered for complex box forming, return flanging, and channel bending operations where standard punches cause interference. Precision-machined from heat-treated alloy steel for exceptional durability.": "Усовершенствованный ятаганный пуансон с гибкой шеей, сочетающий в себе глубокий рельеф и смещенную геометрию профиля. ",
  "Request Quote": "Запросить цену",
  "Learn More": "Узнать больше",
  "Technical Specifications": "Технические характеристики",
  "Specialized gooseneck scimitar tooling for return flanging and deep box forming on CNC press brakes": "Специализированный инструмент для ятаганов с гибкой шеей для обратной отбортовки и формирования глубокой коробки на листогибочных прессах с ЧПУ.",
  "Material & Heat Treatment": "Материал и термообработка",
  "Material: 42CrMo, T10A, Cr12MoV steel": "Материал: сталь 42CrMo, T10A, Cr12MoV.",
  "Quenching Hardness: HRC 47±2": "Твердость закалки: HRC 47±2",
  "Optional: Induction hardening or Nitrex® treatment": "Опционально: индукционная закалка или обработка Nitrex®.",
  "Surface Finish: Precision ground and polished": "Поверхностная обработка: прецизионная шлифовка и полировка.",
  "Punch Configuration": "Конфигурация пуансона",
  "Profile: Gooseneck with scimitar offset": "Профиль: Гусиная шея со смещением ятагана.",
  "Relief Depth: Custom per application": "Глубина рельефа: индивидуальная для каждого применения.",
  "Return Flange Capacity: Variable length": "Емкость обратного фланца: переменная длина",
  "Standard Lengths: 500mm, 835mm, custom": "Стандартная длина: 500 мм, 835 мм, по индивидуальному заказу.",
  "Mounting Compatibility": "Совместимость монтажа",
  "American Standard (Planed/Machined)": "Американский стандарт (строганый/обработанный)",
  "European Standard (Wila, Amada, Trumpf)": "Европейский стандарт (Wila, Amada, Trumpf)",
  "Quick-change systems compatible": "Совместимость с системами быстрой замены",
  "Custom mounting upon request": "Индивидуальный монтаж по запросу",
  "Why Choose Gooseneck Scimitar Punches?": "Почему стоит выбрать удары ятаганом «гусиная шея»?",
  "Specialized tooling engineered to solve complex bending challenges where standard punches fail due to interference with existing flanges and deep box geometries": "Специализированный инструмент, разработанный для решения сложных задач по гибке, когда стандартные пуансоны выходят из строя из-за взаимодействия с существующими фланцами и геометрией глубокой коробки.",
  "Interference-Free Bending": "Гибка без помех",
  "Deep relief gooseneck design provides clearance for existing flanges, enabling complex multi-bend operations without tool interference": "Конструкция гибкой шейки с глубоким рельефом обеспечивает зазор для существующих фланцев, что позволяет выполнять сложные операции с несколькими изгибами без вмешательства инструмента.",
  "Return Flange Specialist": "Специалист по возвратным фланцам",
  "Specifically engineered for forming channels and parts with return flanges in two strokes, ideal for door frames and box assemblies": "Специально разработан для формирования каналов и деталей с возвратными фланцами за два хода, идеально подходит для дверных коробок и коробок в сборе.",
  "Offset Scimitar Profile": "Смещенный профиль ятагана",
  "Scimitar offset geometry enables complex channel formations and deep box work that standard straight punches cannot achieve": "Геометрия смещения Scimitar позволяет формировать сложные каналы и работать с глубокими ящиками, чего не могут достичь стандартные прямые пуансоны.",
  "Right Angle Precision": "Точность под прямым углом",
  "Forms precise 90° right angle bends in channels and U-profiles where conventional tooling would cause material deformation": "Формирует точные изгибы под прямым углом 90° в каналах и U-образных профилях, где обычные инструменты могут вызвать деформацию материала.",
  "Extended Tool Life": "Увеличенный срок службы инструмента",
  "Heat-treated alloy steel construction with HRC 47±2 hardness ensures superior wear resistance and long service life": "Конструкция из термообработанной легированной стали с твердостью HRC 47±2 обеспечивает превосходную износостойкость и длительный срок службы.",
  "Increased Productivity": "Повышенная производительность",
  "Eliminates secondary operations and complex fixturing, reducing setup time and increasing throughput for box and channel production": "Устраняет вторичные операции и сложную фиксацию, сокращая время наладки и увеличивая производительность при производстве коробок и швеллеров.",
  "Gooseneck Tooling Variations": "Варианты инструментов «гусиная шея»",
  "Comprehensive range of gooseneck and offset punch configurations for diverse return flanging and box forming applications": "Обширный ассортимент конфигураций пуансонов на гибкой шейке и со смещением для разнообразных применений в области обратной отбортовки и формовки коробок.",
  "Standard Gooseneck Punch": "Стандартный пуансон на гибкой шее",
  "Traditional gooseneck design with deep relief for channel forming and return flanging. Features symmetric profile optimized for right angle bends. Available in various throat depths and face widths to accommodate different flange lengths. Hardened to HRC 47±2 for durability. Ideal for standard box and pan forming operations requiring interference clearance.": "Традиционная конструкция «гусиной шейки» с глубоким рельефом для формирования каналов и обратной отбортовки. ",
  "Gooseneck Scimitar Combination": "Комбинация ятаганов на гибкой шее",
  "Advanced hybrid design combining gooseneck deep relief with scimitar offset profile. Provides exceptional clearance for complex multi-bend operations where both depth and offset are required. Enables formation of deep channels with return flanges in confined geometries. Custom engineered for specialized box forming and container manufacturing applications.": "Усовершенствованный гибридный дизайн, сочетающий в себе глубокий рельеф «гусиная шея» и смещенный профиль ятагана. ",
  "Offset Saber Punch": "Офсетный саблевидный удар",
  "Specialized offset punch with saber/scimitar profile for creating Z-bends and offset flanges. Forms two parallel bends in single operation with guaranteed parallelism. Ideal for overlapped assemblies and joining applications. Available in various offset distances and bend angles. Precision ground surfaces ensure consistent repeatability.": "Специализированный смещенный пуансон с саблевидным/ятаганным профилем для создания Z-образных изгибов и смещенных фланцев. ",
  "Acute Angle Gooseneck": "Острая угловая гусиная шея",
  "Gooseneck punch with acute angle tip (30°, 45°, 60°) for specialized applications requiring sharp bends with deep relief clearance. Commonly used for hemming operations, acute channels, and specialized box corners. Compatible with standard V-dies. Heat-treated for edge retention on sharp tip geometry.": "Пробойник на гибкой стойке с острым углом кончика (30°, 45°, 60°) для специализированных применений, требующих резких изгибов с глубоким зазором. ",
  "Variable Relief Gooseneck": "Гибкая шея с переменным рельефом",
  "Adjustable gooseneck system allowing variable throat depth for different return flange lengths without tooling changes. Modular design accommodates multiple flange dimensions. Quick-change components reduce setup time for job shops. Provides versatility for low to medium volume production with varying flange requirements.": "Регулируемая система «гусиная шея», позволяющая изменять глубину прохода для возвратных фланцев различной длины без замены оснастки. ",
  "Custom Profile Gooseneck": "Гибкая шея пользовательского профиля",
  "Engineered custom gooseneck profiles for specialized applications requiring unique geometries. Designed to customer specifications based on part drawings and production requirements. Can incorporate radius bends, compound angles, or specialized clearance features. Ideal for high-volume production of proprietary box and channel designs.": "Специально разработанные профили «гусиная шея» для специализированных применений, требующих уникальной геометрии. ",
  "Gooseneck Tooling in Action": "Инструмент на гибкой стойке в действии",
  "See how gooseneck scimitar punches solve complex bending challenges for box and channel forming": "Посмотрите, как пуансоны ятагана на гибкой шее решают сложные задачи по гибке при формовке коробок и каналов.",
  "Applications": "Приложения",
  "Gooseneck scimitar punches solve complex forming challenges across diverse industries requiring return flanges and deep box geometries": "Пуансоны с ятаганами на гибкой шее решают сложные задачи формовки в различных отраслях, требующих возвратных фланцев и геометрии глубокой коробки.",
  "Box & Pan Forming": "Формирование коробок и сковородок",
  "Manufacturing deep boxes, pans, and containers requiring multiple bends with return flanges and tight internal geometries": "Производство глубоких коробок, лотков и контейнеров, требующих многократных изгибов, с обратными фланцами и жесткой внутренней геометрией.",
  "Door Frame Manufacturing": "Производство дверных коробок",
  "Forming door frames, window frames, and architectural profiles with return flanges for structural rigidity": "Формирование дверных коробок, оконных рам и архитектурных профилей с возвратными фланцами для обеспечения жесткости конструкции.",
  "Channel & U-Profile Bending": "Гибка канала и U-профиля",
  "Creating channels, U-profiles, and C-sections in two strokes with precise right angle bends": "Создание каналов, U-образных профилей и C-образных сечений за два прохода с точными изгибами под прямым углом.",
  "Electronics Enclosures": "Корпуса для электроники",
  "Fabricating server racks, control cabinets, and electrical enclosures with complex flange requirements": "Изготовление серверных стоек, шкафов управления и электрических шкафов со сложными требованиями к фланцам.",
  "HVAC Equipment": "ОВиК оборудование",
  "Manufacturing ductwork transitions, air handler housings, and ventilation components with return flanges": "Изготовление переходников воздуховодов, корпусов приточно-вытяжных установок и компонентов вентиляции с обратными фланцами.",
  "Industrial Containers": "Промышленные контейнеры",
  "Producing storage containers, parts bins, and industrial trays with reinforced return flange edges": "Производство контейнеров для хранения, контейнеров для деталей и промышленных лотков с усиленными краями возвратных фланцев.",
  "Automotive Components": "Автомобильные компоненты",
  "Forming structural channels, brackets, and reinforcement members requiring deep relief clearance": "Формирование структурных каналов, кронштейнов и элементов арматуры, требующих глубокого рельефа",
  "Appliance Manufacturing": "Производство бытовой техники",
  "Creating appliance panels, housings, and structural components with complex flange geometries": "Создание панелей приборов, корпусов и конструктивных компонентов со сложной геометрией фланцев.",
  "Standard & Custom Tooling": "Стандартные и специальные инструменты",
  "Standard gooseneck configurations with optional custom profiles for specialized return flanging applications": "Стандартные конфигурации гибкой шейки с дополнительными пользовательскими профилями для специализированных применений с возвратными фланцами",
  "Custom Upgrades": "Пользовательские обновления",
  "Need custom gooseneck tooling for your application?": "Нужны специальные инструменты для вашего применения?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about gooseneck and scimitar press brake tooling": "Распространенные вопросы об инструментах для листогибочного пресса «гусиная шея» и «ятаган»",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing the punch from hitting previously formed flanges, making them essential for box forming, door frames, and channel bending applications.": "Пуансон на гибкой шейке имеет конструкцию с глубоким рельефом (смещенный профиль), который обеспечивает зазор для существующих фланцев и геометрий глубокой коробки. ",
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both deep relief clearance and offset capability for the most challenging box and channel forming operations.": "«Ятаган» или «сабля» относится к смещенной изогнутой конструкции профиля, похожей на изогнутое лезвие ятагана. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and face width for your application.": "Глубина горловины должна определяться длиной возвратного фланца, который вам необходимо сформировать. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending operations where deep relief clearance is required. These combine the interference-free benefits of gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming tooling.": "Да, пуансоны с острым углом (30°, 45°, 60°) специально разработаны для операций подшивки и острой гибки, где требуется глубокий рельефный зазор. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface hardness while maintaining core toughness.": "Стандартные пуансоны на гибкой шейке изготавливаются из легированной стали Т10А, 42CrMo или Cr12MoV с твердостью закалки HRC 47±2. ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications. Provide part drawings showing flange dimensions, bend angles, material specifications, and production volume. Our engineering team will design custom gooseneck tooling optimized for your specific application, including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "Абсолютно. ",
  "Have a gooseneck tooling question?": "У вас есть вопрос по инструментам «гусиная шея»?",
  "Download Gooseneck Tooling Guide": "Загрузить руководство по инструментам на гибкой стойке",
  "Get comprehensive technical specifications, throat depth selection charts, application guides, and dimensional drawings for our complete range of gooseneck and scimitar press brake tooling.": "Получите подробные технические характеристики, таблицы выбора глубины прохода, руководства по применению и габаритные чертежи для нашего полного ассортимента гибочных инструментов и инструментов для листогибочных прессов с ятаганами."
}