{
  "Gooseneck Scimitar Punch": "لكمة معقوفة السيف",
  "Advanced gooseneck scimitar punch combining deep relief clearance with offset profile geometry. Engineered for complex box forming, return flanging, and channel bending operations where standard punches cause interference. Precision-machined from heat-treated alloy steel for exceptional durability.": "لكمة معقوفة متقدمة تجمع بين إزالة الإغاثة العميقة وهندسة المظهر الجانبي. ",
  "Request Quote": "طلب اقتباس",
  "Learn More": "يتعلم أكثر",
  "Technical Specifications": "المواصفات الفنية",
  "Specialized gooseneck scimitar tooling for return flanging and deep box forming on CNC press brakes": "أدوات سيف معقوفة متخصصة لتشفيه الإرجاع وتشكيل الصندوق العميق على مكابح الضغط CNC",
  "Material & Heat Treatment": "المواد والمعالجة الحرارية",
  "Material: 42CrMo, T10A, Cr12MoV steel": "المواد: 42CrMo، T10A، Cr12MoV فولاذ",
  "Quenching Hardness: HRC 47±2": "صلابة التبريد: HRC 47 ± 2",
  "Optional: Induction hardening or Nitrex® treatment": "اختياري: تصلب الحث أو العلاج Nitrex®",
  "Surface Finish: Precision ground and polished": "اللمسة النهائية للسطح: أرضية دقيقة ومصقولة",
  "Punch Configuration": "تكوين لكمة",
  "Profile: Gooseneck with scimitar offset": "الملف الشخصي: معقوفة مع إزاحة السيف",
  "Relief Depth: Custom per application": "عمق الإغاثة: مخصص لكل تطبيق",
  "Return Flange Capacity: Variable length": "سعة شفة الإرجاع: طول متغير",
  "Standard Lengths: 500mm, 835mm, custom": "الأطوال القياسية: 500 مم، 835 مم، مخصص",
  "Mounting Compatibility": "توافق التركيب",
  "American Standard (Planed/Machined)": "المعيار الأمريكي (مسوى / آلي)",
  "European Standard (Wila, Amada, Trumpf)": "المعيار الأوروبي (ويلا، أمادا، ترومف)",
  "Quick-change systems compatible": "أنظمة التغيير السريع متوافقة",
  "Custom mounting upon request": "تركيب مخصص حسب الطلب",
  "Why Choose Gooseneck Scimitar Punches?": "لماذا تختار اللكمات المعقوفة؟",
  "Specialized tooling engineered to solve complex bending challenges where standard punches fail due to interference with existing flanges and deep box geometries": "أدوات متخصصة مصممة لحل تحديات الانحناء المعقدة حيث تفشل اللكمات القياسية بسبب التداخل مع الشفاه الموجودة وهندسة الصندوق العميق",
  "Interference-Free Bending": "الانحناء خالية من التدخل",
  "Deep relief gooseneck design provides clearance for existing flanges, enabling complex multi-bend operations without tool interference": "يوفر التصميم المنحني العميق خلوصًا للفلنجات الموجودة، مما يتيح عمليات معقدة متعددة الانحناءات دون تدخل الأداة",
  "Return Flange Specialist": "أخصائي شفة العودة",
  "Specifically engineered for forming channels and parts with return flanges in two strokes, ideal for door frames and box assemblies": "تم تصميمها خصيصًا لتشكيل القنوات والأجزاء ذات الشفاه الراجعة بضربتين، وهي مثالية لإطارات الأبواب ومجموعات الصناديق",
  "Offset Scimitar Profile": "إزاحة ملف تعريف السيف",
  "Scimitar offset geometry enables complex channel formations and deep box work that standard straight punches cannot achieve": "تتيح هندسة إزاحة السيف تكوينات قناة معقدة وعمل صندوق عميق لا يمكن لللكمات المستقيمة القياسية تحقيقه",
  "Right Angle Precision": "دقة الزاوية اليمنى",
  "Forms precise 90° right angle bends in channels and U-profiles where conventional tooling would cause material deformation": "يشكل انحناءات زاوية قائمة دقيقة بمقدار 90 درجة في القنوات وملفات التعريف على شكل حرف U حيث قد تتسبب الأدوات التقليدية في تشوه المادة",
  "Extended Tool Life": "تمديد عمر الأداة",
  "Heat-treated alloy steel construction with HRC 47±2 hardness ensures superior wear resistance and long service life": "يضمن الهيكل الفولاذي المعالج بالحرارة مع صلابة HRC 47±2 مقاومة فائقة للتآكل وعمر خدمة طويل",
  "Increased Productivity": "زيادة الإنتاجية",
  "Eliminates secondary operations and complex fixturing, reducing setup time and increasing throughput for box and channel production": "يزيل العمليات الثانوية والتركيبات المعقدة، مما يقلل من وقت الإعداد ويزيد الإنتاجية لإنتاج الصناديق والقنوات",
  "Gooseneck Tooling Variations": "اختلافات الأدوات معقوفة",
  "Comprehensive range of gooseneck and offset punch configurations for diverse return flanging and box forming applications": "مجموعة شاملة من التكوينات المعقوفة والخرم الأوفست لتطبيقات التشفيه الراجعة المتنوعة وتشكيل الصناديق",
  "Standard Gooseneck Punch": "لكمة معقوفة القياسية",
  "Traditional gooseneck design with deep relief for channel forming and return flanging. Features symmetric profile optimized for right angle bends. Available in various throat depths and face widths to accommodate different flange lengths. Hardened to HRC 47±2 for durability. Ideal for standard box and pan forming operations requiring interference clearance.": "تصميم تقليدي على شكل رقبة معقوفة مع راحة عميقة لتشكيل القناة وإرجاع التشفيه. ",
  "Gooseneck Scimitar Combination": "مزيج معقوفة السيف",
  "Advanced hybrid design combining gooseneck deep relief with scimitar offset profile. Provides exceptional clearance for complex multi-bend operations where both depth and offset are required. Enables formation of deep channels with return flanges in confined geometries. Custom engineered for specialized box forming and container manufacturing applications.": "تصميم هجين متطور يجمع بين نقش عنق الإوزة العميق ومظهر إزاحة السيف. ",
  "Offset Saber Punch": "إزاحة صابر لكمة",
  "Specialized offset punch with saber/scimitar profile for creating Z-bends and offset flanges. Forms two parallel bends in single operation with guaranteed parallelism. Ideal for overlapped assemblies and joining applications. Available in various offset distances and bend angles. Precision ground surfaces ensure consistent repeatability.": "لكمة أوفست متخصصة مع ملف تعريف السيف/السيف لإنشاء انحناءات على شكل حرف Z وفلنجات الإزاحة. ",
  "Acute Angle Gooseneck": "زاوية معقوفة حادة",
  "Gooseneck punch with acute angle tip (30°, 45°, 60°) for specialized applications requiring sharp bends with deep relief clearance. Commonly used for hemming operations, acute channels, and specialized box corners. Compatible with standard V-dies. Heat-treated for edge retention on sharp tip geometry.": "لكمة معقوفة مع طرف زاوية حادة (30 درجة، 45 درجة، 60 درجة) للتطبيقات المتخصصة التي تتطلب انحناءات حادة مع خلوص إغاثة عميق. ",
  "Variable Relief Gooseneck": "الإغاثة المتغيرة معقوفة",
  "Adjustable gooseneck system allowing variable throat depth for different return flange lengths without tooling changes. Modular design accommodates multiple flange dimensions. Quick-change components reduce setup time for job shops. Provides versatility for low to medium volume production with varying flange requirements.": "نظام معقوفة قابل للتعديل يسمح بعمق الحلق المتغير لأطوال شفة الإرجاع المختلفة دون تغيير الأدوات. ",
  "Custom Profile Gooseneck": "ملف تعريف مخصص معقوفة",
  "Engineered custom gooseneck profiles for specialized applications requiring unique geometries. Designed to customer specifications based on part drawings and production requirements. Can incorporate radius bends, compound angles, or specialized clearance features. Ideal for high-volume production of proprietary box and channel designs.": "تم تصميم ملفات تعريف معقوفة مخصصة للتطبيقات المتخصصة التي تتطلب أشكالًا هندسية فريدة. ",
  "Gooseneck Tooling in Action": "أدوات معقوفة في العمل",
  "See how gooseneck scimitar punches solve complex bending challenges for box and channel forming": "شاهد كيف تحل اللكمات المعقوفة تحديات الانحناء المعقدة لتشكيل الصندوق والقناة",
  "Applications": "التطبيقات",
  "Gooseneck scimitar punches solve complex forming challenges across diverse industries requiring return flanges and deep box geometries": "تعمل اللكمات المعقوفة على حل تحديات التشكيل المعقدة عبر الصناعات المتنوعة التي تتطلب حواف إرجاع وهندسة الصندوق العميق",
  "Box & Pan Forming": "تشكيل العلب والمقالي",
  "Manufacturing deep boxes, pans, and containers requiring multiple bends with return flanges and tight internal geometries": "تصنيع الصناديق العميقة والمقالي والحاويات التي تتطلب ثنيات متعددة مع حواف رجوع وهندسة داخلية محكمة",
  "Door Frame Manufacturing": "تصنيع إطار الباب",
  "Forming door frames, window frames, and architectural profiles with return flanges for structural rigidity": "تشكيل إطارات الأبواب وإطارات النوافذ والمقاطع المعمارية مع حواف رجعية لتحقيق الصلابة الهيكلية",
  "Channel & U-Profile Bending": "ثني القناة والملف الشخصي على شكل حرف U",
  "Creating channels, U-profiles, and C-sections in two strokes with precise right angle bends": "إنشاء قنوات وملفات تعريف على شكل حرف U وأقسام على شكل حرف C في خطين مع انحناءات زاوية قائمة دقيقة",
  "Electronics Enclosures": "حاويات الالكترونيات",
  "Fabricating server racks, control cabinets, and electrical enclosures with complex flange requirements": "تصنيع رفوف الخادم وخزائن التحكم والمرفقات الكهربائية بمتطلبات شفة معقدة",
  "HVAC Equipment": "معدات التدفئة والتهوية وتكييف الهواء",
  "Manufacturing ductwork transitions, air handler housings, and ventilation components with return flanges": "تصنيع انتقالات مجاري الهواء، وأغطية معالجات الهواء، ومكونات التهوية ذات الشفاه الراجعة",
  "Industrial Containers": "الحاويات الصناعية",
  "Producing storage containers, parts bins, and industrial trays with reinforced return flange edges": "إنتاج حاويات التخزين وصناديق الأجزاء والصواني الصناعية ذات حواف الإرجاع المقواة",
  "Automotive Components": "مكونات السيارات",
  "Forming structural channels, brackets, and reinforcement members requiring deep relief clearance": "تشكيل القنوات الهيكلية، والأقواس، وأعضاء التسليح التي تتطلب إزالة الإغاثة العميقة",
  "Appliance Manufacturing": "تصنيع الأجهزة",
  "Creating appliance panels, housings, and structural components with complex flange geometries": "إنشاء لوحات الأجهزة والمساكن والمكونات الهيكلية ذات الأشكال الهندسية المعقدة",
  "Standard & Custom Tooling": "الأدوات القياسية والمخصصة",
  "Standard gooseneck configurations with optional custom profiles for specialized return flanging applications": "تكوينات قياسية معقوفة مع ملفات تعريف مخصصة اختيارية لتطبيقات تشفيه الإرجاع المتخصصة",
  "Custom Upgrades": "ترقيات مخصصة",
  "Need custom gooseneck tooling for your application?": "هل تحتاج إلى أدوات معقوفة مخصصة لتطبيقك؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about gooseneck and scimitar press brake tooling": "أسئلة شائعة حول أدوات مكابح الضغط المعقوفة والسيف",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing the punch from hitting previously formed flanges, making them essential for box forming, door frames, and channel bending applications.": "تتميز المثقاب المعقوفة بتصميم بارز للغاية (ملف تعريف الإزاحة) يوفر خلوصًا للفلنجات الموجودة وهندسة الصندوق العميق. ",
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both deep relief clearance and offset capability for the most challenging box and channel forming operations.": "يشير \"السيف\" أو \"السيف\" إلى تصميم جانبي منحني متوازن يشبه النصل المنحني للسيف السيف. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and face width for your application.": "يجب تحديد عمق الحلق من خلال طول شفة الإرجاع التي تحتاج إلى تشكيلها. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending operations where deep relief clearance is required. These combine the interference-free benefits of gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming tooling.": "نعم، تم تصميم اللكمات المعقوفة ذات الزوايا الحادة (30 درجة، 45 درجة، 60 درجة) خصيصًا لعمليات التطويق والثني الحاد التي تتطلب خلوصًا عميقًا. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface hardness while maintaining core toughness.": "يتم تصنيع اللكمات المعقوفة القياسية من سبائك الفولاذ T10A، 42CrMo، أو Cr12MoV مع صلابة التبريد HRC 47±2. ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications. Provide part drawings showing flange dimensions, bend angles, material specifications, and production volume. Our engineering team will design custom gooseneck tooling optimized for your specific application, including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "قطعاً. ",
  "Have a gooseneck tooling question?": "هل لديك سؤال حول أدوات معقوفة؟",
  "Download Gooseneck Tooling Guide": "قم بتنزيل دليل أدوات Gooseneck",
  "Get comprehensive technical specifications, throat depth selection charts, application guides, and dimensional drawings for our complete range of gooseneck and scimitar press brake tooling.": "احصل على المواصفات الفنية الشاملة، ومخططات اختيار عمق الحلق، وأدلة التطبيق، ورسومات الأبعاد لمجموعتنا الكاملة من أدوات مكابح الضغط المعقوفة والسيف."
}