{
  "Gooseneck Scimitar Punch": "Schwanenhals-Scimitar-Schlag",
  "Advanced gooseneck scimitar punch combining deep relief clearance with offset profile geometry. Engineered for complex box forming, return flanging, and channel bending operations where standard punches cause interference. Precision-machined from heat-treated alloy steel for exceptional durability.": "Fortschrittlicher Schwanenhals-Säbelstanzer, der einen tiefen Freiraum mit versetzter Profilgeometrie kombiniert. ",
  "Request Quote": "Angebot anfordern",
  "Learn More": "Erfahren Sie mehr",
  "Technical Specifications": "Technische Spezifikationen",
  "Specialized gooseneck scimitar tooling for return flanging and deep box forming on CNC press brakes": "Spezialisiertes Schwanenhals-Krummsäbelwerkzeug zum Rückwärtsbördeln und Tiefformen auf CNC-Abkantpressen",
  "Material & Heat Treatment": "Material- und Wärmebehandlung",
  "Material: 42CrMo, T10A, Cr12MoV steel": "Material: 42CrMo, T10A, Cr12MoV-Stahl",
  "Quenching Hardness: HRC 47±2": "Abschreckhärte: HRC 47 ± 2",
  "Optional: Induction hardening or Nitrex® treatment": "Optional: Induktionshärtung oder Nitrex®-Behandlung",
  "Surface Finish: Precision ground and polished": "Oberflächenbeschaffenheit: Präzisionsgeschliffen und poliert",
  "Punch Configuration": "Stanzkonfiguration",
  "Profile: Gooseneck with scimitar offset": "Profil: Schwanenhals mit Krummsäbelversatz",
  "Relief Depth: Custom per application": "Relieftiefe: Je nach Anwendung individuell",
  "Return Flange Capacity: Variable length": "Rücklaufflanschkapazität: Variable Länge",
  "Standard Lengths: 500mm, 835mm, custom": "Standardlängen: 500 mm, 835 mm, kundenspezifisch",
  "Mounting Compatibility": "Montagekompatibilität",
  "American Standard (Planed/Machined)": "Amerikanischer Standard (gehobelt/bearbeitet)",
  "European Standard (Wila, Amada, Trumpf)": "Europäischer Standard (Wila, Amada, Trumpf)",
  "Quick-change systems compatible": "Schnellwechselsysteme kompatibel",
  "Custom mounting upon request": "Individuelle Montage auf Anfrage",
  "Why Choose Gooseneck Scimitar Punches?": "Warum sollten Sie sich für Schwanenhals-Scimitar-Stanzen entscheiden?",
  "Specialized tooling engineered to solve complex bending challenges where standard punches fail due to interference with existing flanges and deep box geometries": "Spezialwerkzeuge zur Lösung komplexer Biegeherausforderungen, bei denen Standardstempel aufgrund von Interferenzen mit vorhandenen Flanschen und tiefen Kastengeometrien versagen",
  "Interference-Free Bending": "Störungsfreies Biegen",
  "Deep relief gooseneck design provides clearance for existing flanges, enabling complex multi-bend operations without tool interference": "Das Schwanenhalsdesign mit tiefer Aussparung bietet Platz für vorhandene Flansche und ermöglicht so komplexe Mehrfachbiegevorgänge ohne Werkzeugbeeinträchtigung",
  "Return Flange Specialist": "Spezialist für Rückholflansche",
  "Specifically engineered for forming channels and parts with return flanges in two strokes, ideal for door frames and box assemblies": "Speziell entwickelt zum Formen von Kanälen und Teilen mit Rücklaufflanschen in zwei Hüben, ideal für Türrahmen und Kastenbaugruppen",
  "Offset Scimitar Profile": "Versetztes Scimitar-Profil",
  "Scimitar offset geometry enables complex channel formations and deep box work that standard straight punches cannot achieve": "Die versetzte Scimitar-Geometrie ermöglicht komplexe Kanalformationen und tiefe Kastenarbeiten, die mit herkömmlichen geraden Stempeln nicht möglich sind",
  "Right Angle Precision": "Rechtwinklige Präzision",
  "Forms precise 90° right angle bends in channels and U-profiles where conventional tooling would cause material deformation": "Bildet präzise rechtwinklige 90°-Biegungen in Kanälen und U-Profilen, wo herkömmliche Werkzeuge zu Materialverformungen führen würden",
  "Extended Tool Life": "Längere Werkzeuglebensdauer",
  "Heat-treated alloy steel construction with HRC 47±2 hardness ensures superior wear resistance and long service life": "Die wärmebehandelte Konstruktion aus legiertem Stahl mit einer Härte von HRC 47 ± 2 sorgt für hervorragende Verschleißfestigkeit und lange Lebensdauer",
  "Increased Productivity": "Erhöhte Produktivität",
  "Eliminates secondary operations and complex fixturing, reducing setup time and increasing throughput for box and channel production": "Eliminiert sekundäre Vorgänge und komplexe Vorrichtungen, verkürzt die Rüstzeit und erhöht den Durchsatz bei der Kasten- und Kanalproduktion",
  "Gooseneck Tooling Variations": "Schwanenhals-Werkzeugvarianten",
  "Comprehensive range of gooseneck and offset punch configurations for diverse return flanging and box forming applications": "Umfassendes Sortiment an Schwanenhals- und Offset-Stanzkonfigurationen für verschiedene Rückflansch- und Kastenformanwendungen",
  "Standard Gooseneck Punch": "Standard-Schwanenhalsstanze",
  "Traditional gooseneck design with deep relief for channel forming and return flanging. Features symmetric profile optimized for right angle bends. Available in various throat depths and face widths to accommodate different flange lengths. Hardened to HRC 47±2 for durability. Ideal for standard box and pan forming operations requiring interference clearance.": "Traditionelles Schwanenhalsdesign mit tiefer Aussparung für Kanalbildung und Rückflanschung. ",
  "Gooseneck Scimitar Combination": "Schwanenhals-Scimitar-Kombination",
  "Advanced hybrid design combining gooseneck deep relief with scimitar offset profile. Provides exceptional clearance for complex multi-bend operations where both depth and offset are required. Enables formation of deep channels with return flanges in confined geometries. Custom engineered for specialized box forming and container manufacturing applications.": "Fortschrittliches Hybriddesign, das ein tiefes Schwanenhalsrelief mit einem Krummsäbel-Versatzprofil kombiniert. ",
  "Offset Saber Punch": "Offset-Säbelschlag",
  "Specialized offset punch with saber/scimitar profile for creating Z-bends and offset flanges. Forms two parallel bends in single operation with guaranteed parallelism. Ideal for overlapped assemblies and joining applications. Available in various offset distances and bend angles. Precision ground surfaces ensure consistent repeatability.": "Spezieller Offset-Stanzer mit Säbel-/Säbelprofil zum Erstellen von Z-Bögen und Offset-Flanschen. ",
  "Acute Angle Gooseneck": "Spitzwinkliger Schwanenhals",
  "Gooseneck punch with acute angle tip (30°, 45°, 60°) for specialized applications requiring sharp bends with deep relief clearance. Commonly used for hemming operations, acute channels, and specialized box corners. Compatible with standard V-dies. Heat-treated for edge retention on sharp tip geometry.": "Schwanenhalsstanze mit spitzer Winkelspitze (30°, 45°, 60°) für spezielle Anwendungen, die scharfe Biegungen mit großem Freiraum erfordern. ",
  "Variable Relief Gooseneck": "Schwanenhals mit variabler Entlastung",
  "Adjustable gooseneck system allowing variable throat depth for different return flange lengths without tooling changes. Modular design accommodates multiple flange dimensions. Quick-change components reduce setup time for job shops. Provides versatility for low to medium volume production with varying flange requirements.": "Das verstellbare Schwanenhalssystem ermöglicht eine variable Halstiefe für unterschiedliche Rücklaufflanschlängen ohne Werkzeugwechsel. ",
  "Custom Profile Gooseneck": "Schwanenhals mit individuellem Profil",
  "Engineered custom gooseneck profiles for specialized applications requiring unique geometries. Designed to customer specifications based on part drawings and production requirements. Can incorporate radius bends, compound angles, or specialized clearance features. Ideal for high-volume production of proprietary box and channel designs.": "Maßgeschneiderte Schwanenhalsprofile für spezielle Anwendungen, die einzigartige Geometrien erfordern. ",
  "Gooseneck Tooling in Action": "Schwanenhalswerkzeuge in Aktion",
  "See how gooseneck scimitar punches solve complex bending challenges for box and channel forming": "Sehen Sie, wie Schwanenhals-Säbelsäbel komplexe Biegeherausforderungen bei der Kasten- und Kanalformung lösen",
  "Applications": "Anwendungen",
  "Gooseneck scimitar punches solve complex forming challenges across diverse industries requiring return flanges and deep box geometries": "Schwanenhalssäbelstanzen lösen komplexe Umformherausforderungen in verschiedenen Branchen, die Rückholflansche und tiefe Kastengeometrien erfordern",
  "Box & Pan Forming": "Kasten- und Pfannenformen",
  "Manufacturing deep boxes, pans, and containers requiring multiple bends with return flanges and tight internal geometries": "Herstellung von tiefen Kisten, Pfannen und Behältern, die mehrere Biegungen mit Rücklaufflanschen und engen Innengeometrien erfordern",
  "Door Frame Manufacturing": "Herstellung von Türrahmen",
  "Forming door frames, window frames, and architectural profiles with return flanges for structural rigidity": "Formen von Türrahmen, Fensterrahmen und Architekturprofilen mit Rückflanschen für strukturelle Steifigkeit",
  "Channel & U-Profile Bending": "Biegen von Kanal- und U-Profilen",
  "Creating channels, U-profiles, and C-sections in two strokes with precise right angle bends": "Erstellen Sie Kanäle, U-Profile und C-Profile in zwei Schritten mit präzisen rechtwinkligen Biegungen",
  "Electronics Enclosures": "Elektronikgehäuse",
  "Fabricating server racks, control cabinets, and electrical enclosures with complex flange requirements": "Herstellung von Server-Racks, Schaltschränken und Elektrogehäusen mit komplexen Flanschanforderungen",
  "HVAC Equipment": "HVAC-Ausrüstung",
  "Manufacturing ductwork transitions, air handler housings, and ventilation components with return flanges": "Herstellung von Kanalübergängen, Lüftungsgehäusen und Lüftungskomponenten mit Rücklaufflanschen",
  "Industrial Containers": "Industriecontainer",
  "Producing storage containers, parts bins, and industrial trays with reinforced return flange edges": "Herstellung von Lagerbehältern, Teilebehältern und Industrietabletts mit verstärkten Rücklaufflanschkanten",
  "Automotive Components": "Automobilkomponenten",
  "Forming structural channels, brackets, and reinforcement members requiring deep relief clearance": "Formung von Strukturkanälen, Halterungen und Verstärkungselementen, die einen großen Freiraum erfordern",
  "Appliance Manufacturing": "Geräteherstellung",
  "Creating appliance panels, housings, and structural components with complex flange geometries": "Erstellen von Gerätepaneelen, Gehäusen und Strukturbauteilen mit komplexen Flanschgeometrien",
  "Standard & Custom Tooling": "Standard- und kundenspezifische Werkzeuge",
  "Standard gooseneck configurations with optional custom profiles for specialized return flanging applications": "Standard-Schwanenhalskonfigurationen mit optionalen kundenspezifischen Profilen für spezielle Rückflanschanwendungen",
  "Custom Upgrades": "Benutzerdefinierte Upgrades",
  "Need custom gooseneck tooling for your application?": "Benötigen Sie maßgeschneiderte Schwanenhalswerkzeuge für Ihre Anwendung?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about gooseneck and scimitar press brake tooling": "Häufige Fragen zu Schwanenhals- und Krummsäbel-Abkantwerkzeugen",
  "A gooseneck punch features a deep relief design (offset profile) that provides clearance for existing flanges and deep box geometries. Standard straight 90° punches would cause interference when trying to form channels or parts with return flanges. Gooseneck punches enable multi-bend operations by preventing the punch from hitting previously formed flanges, making them essential for box forming, door frames, and channel bending applications.": "Ein Schwanenhalsstanzer verfügt über ein tiefes Reliefdesign (versetztes Profil), das Freiraum für vorhandene Flansche und tiefe Kastengeometrien bietet. ",
  "\"Scimitar\" or \"saber\" refers to an offset, curved profile design similar to the curved blade of a scimitar sword. In press brake tooling, scimitar punches feature an offset geometry that allows for complex channel formations and Z-bends. When combined with gooseneck design, it creates a specialized tool providing both deep relief clearance and offset capability for the most challenging box and channel forming operations.": "„Scimitar“ oder „Säbel“ bezieht sich auf ein versetztes, gebogenes Profildesign, das der gebogenen Klinge eines Krummsäbelschwerts ähnelt. ",
  "Throat depth should be determined by the return flange length you need to form. Measure the distance from the bend line to the edge of your existing flange, then add clearance (typically 3-5mm). For channels formed in two strokes, the throat depth determines the maximum channel depth. Provide us with your part drawings showing flange dimensions, and our engineering team will recommend the optimal throat depth and face width for your application.": "Die Ausladungstiefe sollte durch die Länge des Rücklaufflansches bestimmt werden, die Sie formen müssen. ",
  "Yes, acute angle gooseneck punches (30°, 45°, 60°) are specifically designed for hemming and acute bending operations where deep relief clearance is required. These combine the interference-free benefits of gooseneck design with sharp tip geometry for hemming. Two-stage hemming operations (acute bend followed by flattening) can be performed even on parts with existing flanges using specialized gooseneck hemming tooling.": "Ja, Schwanenhalsstanzen mit spitzem Winkel (30°, 45°, 60°) sind speziell für Falz- und Spitzbiegevorgänge konzipiert, bei denen ein großer Freiraum erforderlich ist. ",
  "Standard gooseneck punches are manufactured from T10A, 42CrMo, or Cr12MoV alloy steel with quenching hardness of HRC 47±2. This hardness provides excellent wear resistance while maintaining toughness to prevent cracking in the deep relief geometry. For high-volume production or hard materials (stainless steel, high-tensile steel), optional induction hardening or Nitrex® surface treatment can increase surface hardness while maintaining core toughness.": "Standard-Schwanenhalsstempel werden aus legiertem T10A-, 42CrMo- oder Cr12MoV-Stahl mit einer Abschreckhärte von HRC 47 ± 2 hergestellt. ",
  "Absolutely. We specialize in custom-engineered gooseneck punches designed to your exact specifications. Provide part drawings showing flange dimensions, bend angles, material specifications, and production volume. Our engineering team will design custom gooseneck tooling optimized for your specific application, including unique throat depths, compound angles, radius bends, or specialized clearance features. Custom tooling is particularly cost-effective for high-volume production of proprietary box and channel designs.": "Absolut. ",
  "Have a gooseneck tooling question?": "Haben Sie eine Frage zu Schwanenhalswerkzeugen?",
  "Download Gooseneck Tooling Guide": "Laden Sie den Gooseneck Tooling Guide herunter",
  "Get comprehensive technical specifications, throat depth selection charts, application guides, and dimensional drawings for our complete range of gooseneck and scimitar press brake tooling.": "Erhalten Sie umfassende technische Spezifikationen, Auswahltabellen für die Ausladungstiefe, Anwendungsleitfäden und Maßzeichnungen für unser komplettes Sortiment an Schwanenhals- und Krummsäbel-Abkantwerkzeugen."
}