{
  "Double Table Fiber Laser Cutting Machine": "Máquina cortadora láser de fibra de doble mesa",
  "Featuring automatic table exchange system and high-power fiber laser source, our double table fiber laser cutting machine maximizes productivity through continuous operation. One table cuts while the other loads/unloads with rapid automatic exchange.": "Con un sistema de intercambio automático de mesa y una fuente láser de fibra de alta potencia, nuestra máquina cortadora por láser de fibra de doble mesa maximiza la productividad a través de una operación continua. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "High-productivity fiber laser cutting system with dual exchange table for continuous operation": "Sistema de corte por láser de fibra de alta productividad con mesa de intercambio dual para operación continua",
  "Cutting Capacity": "Capacidad de corte",
  "Laser Power: Multiple power options available": "Potencia del láser: múltiples opciones de potencia disponibles",
  "Working Area: Customizable dimensions": "Área de trabajo: dimensiones personalizables",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Material: acero, inoxidable, aluminio, cobre, latón",
  "Max Thickness: Various thickness capabilities": "Espesor máximo: varias capacidades de espesor",
  "Control System": "Sistema de control",
  "CNC System: CypCut or Raytools": "Sistema CNC: CypCut o Raytools",
  "Cutting Head: Auto-focus": "Cabezal de corte: enfoque automático",
  "Positioning Accuracy: High precision": "Precisión de posicionamiento: alta precisión",
  "Repeat Accuracy: High repeatability": "Precisión de repetición: Alta repetibilidad",
  "Key Features": "Características clave",
  "Rapid automatic table exchange": "Cambio rápido y automático de mesa",
  "Dual working tables": "Mesas de trabajo duales",
  "Continuous operation capability": "Capacidad de operación continua",
  "Significantly higher productivity vs single table": "Productividad significativamente mayor frente a una sola mesa",
  "Why Choose Our Double Table Fiber Laser Cutting Machine?": "¿Por qué elegir nuestra máquina cortadora láser de fibra de doble mesa?",
  "Discover the key advantages that make our dual table laser cutting machine the ideal choice for high-volume production and maximum efficiency": "Descubra las ventajas clave que hacen de nuestra máquina de corte por láser de doble mesa la opción ideal para producción de gran volumen y máxima eficiencia.",
  "Maximum Productivity": "Máxima productividad",
  "50% higher output than single table machines through continuous operation - one table cuts while the other loads": "50 % más de producción que las máquinas de una sola mesa gracias al funcionamiento continuo: una mesa corta mientras la otra carga",
  "Rapid Table Exchange": "Intercambio rápido de mesa",
  "Automated rapid table exchange minimizes idle time and maximizes cutting efficiency for high-volume production": "El intercambio rápido y automatizado de mesas minimiza el tiempo de inactividad y maximiza la eficiencia de corte para una producción de gran volumen",
  "Reduced Labor Costs": "Costos laborales reducidos",
  "Operator loads/unloads one table while machine cuts on the other, optimizing labor efficiency and reducing per-part costs": "El operador carga/descarga una mesa mientras la máquina corta en la otra, optimizando la eficiencia laboral y reduciendo los costos por pieza.",
  "Faster ROI": "Retorno de la inversión más rápido",
  "Higher initial investment pays back quickly through increased throughput and reduced per-piece manufacturing costs": "Una mayor inversión inicial se amortiza rápidamente mediante un mayor rendimiento y menores costos de fabricación por pieza.",
  "Uninterrupted Production": "Producción ininterrumpida",
  "Eliminates cutting interruptions for material loading, enabling 24/7 operation for deadline-critical projects": "Elimina las interrupciones de corte para la carga de material, lo que permite el funcionamiento 24 horas al día, 7 días a la semana para proyectos con plazos críticos",
  "Enhanced Safety": "Seguridad mejorada",
  "Operators work safely outside the cutting zone during table exchange, improving workplace safety and ergonomics": "Los operadores trabajan de forma segura fuera de la zona de corte durante el cambio de mesa, lo que mejora la seguridad y la ergonomía en el lugar de trabajo.",
  "Key Components": "Componentes clave",
  "Understanding the core components that deliver precision laser cutting performance and reliability": "Comprender los componentes principales que ofrecen rendimiento y confiabilidad en el corte por láser de precisión",
  "Fiber Laser Source": "Fuente láser de fibra",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan. Stable output ensures consistent cutting quality.": "Generador láser de fibra de alta potencia (múltiples opciones de potencia) de fabricantes líderes como Raycus o IPG. ",
  "CNC Control System": "Sistema de control CNC",
  "Advanced CNC system (CypCut or Raytools) with intuitive interface for easy programming and operation. Supports complex path planning, automatic nesting, and real-time monitoring. Compatible with standard file formats (DXF, DWG) for seamless CAD/CAM integration.": "Sistema CNC avanzado (CypCut o Raytools) con interfaz intuitiva para una fácil programación y operación. ",
  "Auto-Focus Cutting Head": "Cabezal de corte con enfoque automático",
  "Professional auto-focus cutting head with capacitive height sensor for automatic focal length adjustment. Ensures optimal focus position across different material thicknesses. Built-in collision protection and quick lens replacement design minimize downtime.": "Cabezal de corte profesional con enfoque automático y sensor de altura capacitivo para ajuste automático de la distancia focal. ",
  "Linear Motor Drive System": "Sistema de accionamiento de motor lineal",
  "High-precision linear motor or servo motor drive system with precision ball screws and linear guides. Provides fast acceleration, high positioning accuracy (High precision), and smooth motion control. Dual-drive design ensures synchronized movement and long-term stability.": "Sistema de accionamiento por motor lineal o servomotor de alta precisión con husillos de bolas de precisión y guías lineales. ",
  "Double Exchange Table System": "Sistema de mesa de intercambio doble",
  "Automatic shuttle table exchange system with two independent Customizable working tables. Rapid exchange time powered by precision servo motors. Pneumatic clamping system secures materials during cutting. One table processes parts while the other loads/unloads, maximizing productivity and eliminating idle time for continuous 24/7 operation capability.": "Sistema automático de intercambio de mesas lanzadera con dos mesas de trabajo independientes y personalizables. ",
  "Assist Gas & Cooling System": "Sistema de refrigeración y gas auxiliar",
  "Precision gas delivery system with automatic pressure control for oxygen, nitrogen, or air assist. Industrial water chiller maintains optimal laser source temperature. Dust extraction system ensures clean cutting environment and protects optical components from contamination.": "Sistema de suministro de gas de precisión con control automático de presión para asistencia de oxígeno, nitrógeno o aire. ",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "See the precision and speed of our fiber laser cutting machine in real production": "Vea la precisión y velocidad de nuestra máquina de corte por láser de fibra en producción real",
  "Applications": "Aplicaciones",
  "Our fiber laser cutting machines are widely used across various industries for precision metal cutting and complex pattern processing": "Nuestras máquinas de corte por láser de fibra se utilizan ampliamente en diversas industrias para el corte de metales de precisión y el procesamiento de patrones complejos.",
  "Sheet Metal Fabrication": "Fabricación de chapa metálica",
  "Precision laser cutting of complex patterns, intricate designs, and tight tolerances for custom fabrication": "Corte láser de precisión de patrones complejos, diseños intrincados y tolerancias estrictas para fabricación personalizada",
  "Automotive Parts": "Piezas automotrices",
  "Manufacturing chassis components, exhaust systems, brackets, and precision automotive parts with tight tolerances": "Fabricación de componentes de chasis, sistemas de escape, soportes y piezas automotrices de precisión con tolerancias estrictas.",
  "Elevator & Escalator": "Ascensor y escalera mecánica",
  "Cutting decorative panels, structural components, and safety parts for elevator and escalator manufacturing": "Corte de paneles decorativos, componentes estructurales y piezas de seguridad para la fabricación de ascensores y escaleras mecánicas.",
  "Electronics Enclosures": "Cajas electrónicas",
  "Laser cutting of server racks, control panels, electrical cabinets with precise ventilation holes": "Corte por láser de racks de servidores, paneles de control y armarios eléctricos con orificios de ventilación precisos.",
  "Agricultural Machinery": "Maquinaria agrícola",
  "Manufacturing parts for tractors, harvesters, and farm equipment with complex geometries": "Fabricación de piezas para tractores, cosechadoras y equipos agrícolas con geometrías complejas.",
  "Fitness Equipment": "Equipo de gimnasia",
  "Cutting structural frames, decorative covers, and mechanical parts for exercise machines": "Corte de marcos estructurales, cubiertas decorativas y piezas mecánicas para máquinas de ejercicio.",
  "Advertising & Signage": "Publicidad y Señalización",
  "Cutting intricate letters, logos, and decorative metal signs with smooth edges": "Cortar letras, logotipos y letreros metálicos decorativos intrincados con bordes lisos",
  "Kitchen Equipment": "Equipo de cocina",
  "Manufacturing stainless steel sinks, countertops, appliance panels, and commercial kitchen components": "Fabricación de fregaderos, encimeras, paneles de electrodomésticos y componentes de cocinas comerciales de acero inoxidable.",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personalice su máquina con funciones estándar y actualizaciones opcionales para satisfacer sus requisitos específicos",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our fiber laser cutting machines": "Preguntas comunes sobre nuestras máquinas de corte por láser de fibra",
  "Double table machines typically achieve 40-50% higher productivity than single table machines. The automatic table exchange takes only rapid, and while one table is cutting, the operator can load/unload the other table simultaneously. This eliminates material loading downtime and enables continuous 24/7 operation, making it ideal for high-volume production environments.": "Las máquinas de doble mesa suelen alcanzar una productividad entre un 40 y un 50 % mayor que las máquinas de una sola mesa. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and 12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel, aluminum alloys, copper, brass, and titanium.": "Nuestras máquinas de corte por láser de fibra pueden cortar varios espesores de acero al carbono, acero inoxidable, aluminio y 12 mm, y cobre/latón hasta 8 mm (los espesores varían según la potencia del láser). ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser gas refills or mirror alignments are needed.": "Los láseres de fibra prácticamente no requieren mantenimiento en comparación con los láseres de CO2. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization, basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Sí, brindamos soporte integral que incluye instalación en el sitio, puesta en marcha de la máquina y capacitación del operador (generalmente de 3 a 5 días). ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion), assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power consumption and minimal maintenance requirements.": "Los costos operativos incluyen electricidad (los láseres de fibra son altamente eficientes con ~30% de conversión electroóptica), gas auxiliar (nitrógeno, oxígeno o aire comprimido), electricidad para enfriadores de agua y consumibles ocasionales (lentes protectoras, boquillas). ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications or higher power configurations may require 45-60 days. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Las máquinas de configuración estándar generalmente se envían entre 30 y 45 días después de la confirmación del pedido. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Get detailed technical specifications, dimensions, and performance data for our fiber laser cutting machines. Download our comprehensive product brochure in PDF format.": "Obtenga especificaciones técnicas detalladas, dimensiones y datos de rendimiento de nuestras máquinas de corte por láser de fibra. "
}