{
  "Double Table Fiber Laser Cutting Machine": "Doppeltisch-Faserlaserschneidemaschine",
  "Featuring automatic table exchange system and high-power fiber laser source, our double table fiber laser cutting machine maximizes productivity through continuous operation. One table cuts while the other loads/unloads with rapid automatic exchange.": "Ausgestattet mit einem automatischen Tischwechselsystem und einer leistungsstarken Faserlaserquelle maximiert unsere Doppeltisch-Faserlaserschneidemaschine die Produktivität durch kontinuierlichen Betrieb. ",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "High-productivity fiber laser cutting system with dual exchange table for continuous operation": "Hochproduktive Faserlaserschneidanlage mit Doppelwechseltisch für Dauerbetrieb",
  "Cutting Capacity": "Schnittkapazität",
  "Laser Power: Multiple power options available": "Laserleistung: Mehrere Leistungsoptionen verfügbar",
  "Working Area: Customizable dimensions": "Arbeitsbereich: Anpassbare Abmessungen",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Material: Stahl, Edelstahl, Aluminium, Kupfer, Messing",
  "Max Thickness: Various thickness capabilities": "Maximale Dicke: Verschiedene Dickenmöglichkeiten",
  "Control System": "Kontrollsystem",
  "CNC System: CypCut or Raytools": "CNC-System: CypCut oder Raytools",
  "Cutting Head: Auto-focus": "Schneidkopf: Autofokus",
  "Positioning Accuracy: High precision": "Positionierungsgenauigkeit: Hohe Präzision",
  "Repeat Accuracy: High repeatability": "Wiederholgenauigkeit: Hohe Wiederholgenauigkeit",
  "Key Features": "Hauptmerkmale",
  "Rapid automatic table exchange": "Schneller automatischer Tischwechsel",
  "Dual working tables": "Doppelte Arbeitstische",
  "Continuous operation capability": "Dauerbetriebsfähigkeit",
  "Significantly higher productivity vs single table": "Deutlich höhere Produktivität im Vergleich zu einem Einzeltisch",
  "Why Choose Our Double Table Fiber Laser Cutting Machine?": "Warum sollten Sie sich für unsere Doppeltisch-Faserlaserschneidemaschine entscheiden?",
  "Discover the key advantages that make our dual table laser cutting machine the ideal choice for high-volume production and maximum efficiency": "Entdecken Sie die wichtigsten Vorteile, die unsere Doppeltisch-Laserschneidmaschine zur idealen Wahl für die Massenproduktion und maximale Effizienz machen",
  "Maximum Productivity": "Maximale Produktivität",
  "50% higher output than single table machines through continuous operation - one table cuts while the other loads": "50 % höhere Leistung als Eintischmaschinen durch Dauerbetrieb – ein Tisch schneidet, während der andere lädt",
  "Rapid Table Exchange": "Schneller Tischaustausch",
  "Automated rapid table exchange minimizes idle time and maximizes cutting efficiency for high-volume production": "Der automatisierte schnelle Tischwechsel minimiert Leerlaufzeiten und maximiert die Schneideffizienz für die Massenproduktion",
  "Reduced Labor Costs": "Reduzierte Arbeitskosten",
  "Operator loads/unloads one table while machine cuts on the other, optimizing labor efficiency and reducing per-part costs": "Der Bediener be- und entlädt einen Tisch, während die Maschine am anderen schneidet, was die Arbeitseffizienz optimiert und die Kosten pro Teil senkt",
  "Faster ROI": "Schnellerer ROI",
  "Higher initial investment pays back quickly through increased throughput and reduced per-piece manufacturing costs": "Höhere Anfangsinvestitionen amortisieren sich schnell durch erhöhten Durchsatz und geringere Herstellungskosten pro Stück",
  "Uninterrupted Production": "Unterbrechungsfreie Produktion",
  "Eliminates cutting interruptions for material loading, enabling 24/7 operation for deadline-critical projects": "Eliminiert Schnittunterbrechungen beim Materialladen und ermöglicht einen 24/7-Betrieb für terminkritische Projekte",
  "Enhanced Safety": "Erhöhte Sicherheit",
  "Operators work safely outside the cutting zone during table exchange, improving workplace safety and ergonomics": "Während des Tischwechsels arbeiten die Bediener sicher außerhalb der Schneidzone, was die Sicherheit und Ergonomie am Arbeitsplatz verbessert",
  "Key Components": "Schlüsselkomponenten",
  "Understanding the core components that deliver precision laser cutting performance and reliability": "Verständnis der Kernkomponenten, die für präzise Laserschneidleistung und Zuverlässigkeit sorgen",
  "Fiber Laser Source": "Faserlaserquelle",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan. Stable output ensures consistent cutting quality.": "Hochleistungs-Faserlasergenerator (mehrere Leistungsoptionen) von führenden Herstellern wie Raycus oder IPG. ",
  "CNC Control System": "CNC-Steuerungssystem",
  "Advanced CNC system (CypCut or Raytools) with intuitive interface for easy programming and operation. Supports complex path planning, automatic nesting, and real-time monitoring. Compatible with standard file formats (DXF, DWG) for seamless CAD/CAM integration.": "Fortschrittliches CNC-System (CypCut oder Raytools) mit intuitiver Benutzeroberfläche für einfache Programmierung und Bedienung. ",
  "Auto-Focus Cutting Head": "Autofokus-Schneidkopf",
  "Professional auto-focus cutting head with capacitive height sensor for automatic focal length adjustment. Ensures optimal focus position across different material thicknesses. Built-in collision protection and quick lens replacement design minimize downtime.": "Professioneller Autofokus-Schneidkopf mit kapazitivem Höhensensor zur automatischen Brennweitenanpassung. ",
  "Linear Motor Drive System": "Linearmotor-Antriebssystem",
  "High-precision linear motor or servo motor drive system with precision ball screws and linear guides. Provides fast acceleration, high positioning accuracy (High precision), and smooth motion control. Dual-drive design ensures synchronized movement and long-term stability.": "Hochpräzises Linearmotor- oder Servomotor-Antriebssystem mit Präzisionskugelumlaufspindeln und Linearführungen. ",
  "Double Exchange Table System": "Doppeltes Wechseltischsystem",
  "Automatic shuttle table exchange system with two independent Customizable working tables. Rapid exchange time powered by precision servo motors. Pneumatic clamping system secures materials during cutting. One table processes parts while the other loads/unloads, maximizing productivity and eliminating idle time for continuous 24/7 operation capability.": "Automatisches Wechseltisch-Wechselsystem mit zwei unabhängigen, anpassbaren Arbeitstischen. ",
  "Assist Gas & Cooling System": "Hilfsgas- und Kühlsystem",
  "Precision gas delivery system with automatic pressure control for oxygen, nitrogen, or air assist. Industrial water chiller maintains optimal laser source temperature. Dust extraction system ensures clean cutting environment and protects optical components from contamination.": "Präzisionsgaszufuhrsystem mit automatischer Druckregelung für Sauerstoff, Stickstoff oder Luftunterstützung. ",
  "Watch Our Machine in Action": "Sehen Sie unsere Maschine in Aktion",
  "See the precision and speed of our fiber laser cutting machine in real production": "Erleben Sie die Präzision und Geschwindigkeit unserer Faserlaserschneidemaschine in der realen Produktion",
  "Applications": "Anwendungen",
  "Our fiber laser cutting machines are widely used across various industries for precision metal cutting and complex pattern processing": "Unsere Faserlaser-Schneidemaschinen werden in verschiedenen Branchen zum präzisen Metallschneiden und zur Verarbeitung komplexer Muster eingesetzt",
  "Sheet Metal Fabrication": "Blechbearbeitung",
  "Precision laser cutting of complex patterns, intricate designs, and tight tolerances for custom fabrication": "Präzises Laserschneiden komplexer Muster, komplizierter Designs und enger Toleranzen für kundenspezifische Fertigung",
  "Automotive Parts": "Automobilteile",
  "Manufacturing chassis components, exhaust systems, brackets, and precision automotive parts with tight tolerances": "Herstellung von Fahrwerkskomponenten, Abgassystemen, Halterungen und Präzisionsautoteilen mit engen Toleranzen",
  "Elevator & Escalator": "Aufzug und Rolltreppe",
  "Cutting decorative panels, structural components, and safety parts for elevator and escalator manufacturing": "Schneiden von Dekorplatten, Strukturbauteilen und Sicherheitsteilen für die Herstellung von Aufzügen und Rolltreppen",
  "Electronics Enclosures": "Elektronikgehäuse",
  "Laser cutting of server racks, control panels, electrical cabinets with precise ventilation holes": "Laserschneiden von Serverschränken, Schalttafeln und Schaltschränken mit präzisen Lüftungslöchern",
  "Agricultural Machinery": "Landmaschinen",
  "Manufacturing parts for tractors, harvesters, and farm equipment with complex geometries": "Herstellung von Teilen für Traktoren, Erntemaschinen und Landmaschinen mit komplexen Geometrien",
  "Fitness Equipment": "Fitnessgeräte",
  "Cutting structural frames, decorative covers, and mechanical parts for exercise machines": "Schneiden von Strukturrahmen, dekorativen Abdeckungen und mechanischen Teilen für Trainingsgeräte",
  "Advertising & Signage": "Werbung und Beschilderung",
  "Cutting intricate letters, logos, and decorative metal signs with smooth edges": "Schneiden Sie komplizierte Buchstaben, Logos und dekorative Metallschilder mit glatten Kanten",
  "Kitchen Equipment": "Küchenausstattung",
  "Manufacturing stainless steel sinks, countertops, appliance panels, and commercial kitchen components": "Herstellung von Spülen, Arbeitsplatten, Geräteplatten und Großküchenkomponenten aus Edelstahl",
  "Standard & Optional Configuration": "Standard- und optionale Konfiguration",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Passen Sie Ihre Maschine mit Standardfunktionen und optionalen Upgrades an Ihre spezifischen Anforderungen an",
  "Standard Configuration": "Standardkonfiguration",
  "Optional Upgrades": "Optionale Upgrades",
  "Need help choosing the right configuration?": "Benötigen Sie Hilfe bei der Auswahl der richtigen Konfiguration?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about our fiber laser cutting machines": "Häufige Fragen zu unseren Faserlaserschneidmaschinen",
  "Double table machines typically achieve 40-50% higher productivity than single table machines. The automatic table exchange takes only rapid, and while one table is cutting, the operator can load/unload the other table simultaneously. This eliminates material loading downtime and enables continuous 24/7 operation, making it ideal for high-volume production environments.": "Doppeltischmaschinen erreichen typischerweise eine um 40–50 % höhere Produktivität als Einzeltischmaschinen. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and 12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel, aluminum alloys, copper, brass, and titanium.": "Unsere Faserlaser-Schneidemaschinen können verschiedene Stärken von Kohlenstoffstahl, Edelstahl, Aluminium und 12 mm sowie Kupfer/Messing bis zu 8 mm schneiden (Stärken variieren je nach Laserleistung). ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser gas refills or mirror alignments are needed.": "Faserlaser sind im Vergleich zu CO2-Lasern nahezu wartungsfrei. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization, basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Ja, wir bieten umfassende Unterstützung, einschließlich Installation vor Ort, Maschineninbetriebnahme und Bedienerschulung (normalerweise 3–5 Tage). ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion), assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power consumption and minimal maintenance requirements.": "Zu den Betriebskosten gehören Strom (Faserlaser sind hocheffizient mit ca. 30 % elektrooptischer Umwandlung), Hilfsgas (Stickstoff, Sauerstoff oder Druckluft), Wasserkühlerstrom und gelegentliche Verbrauchsmaterialien (Schutzlinsen, Düsen). ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications or higher power configurations may require 45-60 days. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Maschinen mit Standardkonfiguration werden in der Regel innerhalb von 30–45 Tagen nach Auftragsbestätigung versendet. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Download Technical Brochure": "Laden Sie die technische Broschüre herunter",
  "Get detailed technical specifications, dimensions, and performance data for our fiber laser cutting machines. Download our comprehensive product brochure in PDF format.": "Erhalten Sie detaillierte technische Spezifikationen, Abmessungen und Leistungsdaten für unsere Faserlaserschneidmaschinen. "
}