{
  "Fully Enclosed Fiber Laser Cutting Machine": "Полностью закрытый станок для лазерной резки с оптоволоконным кабелем",
  "Featuring fully enclosed protective housing and high-power fiber laser source, our fully enclosed fiber laser cutting machine delivers maximum safety and exceptional cutting precision with clean, burr-free edges. Class 1 laser safety rating eliminates need for additional barriers.": "Благодаря полностью закрытому защитному корпусу и мощному источнику волоконного лазера наша полностью закрытая машина для резки волоконным лазером обеспечивает максимальную безопасность и исключительную точность резки с чистыми кромками без заусенцев. ",
  "Request Quote": "Запросить цену",
  "Watch Video": "Посмотреть видео",
  "Technical Specifications": "Технические характеристики",
  "High-performance fiber laser cutting system with single table design for efficient metal processing": "Высокопроизводительная система волоконной лазерной резки с одним столом для эффективной обработки металла.",
  "Cutting Capacity": "Режущая способность",
  "Laser Power: Multiple power options": "Мощность лазера: несколько вариантов мощности",
  "Working Area: Customizable dimensions": "Рабочая область: Настраиваемые размеры",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Материал: сталь, нержавеющая сталь, алюминий, медь, латунь.",
  "Max Thickness: Various thickness capabilities": "Максимальная толщина: различные возможности толщины",
  "Control System": "Система управления",
  "CNC System: CypCut or Raytools": "Система ЧПУ: CypCut или Raytools",
  "Cutting Head: Auto-focus": "Режущая головка: автофокус",
  "Positioning Accuracy: High precision": "Точность позиционирования: Высокая точность",
  "Repeat Accuracy: High repeatability": "Точность повторения: Высокая повторяемость",
  "Key Features": "Ключевые особенности",
  "Fiber laser source (maintenance-free)": "Волоконный лазерный источник (необслуживаемый)",
  "Linear motor drive system": "Система линейного привода",
  "Capacitive height sensor": "Емкостный датчик высоты",
  "Cutting speed: High speed capability": "Скорость резания: Высокая скорость",
  "Why Choose Our Fully Enclosed Fiber Laser Cutting Machine?": "Почему стоит выбрать наш полностью закрытый станок для лазерной резки с оптоволоконным кабелем?",
  "Discover the key advantages that make our fiber laser cutting machine the preferred choice for precision metal fabrication and sheet metal processing": "Откройте для себя ключевые преимущества, которые делают нашу машину для лазерной резки предпочтительным выбором для точного изготовления металлов и обработки листового металла.",
  "Class 1 Laser Safety": "Лазерная безопасность класса 1",
  "Complete laser radiation protection meets Class 1 safety standards, eliminating need for additional safety barriers or goggles": "Полная защита от лазерного излучения соответствует стандартам безопасности класса 1, что устраняет необходимость в дополнительных защитных барьерах или очках.",
  "Reduced Noise Levels": "Сниженный уровень шума",
  "Fully enclosed design significantly reduces operating noise, creating a quieter and more comfortable work environment": "Полностью закрытая конструкция значительно снижает рабочий шум, создавая более тихую и комфортную рабочую среду.",
  "Enhanced Dust Control": "Улучшенный контроль пыли",
  "Integrated fume extraction and filtration system keeps workspace clean and protects optical components from contamination": "Встроенная система удаления и фильтрации дыма поддерживает чистоту рабочего места и защищает оптические компоненты от загрязнения.",
  "Temperature Controlled": "Контролируемая температура",
  "Enclosed environment maintains stable temperature, ensuring consistent cutting quality and extended component life": "Закрытая среда поддерживает стабильную температуру, обеспечивая стабильное качество резки и увеличенный срок службы компонентов.",
  "Space Efficient": "Пространство эффективное",
  "No additional safety barriers required, reducing floor space requirements and facility installation costs": "Никаких дополнительных барьеров безопасности не требуется, что снижает требования к занимаемой площади и затраты на установку объекта.",
  "Regulatory Compliance": "Соответствие нормативным требованиям",
  "Meets international laser safety standards, simplifying compliance with workplace safety regulations": "Соответствует международным стандартам лазерной безопасности, что упрощает соблюдение правил техники безопасности на рабочем месте.",
  "Key Components": "Ключевые компоненты",
  "Understanding the core components that deliver precision laser cutting performance and reliability": "Понимание основных компонентов, которые обеспечивают производительность и надежность точной лазерной резки.",
  "Machine Bed & Fully Enclosed": "Станина машины и полностью закрытая",
  "Heavy-duty welded steel frame with stress-relief treatment ensures long-term stability. Single working table with pneumatic clamps for material positioning. Blade-type or strip-type support structure prevents small parts from falling and protects cutting head from collision damage.": "Прочная сварная стальная рама со специальной обработкой обеспечивает долговременную стабильность. ",
  "Fiber Laser Source": "Волоконный лазерный источник",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan. Stable output ensures consistent cutting quality.": "Мощный волоконный лазерный генератор (несколько вариантов мощности) от ведущих производителей, таких как Raycus или IPG. ",
  "CNC Control System": "Система управления ЧПУ",
  "Advanced CNC system (CypCut or Raytools) with intuitive interface for easy programming and operation. Supports complex path planning, automatic nesting, and real-time monitoring. Compatible with standard file formats (DXF, DWG) for seamless CAD/CAM integration.": "Усовершенствованная система ЧПУ (CypCut или Raytools) с интуитивно понятным интерфейсом для простого программирования и эксплуатации. ",
  "Auto-Focus Cutting Head": "Режущая головка с автофокусировкой",
  "Professional auto-focus cutting head with capacitive height sensor for automatic focal length adjustment. Ensures optimal focus position across different material thicknesses. Built-in collision protection and quick lens replacement design minimize downtime.": "Профессиональная режущая головка с автофокусировкой и емкостным датчиком высоты для автоматической регулировки фокусного расстояния. ",
  "Linear Motor Drive System": "Система линейного привода",
  "High-precision linear motor or servo motor drive system with precision ball screws and linear guides. Provides fast acceleration, high positioning accuracy (High precision), and smooth motion control. Dual-drive design ensures synchronized movement and long-term stability.": "Высокоточная система привода линейного двигателя или серводвигателя с прецизионными шариковыми винтами и линейными направляющими. ",
  "Watch Our Machine in Action": "Посмотрите нашу машину в действии",
  "See the precision and speed of our fiber laser cutting machine in real production": "Посмотрите точность и скорость нашего станка для лазерной резки в реальном производстве.",
  "Applications": "Приложения",
  "Our fiber laser cutting machines are widely used across various industries for precision metal cutting and complex pattern processing": "Наши станки для лазерной резки широко используются в различных отраслях промышленности для точной резки металла и обработки сложных рисунков.",
  "Sheet Metal Fabrication": "Изготовление листового металла",
  "Precision laser cutting of complex patterns, intricate designs, and tight tolerances for custom fabrication": "Точная лазерная резка сложных узоров, замысловатых конструкций и жестких допусков для изготовления по индивидуальному заказу.",
  "Automotive Parts": "Автомобильные запчасти",
  "Manufacturing chassis components, exhaust systems, brackets, and precision automotive parts with tight tolerances": "Производство компонентов шасси, выхлопных систем, кронштейнов и прецизионных автомобильных деталей с жесткими допусками.",
  "Elevator & Escalator": "Лифт и Эскалатор",
  "Cutting decorative panels, structural components, and safety parts for elevator and escalator manufacturing": "Резка декоративных панелей, конструктивных элементов и деталей безопасности для производства лифтов и эскалаторов.",
  "Electronics Enclosures": "Корпуса для электроники",
  "Laser cutting of server racks, control panels, electrical cabinets with precise ventilation holes": "Лазерная резка серверных стоек, панелей управления, электрошкафов с точными вентиляционными отверстиями",
  "Agricultural Machinery": "Сельскохозяйственная техника",
  "Manufacturing parts for tractors, harvesters, and farm equipment with complex geometries": "Производство деталей для тракторов, комбайнов и сельскохозяйственной техники сложной геометрии.",
  "Fitness Equipment": "Фитнес-оборудование",
  "Cutting structural frames, decorative covers, and mechanical parts for exercise machines": "Резка каркасов конструкций, декоративных крышек и механических деталей тренажеров.",
  "Advertising & Signage": "Реклама и вывески",
  "Cutting intricate letters, logos, and decorative metal signs with smooth edges": "Вырезание сложных букв, логотипов и декоративных металлических знаков с гладкими краями.",
  "Kitchen Equipment": "Кухонное оборудование",
  "Manufacturing stainless steel sinks, countertops, appliance panels, and commercial kitchen components": "Производство раковин, столешниц, панелей для бытовой техники и компонентов коммерческих кухонь из нержавеющей стали.",
  "Standard & Optional Configuration": "Стандартная и дополнительная конфигурация",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Настройте свою машину с помощью стандартных функций и дополнительных обновлений в соответствии с вашими конкретными требованиями.",
  "Standard Configuration": "Стандартная конфигурация",
  "Optional Upgrades": "Дополнительные обновления",
  "Need help choosing the right configuration?": "Нужна помощь в выборе правильной конфигурации?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about our fiber laser cutting machines": "Общие вопросы о наших станках для лазерной резки",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing productivity by reducing idle time.": "Станки для лазерной резки с одним столом имеют один фиксированный рабочий стол, что является более экономичным решением, подходящим для небольших и средних объемов производства. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and 12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel, aluminum alloys, copper, brass, and titanium.": "Наши станки для резки волоконным лазером могут резать углеродистую сталь, нержавеющую сталь, алюминий толщиной до 12 мм, а также медь/латунь толщиной до 8 мм (толщина варьируется в зависимости от мощности лазера). ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser gas refills or mirror alignments are needed.": "Волоконные лазеры практически не требуют обслуживания по сравнению с CO2-лазерами. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization, basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Да, мы предоставляем комплексную поддержку, включая установку на месте, ввод машины в эксплуатацию и обучение операторов (обычно 3–5 дней). ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion), assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power consumption and minimal maintenance requirements.": "Эксплуатационные затраты включают электроэнергию (волоконные лазеры высокоэффективны с электрооптическим преобразованием ~30%), вспомогательный газ (азот, кислород или сжатый воздух), электроэнергию для водяного охлаждения и периодические расходные материалы (защитные линзы, насадки). ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications or higher power configurations may require 45-60 days. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Машины стандартной конфигурации обычно отправляются в течение 30–45 дней после подтверждения заказа. ",
  "Still have questions?": "Остались вопросы?",
  "Download Technical Brochure": "Загрузить техническую брошюру",
  "Get detailed technical specifications, dimensions, and performance data for our fiber laser cutting machines. Download our comprehensive product brochure in PDF format.": "Получите подробные технические характеристики, размеры и характеристики наших станков для лазерной резки. "
}