{
  "Fully Enclosed Fiber Laser Cutting Machine": "Máquina cortadora por láser de fibra completamente cerrada",
  "Featuring fully enclosed protective housing and high-power fiber laser source, our fully enclosed fiber laser cutting machine delivers maximum safety and exceptional cutting precision with clean, burr-free edges. Class 1 laser safety rating eliminates need for additional barriers.": "Con una carcasa protectora completamente cerrada y una fuente láser de fibra de alta potencia, nuestra máquina cortadora por láser de fibra completamente cerrada ofrece máxima seguridad y precisión de corte excepcional con bordes limpios y sin rebabas. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "High-performance fiber laser cutting system with single table design for efficient metal processing": "Sistema de corte por láser de fibra de alto rendimiento con diseño de mesa única para un procesamiento eficiente de metales",
  "Cutting Capacity": "Capacidad de corte",
  "Laser Power: Multiple power options": "Potencia del láser: múltiples opciones de potencia",
  "Working Area: Customizable dimensions": "Área de trabajo: dimensiones personalizables",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Material: acero, inoxidable, aluminio, cobre, latón",
  "Max Thickness: Various thickness capabilities": "Espesor máximo: varias capacidades de espesor",
  "Control System": "Sistema de control",
  "CNC System: CypCut or Raytools": "Sistema CNC: CypCut o Raytools",
  "Cutting Head: Auto-focus": "Cabezal de corte: enfoque automático",
  "Positioning Accuracy: High precision": "Precisión de posicionamiento: alta precisión",
  "Repeat Accuracy: High repeatability": "Precisión de repetición: Alta repetibilidad",
  "Key Features": "Características clave",
  "Fiber laser source (maintenance-free)": "Fuente láser de fibra (sin mantenimiento)",
  "Linear motor drive system": "Sistema de accionamiento de motor lineal",
  "Capacitive height sensor": "Sensor de altura capacitivo",
  "Cutting speed: High speed capability": "Velocidad de corte: Capacidad de alta velocidad",
  "Why Choose Our Fully Enclosed Fiber Laser Cutting Machine?": "¿Por qué elegir nuestra máquina cortadora por láser de fibra completamente cerrada?",
  "Discover the key advantages that make our fiber laser cutting machine the preferred choice for precision metal fabrication and sheet metal processing": "Descubra las ventajas clave que hacen de nuestra máquina de corte por láser de fibra la opción preferida para la fabricación de metales de precisión y el procesamiento de chapa metálica.",
  "Class 1 Laser Safety": "Seguridad láser clase 1",
  "Complete laser radiation protection meets Class 1 safety standards, eliminating need for additional safety barriers or goggles": "La protección completa contra la radiación láser cumple con los estándares de seguridad de Clase 1, lo que elimina la necesidad de barreras o gafas de seguridad adicionales.",
  "Reduced Noise Levels": "Niveles de ruido reducidos",
  "Fully enclosed design significantly reduces operating noise, creating a quieter and more comfortable work environment": "El diseño completamente cerrado reduce significativamente el ruido de funcionamiento, creando un ambiente de trabajo más silencioso y cómodo.",
  "Enhanced Dust Control": "Control de polvo mejorado",
  "Integrated fume extraction and filtration system keeps workspace clean and protects optical components from contamination": "El sistema integrado de extracción y filtración de humos mantiene limpio el espacio de trabajo y protege los componentes ópticos de la contaminación.",
  "Temperature Controlled": "Temperatura controlada",
  "Enclosed environment maintains stable temperature, ensuring consistent cutting quality and extended component life": "El entorno cerrado mantiene una temperatura estable, lo que garantiza una calidad de corte constante y una mayor vida útil de los componentes.",
  "Space Efficient": "Espacio eficiente",
  "No additional safety barriers required, reducing floor space requirements and facility installation costs": "No se requieren barreras de seguridad adicionales, lo que reduce los requisitos de espacio y los costos de instalación de las instalaciones.",
  "Regulatory Compliance": "Cumplimiento normativo",
  "Meets international laser safety standards, simplifying compliance with workplace safety regulations": "Cumple con los estándares internacionales de seguridad láser, lo que simplifica el cumplimiento de las normas de seguridad en el lugar de trabajo.",
  "Key Components": "Componentes clave",
  "Understanding the core components that deliver precision laser cutting performance and reliability": "Comprender los componentes principales que ofrecen rendimiento y confiabilidad en el corte por láser de precisión",
  "Machine Bed & Fully Enclosed": "Cama de máquina y completamente cerrada",
  "Heavy-duty welded steel frame with stress-relief treatment ensures long-term stability. Single working table with pneumatic clamps for material positioning. Blade-type or strip-type support structure prevents small parts from falling and protects cutting head from collision damage.": "El marco de acero soldado de alta resistencia con tratamiento de alivio de tensión garantiza estabilidad a largo plazo. ",
  "Fiber Laser Source": "Fuente láser de fibra",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan. Stable output ensures consistent cutting quality.": "Generador láser de fibra de alta potencia (múltiples opciones de potencia) de fabricantes líderes como Raycus o IPG. ",
  "CNC Control System": "Sistema de control CNC",
  "Advanced CNC system (CypCut or Raytools) with intuitive interface for easy programming and operation. Supports complex path planning, automatic nesting, and real-time monitoring. Compatible with standard file formats (DXF, DWG) for seamless CAD/CAM integration.": "Sistema CNC avanzado (CypCut o Raytools) con interfaz intuitiva para una fácil programación y operación. ",
  "Auto-Focus Cutting Head": "Cabezal de corte con enfoque automático",
  "Professional auto-focus cutting head with capacitive height sensor for automatic focal length adjustment. Ensures optimal focus position across different material thicknesses. Built-in collision protection and quick lens replacement design minimize downtime.": "Cabezal de corte profesional con enfoque automático y sensor de altura capacitivo para ajuste automático de la distancia focal. ",
  "Linear Motor Drive System": "Sistema de accionamiento de motor lineal",
  "High-precision linear motor or servo motor drive system with precision ball screws and linear guides. Provides fast acceleration, high positioning accuracy (High precision), and smooth motion control. Dual-drive design ensures synchronized movement and long-term stability.": "Sistema de accionamiento por motor lineal o servomotor de alta precisión con husillos de bolas de precisión y guías lineales. ",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "See the precision and speed of our fiber laser cutting machine in real production": "Vea la precisión y velocidad de nuestra máquina de corte por láser de fibra en producción real",
  "Applications": "Aplicaciones",
  "Our fiber laser cutting machines are widely used across various industries for precision metal cutting and complex pattern processing": "Nuestras máquinas de corte por láser de fibra se utilizan ampliamente en diversas industrias para el corte de metales de precisión y el procesamiento de patrones complejos.",
  "Sheet Metal Fabrication": "Fabricación de chapa metálica",
  "Precision laser cutting of complex patterns, intricate designs, and tight tolerances for custom fabrication": "Corte láser de precisión de patrones complejos, diseños intrincados y tolerancias estrictas para fabricación personalizada",
  "Automotive Parts": "Piezas automotrices",
  "Manufacturing chassis components, exhaust systems, brackets, and precision automotive parts with tight tolerances": "Fabricación de componentes de chasis, sistemas de escape, soportes y piezas automotrices de precisión con tolerancias estrictas.",
  "Elevator & Escalator": "Ascensor y escalera mecánica",
  "Cutting decorative panels, structural components, and safety parts for elevator and escalator manufacturing": "Corte de paneles decorativos, componentes estructurales y piezas de seguridad para la fabricación de ascensores y escaleras mecánicas.",
  "Electronics Enclosures": "Cajas electrónicas",
  "Laser cutting of server racks, control panels, electrical cabinets with precise ventilation holes": "Corte por láser de racks de servidores, paneles de control y armarios eléctricos con orificios de ventilación precisos.",
  "Agricultural Machinery": "Maquinaria agrícola",
  "Manufacturing parts for tractors, harvesters, and farm equipment with complex geometries": "Fabricación de piezas para tractores, cosechadoras y equipos agrícolas con geometrías complejas.",
  "Fitness Equipment": "Equipo de gimnasia",
  "Cutting structural frames, decorative covers, and mechanical parts for exercise machines": "Corte de marcos estructurales, cubiertas decorativas y piezas mecánicas para máquinas de ejercicio.",
  "Advertising & Signage": "Publicidad y Señalización",
  "Cutting intricate letters, logos, and decorative metal signs with smooth edges": "Cortar letras, logotipos y letreros metálicos decorativos intrincados con bordes lisos",
  "Kitchen Equipment": "Equipo de cocina",
  "Manufacturing stainless steel sinks, countertops, appliance panels, and commercial kitchen components": "Fabricación de fregaderos, encimeras, paneles de electrodomésticos y componentes de cocinas comerciales de acero inoxidable.",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personalice su máquina con funciones estándar y actualizaciones opcionales para satisfacer sus requisitos específicos",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our fiber laser cutting machines": "Preguntas comunes sobre nuestras máquinas de corte por láser de fibra",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing productivity by reducing idle time.": "Las máquinas de corte por láser de mesa única tienen una mesa de trabajo fija, lo que ofrece una solución más económica adecuada para volúmenes de producción bajos a medios. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and 12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel, aluminum alloys, copper, brass, and titanium.": "Nuestras máquinas de corte por láser de fibra pueden cortar varios espesores de acero al carbono, acero inoxidable, aluminio y 12 mm, y cobre/latón hasta 8 mm (los espesores varían según la potencia del láser). ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser gas refills or mirror alignments are needed.": "Los láseres de fibra prácticamente no requieren mantenimiento en comparación con los láseres de CO2. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization, basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Sí, brindamos soporte integral que incluye instalación en el sitio, puesta en marcha de la máquina y capacitación del operador (generalmente de 3 a 5 días). ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion), assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power consumption and minimal maintenance requirements.": "Los costos operativos incluyen electricidad (los láseres de fibra son altamente eficientes con ~30% de conversión electroóptica), gas auxiliar (nitrógeno, oxígeno o aire comprimido), electricidad para enfriadores de agua y consumibles ocasionales (lentes protectoras, boquillas). ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications or higher power configurations may require 45-60 days. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Las máquinas de configuración estándar generalmente se envían entre 30 y 45 días después de la confirmación del pedido. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Get detailed technical specifications, dimensions, and performance data for our fiber laser cutting machines. Download our comprehensive product brochure in PDF format.": "Obtenga especificaciones técnicas detalladas, dimensiones y datos de rendimiento de nuestras máquinas de corte por láser de fibra. "
}