{
  "Plate and Tube Integrated Laser Cutting Machine": "Integrierte Laserschneidmaschine für Platten und Rohre",
  "Revolutionary 2-in-1 fiber laser cutting system that combines plate and tube cutting capabilities. Features a 10-second exchange platform for seamless mode switching between sheet metal and tube processing. One machine, unlimited possibilities for maximum versatility and space efficiency.": "Revolutionäres 2-in-1-Faserlaserschneidsystem, das Platten- und Rohrschneidfunktionen kombiniert. ",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "Dual-purpose integrated laser cutting system with quick-change platform for plates and tubes": "Integriertes Laserschneidsystem für zwei Zwecke mit Schnellwechselplattform für Platten und Rohre",
  "Plate Cutting Capacity": "Plattenschneidkapazität",
  "Laser Power: Multiple power options": "Laserleistung: Mehrere Leistungsoptionen",
  "Working Area: Customizable dimensions": "Arbeitsbereich: Anpassbare Abmessungen",
  "Max Thickness: Various thicknesses": "Maximale Dicke: Verschiedene Stärken",
  "Positioning Accuracy: High precision": "Positionierungsgenauigkeit: Hohe Präzision",
  "Tube Cutting Capacity": "Rohrschneidkapazität",
  "Tube Diameter: Customizable tube diameter": "Rohrdurchmesser: Anpassbarer Rohrdurchmesser",
  "Max Tube Length: Customizable length": "Maximale Rohrlänge: Anpassbare Länge",
  "Shapes: Round, Square, Rectangle": "Formen: Rund, Quadrat, Rechteck",
  "Wall Thickness: Various wall thickness": "Wandstärke: Verschiedene Wandstärken",
  "System Features": "Systemfunktionen",
  "rapid exchange platform": "schnelle Austauschplattform",
  "Auto-focus cutting head": "Autofokus-Schneidkopf",
  "Four-chuck tube clamping": "Rohrspannung mit vier Spannfuttern",
  "CNC control system": "CNC-Steuerungssystem",
  "Why Choose Our Integrated Laser Cutting Machine?": "Warum sollten Sie sich für unsere integrierte Laserschneidmaschine entscheiden?",
  "Discover the revolutionary advantages of combining plate and tube cutting in one versatile machine for ultimate productivity and cost savings": "Entdecken Sie die revolutionären Vorteile der Kombination von Platten- und Rohrschneiden in einer vielseitigen Maschine für ultimative Produktivität und Kosteneinsparungen",
  "Dual Functionality": "Doppelte Funktionalität",
  "One machine handles both plate and tube cutting, eliminating the need for separate equipment and maximizing workshop versatility": "Eine Maschine übernimmt sowohl das Blech- als auch das Rohrschneiden, sodass keine separate Ausrüstung erforderlich ist und die Vielseitigkeit der Werkstatt maximiert wird",
  "Quick Mode Switching": "Schneller Moduswechsel",
  "10-second exchange platform allows seamless transition between plate and tube cutting modes for uninterrupted production": "Die 10-Sekunden-Austauschplattform ermöglicht einen nahtlosen Übergang zwischen Platten- und Rohrschneidemodi für eine unterbrechungsfreie Produktion",
  "Space Efficiency": "Raumeffizienz",
  "Reduces factory footprint by 50% compared to separate machines, freeing up valuable production space for other operations": "Reduziert die Stellfläche im Werk um 50 % im Vergleich zu separaten Maschinen und gibt so wertvolle Produktionsfläche für andere Vorgänge frei",
  "Cost Savings": "Kosteneinsparungen",
  "Invest in one machine instead of two, reducing capital costs, maintenance expenses, and operating overhead significantly": "Investieren Sie in eine Maschine statt in zwei und reduzieren Sie so die Kapitalkosten, die Wartungskosten und die Betriebsgemeinkosten erheblich",
  "High Precision": "Hohe Präzision",
  "Positioning accuracy of High precision for both plates and tubes ensures consistent quality across all cutting operations": "Die hohe Positionierungsgenauigkeit von Platten und Rohren gewährleistet eine gleichbleibende Qualität bei allen Schneidvorgängen",
  "Improved Efficiency": "Verbesserte Effizienz",
  "Process diverse projects without machine changeover, reducing downtime and increasing overall production throughput": "Verarbeiten Sie vielfältige Projekte ohne Maschinenwechsel, reduzieren Sie Ausfallzeiten und erhöhen Sie den Gesamtproduktionsdurchsatz",
  "Key Components": "Schlüsselkomponenten",
  "Understanding the integrated system that enables dual-mode cutting performance and quick platform exchange": "Verständnis des integrierten Systems, das eine Dual-Mode-Schneidleistung und einen schnellen Plattformwechsel ermöglicht",
  "Fiber Laser Source": "Faserlaserquelle",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Single laser source serves both plate and tube cutting modes with automatic parameter adjustment. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan for both applications.": "Hochleistungs-Faserlasergenerator (mehrere Leistungsoptionen) von führenden Herstellern wie Raycus oder IPG. ",
  "Exchange Platform": "Austauschplattform",
  "Revolutionary quick-change platform system enables seamless switching between plate and tube cutting modes in just 10 seconds. Automated positioning ensures precise alignment after every exchange. Robust mechanical design withstands frequent mode changes while maintaining accuracy. Integrated sensors verify proper platform installation before cutting begins.": "Das revolutionäre Schnellwechselplattformsystem ermöglicht den nahtlosen Wechsel zwischen Platten- und Rohrschneidemodus in nur 10 Sekunden. ",
  "Universal Auto-Focus Cutting Head": "Universeller Autofokus-Schneidkopf",
  "Professional auto-focus cutting head optimized for both flat plate and tubular cutting. Capacitive height sensor automatically adjusts focal position for different material thicknesses and tube diameters. Built-in collision protection safeguards the head during mode switching. Quick lens replacement design minimizes maintenance downtime for both applications.": "Professioneller Autofokus-Schneidkopf, optimiert für das Schneiden von Flachplatten und Rohren. ",
  "Integrated Bed & Chuck System": "Integriertes Bett- und Spannfuttersystem",
  "Heavy-duty welded steel frame accommodates both plate cutting table and tube chuck assembly. Quick-release mechanism enables rapid platform exchange. Four-chuck pneumatic clamping system for tube mode provides stable positioning. Blade-type plate support prevents small part drop-through. Single frame design ensures consistent positioning accuracy across both modes.": "Der robuste Rahmen aus geschweißtem Stahl bietet Platz für den Plattenschneidetisch und die Rohrspannvorrichtung. ",
  "Watch Our Machine in Action": "Sehen Sie unsere Maschine in Aktion",
  "See the versatility and quick platform exchange of our integrated laser cutting machine": "Entdecken Sie die Vielseitigkeit und den schnellen Plattformwechsel unserer integrierten Laserschneidmaschine",
  "Applications": "Anwendungen",
  "The integrated plate and tube laser cutting machine serves industries requiring both sheet metal and tubular component fabrication": "Die integrierte Laserschneidmaschine für Platten und Rohre bedient Branchen, in denen sowohl Blech- als auch Rohrkomponenten hergestellt werden müssen",
  "Automotive Manufacturing": "Automobilbau",
  "Cutting chassis plates, structural tubes, exhaust pipes, and brackets in one integrated production line": "Schneiden von Chassisplatten, Strukturrohren, Auspuffrohren und Halterungen in einer integrierten Produktionslinie",
  "Furniture Industry": "Möbelindustrie",
  "Manufacturing both sheet metal panels and tubular frames for office furniture, shelving systems, and decorative items": "Herstellung von Blechpaneelen und Rohrrahmen für Büromöbel, Regalsysteme und Dekorationsartikel",
  "Construction Equipment": "Baumaschinen",
  "Processing both structural steel plates and tubular supports for heavy machinery and construction equipment": "Wir verarbeiten sowohl Baustahlplatten als auch Rohrstützen für schwere Maschinen und Baugeräte",
  "Fitness Equipment": "Fitnessgeräte",
  "Cutting tubular frames and sheet metal covers for gym equipment, exercise machines, and weight training apparatus": "Schneiden von Rohrrahmen und Blechabdeckungen für Fitnessgeräte, Trainingsgeräte und Krafttrainingsgeräte",
  "Metal Fabrication Shops": "Metallverarbeitungsbetriebe",
  "Job shops requiring flexibility to process diverse customer orders involving both plates and tubes": "Lohnfertigungsbetriebe, die Flexibilität benötigen, um verschiedene Kundenaufträge zu bearbeiten, die sowohl Platten als auch Rohre umfassen",
  "Agricultural Machinery": "Landmaschinen",
  "Manufacturing both sheet metal body panels and tubular structural frames for tractors and farm equipment": "Herstellung sowohl von Karosserieteilen aus Blech als auch von Rohrrahmen für Traktoren und landwirtschaftliche Geräte",
  "HVAC Systems": "HVAC-Systeme",
  "Cutting ductwork panels and ventilation tubes for heating, ventilation, and air conditioning systems": "Schneiden von Kanalplatten und Lüftungsrohren für Heizungs-, Lüftungs- und Klimaanlagen",
  "Steel Structure Buildings": "Gebäude mit Stahlkonstruktion",
  "Processing both structural steel plates and tubular columns for prefabricated building construction": "Verarbeitung sowohl von Baustahlplatten als auch von Rohrstützen für den Fertigbau",
  "Standard & Optional Configuration": "Standard- und optionale Konfiguration",
  "Customize your integrated machine with standard features and optional upgrades for both plate and tube cutting": "Passen Sie Ihre integrierte Maschine mit Standardfunktionen und optionalen Upgrades für das Schneiden von Platten und Rohren individuell an",
  "Standard Configuration": "Standardkonfiguration",
  "Optional Upgrades": "Optionale Upgrades",
  "Need help choosing the right configuration?": "Benötigen Sie Hilfe bei der Auswahl der richtigen Konfiguration?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about our plate and tube integrated laser cutting machines": "Häufige Fragen zu unseren integrierten Laserschneidmaschinen für Bleche und Rohre",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the desired mode (plate or tube) on the control panel, and the machine automatically releases the current platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "Die Wechselplattform nutzt ein automatisiertes Schnellwechselsystem mit präziser Positionierung. ",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head, and control system for both applications. The CNC system automatically optimizes parameters for each mode. Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across all operations.": "Ja, die Schnittqualität ist in beiden Modi identisch. ",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines. Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most customers see ROI within 18-24 months compared to buying two separate systems.": "Die integrierte Maschine kostet in der Regel 30–40 % weniger als der Kauf separater Platten- und Rohrschneidemaschinen. ",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day. Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production orders without significant downtime.": "Absolut! ",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines. Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and dust extractors, which are shared between both modes.": "Die integrierte Maschine benötigt etwa 50 % weniger Stellfläche als separate Platten- und Rohrmaschinen. ",
  "Training is actually simplified because operators learn one control system for both functions. The interface is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient in both modes within 3-5 days of training. The unified control system means operators don't need to learn two different machines, reducing the overall training burden.": "Die Schulung wird tatsächlich vereinfacht, da die Bediener ein Steuerungssystem für beide Funktionen erlernen. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Download Technical Brochure": "Laden Sie die technische Broschüre herunter",
  "Get detailed technical specifications, dimensions, and performance data for our integrated plate and tube laser cutting machines. Download our comprehensive product brochure in PDF format.": "Erhalten Sie detaillierte technische Spezifikationen, Abmessungen und Leistungsdaten für unsere integrierten Laserschneidmaschinen für Platten und Rohre. "
}