{
  "Plate and Tube Integrated Laser Cutting Machine": "Máquina cortadora láser integrada de placas y tubos",
  "Revolutionary 2-in-1 fiber laser cutting system that combines plate and tube cutting capabilities. Features a 10-second exchange platform for seamless mode switching between sheet metal and tube processing. One machine, unlimited possibilities for maximum versatility and space efficiency.": "Revolucionario sistema de corte por láser de fibra 2 en 1 que combina capacidades de corte de placas y tubos. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "Dual-purpose integrated laser cutting system with quick-change platform for plates and tubes": "Sistema de corte por láser integrado de doble propósito con plataforma de cambio rápido para placas y tubos",
  "Plate Cutting Capacity": "Capacidad de corte de placas",
  "Laser Power: Multiple power options": "Potencia del láser: múltiples opciones de potencia",
  "Working Area: Customizable dimensions": "Área de trabajo: dimensiones personalizables",
  "Max Thickness: Various thicknesses": "Espesor máximo: varios espesores",
  "Positioning Accuracy: High precision": "Precisión de posicionamiento: alta precisión",
  "Tube Cutting Capacity": "Capacidad de corte de tubos",
  "Tube Diameter: Customizable tube diameter": "Diámetro del tubo: Diámetro del tubo personalizable",
  "Max Tube Length: Customizable length": "Longitud máxima del tubo: longitud personalizable",
  "Shapes: Round, Square, Rectangle": "Formas: Redonda, Cuadrada, Rectángulo",
  "Wall Thickness: Various wall thickness": "Espesor de pared: Varios espesores de pared",
  "System Features": "Características del sistema",
  "rapid exchange platform": "plataforma de intercambio rápido",
  "Auto-focus cutting head": "Cabezal de corte con enfoque automático",
  "Four-chuck tube clamping": "Sujeción de tubos con cuatro mandriles",
  "CNC control system": "sistema de control cnc",
  "Why Choose Our Integrated Laser Cutting Machine?": "¿Por qué elegir nuestra máquina de corte por láser integrada?",
  "Discover the revolutionary advantages of combining plate and tube cutting in one versatile machine for ultimate productivity and cost savings": "Descubra las revolucionarias ventajas de combinar el corte de placas y tubos en una máquina versátil para lograr la máxima productividad y ahorro de costos.",
  "Dual Functionality": "Doble funcionalidad",
  "One machine handles both plate and tube cutting, eliminating the need for separate equipment and maximizing workshop versatility": "Una máquina se encarga del corte de placas y tubos, lo que elimina la necesidad de equipos separados y maximiza la versatilidad del taller.",
  "Quick Mode Switching": "Cambio de modo rápido",
  "10-second exchange platform allows seamless transition between plate and tube cutting modes for uninterrupted production": "La plataforma de intercambio de 10 segundos permite una transición perfecta entre los modos de corte de placas y tubos para una producción ininterrumpida.",
  "Space Efficiency": "Eficiencia espacial",
  "Reduces factory footprint by 50% compared to separate machines, freeing up valuable production space for other operations": "Reduce el espacio físico de la fábrica en un 50 % en comparación con máquinas separadas, lo que libera un valioso espacio de producción para otras operaciones.",
  "Cost Savings": "Ahorro de costos",
  "Invest in one machine instead of two, reducing capital costs, maintenance expenses, and operating overhead significantly": "Invierta en una máquina en lugar de dos, reduciendo significativamente los costos de capital, los gastos de mantenimiento y los gastos operativos.",
  "High Precision": "Alta precisión",
  "Positioning accuracy of High precision for both plates and tubes ensures consistent quality across all cutting operations": "Precisión de posicionamiento de alta precisión tanto para placas como para tubos garantiza una calidad constante en todas las operaciones de corte.",
  "Improved Efficiency": "Eficiencia mejorada",
  "Process diverse projects without machine changeover, reducing downtime and increasing overall production throughput": "Procese diversos proyectos sin cambiar de máquina, reduciendo el tiempo de inactividad y aumentando el rendimiento general de la producción.",
  "Key Components": "Componentes clave",
  "Understanding the integrated system that enables dual-mode cutting performance and quick platform exchange": "Comprender el sistema integrado que permite un rendimiento de corte en modo dual y un rápido intercambio de plataforma",
  "Fiber Laser Source": "Fuente láser de fibra",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Single laser source serves both plate and tube cutting modes with automatic parameter adjustment. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan for both applications.": "Generador láser de fibra de alta potencia (múltiples opciones de potencia) de fabricantes líderes como Raycus o IPG. ",
  "Exchange Platform": "Plataforma de intercambio",
  "Revolutionary quick-change platform system enables seamless switching between plate and tube cutting modes in just 10 seconds. Automated positioning ensures precise alignment after every exchange. Robust mechanical design withstands frequent mode changes while maintaining accuracy. Integrated sensors verify proper platform installation before cutting begins.": "El revolucionario sistema de plataforma de cambio rápido permite cambiar sin problemas entre los modos de corte de placa y tubo en solo 10 segundos. ",
  "Universal Auto-Focus Cutting Head": "Cabezal de corte universal con enfoque automático",
  "Professional auto-focus cutting head optimized for both flat plate and tubular cutting. Capacitive height sensor automatically adjusts focal position for different material thicknesses and tube diameters. Built-in collision protection safeguards the head during mode switching. Quick lens replacement design minimizes maintenance downtime for both applications.": "Cabezal de corte profesional con enfoque automático optimizado para corte de placas planas y tubulares. ",
  "Integrated Bed & Chuck System": "Sistema integrado de cama y mandril",
  "Heavy-duty welded steel frame accommodates both plate cutting table and tube chuck assembly. Quick-release mechanism enables rapid platform exchange. Four-chuck pneumatic clamping system for tube mode provides stable positioning. Blade-type plate support prevents small part drop-through. Single frame design ensures consistent positioning accuracy across both modes.": "El marco de acero soldado de alta resistencia admite tanto la mesa de corte de placas como el conjunto de mandril de tubo. ",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "See the versatility and quick platform exchange of our integrated laser cutting machine": "Vea la versatilidad y el rápido cambio de plataforma de nuestra máquina de corte por láser integrada",
  "Applications": "Aplicaciones",
  "The integrated plate and tube laser cutting machine serves industries requiring both sheet metal and tubular component fabrication": "La máquina de corte por láser integrada de placas y tubos sirve a industrias que requieren la fabricación de componentes tubulares y de chapa metálica.",
  "Automotive Manufacturing": "Fabricación de automóviles",
  "Cutting chassis plates, structural tubes, exhaust pipes, and brackets in one integrated production line": "Corte de placas de chasis, tubos estructurales, tubos de escape y soportes en una línea de producción integrada",
  "Furniture Industry": "Industria del mueble",
  "Manufacturing both sheet metal panels and tubular frames for office furniture, shelving systems, and decorative items": "Fabricación tanto de paneles de chapa como de estructuras tubulares para mobiliario de oficina, estanterías y artículos decorativos.",
  "Construction Equipment": "Equipo de construcción",
  "Processing both structural steel plates and tubular supports for heavy machinery and construction equipment": "Procesamiento tanto de placas de acero estructural como de soportes tubulares para maquinaria pesada y equipos de construcción.",
  "Fitness Equipment": "Equipo de gimnasia",
  "Cutting tubular frames and sheet metal covers for gym equipment, exercise machines, and weight training apparatus": "Corte de estructuras tubulares y cubiertas de chapa para equipos de gimnasio, máquinas de ejercicio y aparatos de entrenamiento con pesas.",
  "Metal Fabrication Shops": "Talleres de fabricación de metales",
  "Job shops requiring flexibility to process diverse customer orders involving both plates and tubes": "Talleres que requieren flexibilidad para procesar diversos pedidos de clientes que involucran tanto placas como tubos",
  "Agricultural Machinery": "Maquinaria agrícola",
  "Manufacturing both sheet metal body panels and tubular structural frames for tractors and farm equipment": "Fabricación tanto de paneles de carrocería de chapa como de bastidores estructurales tubulares para tractores y maquinaria agrícola.",
  "HVAC Systems": "Sistemas HVAC",
  "Cutting ductwork panels and ventilation tubes for heating, ventilation, and air conditioning systems": "Corte de paneles de conductos y tubos de ventilación para sistemas de calefacción, ventilación y aire acondicionado.",
  "Steel Structure Buildings": "Edificios con estructura de acero",
  "Processing both structural steel plates and tubular columns for prefabricated building construction": "Procesamiento tanto de placas de acero estructural como de columnas tubulares para la construcción de edificios prefabricados.",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your integrated machine with standard features and optional upgrades for both plate and tube cutting": "Personalice su máquina integrada con características estándar y actualizaciones opcionales para corte de placas y tubos.",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our plate and tube integrated laser cutting machines": "Preguntas comunes sobre nuestras máquinas de corte por láser integradas de placas y tubos",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the desired mode (plate or tube) on the control panel, and the machine automatically releases the current platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "La plataforma de intercambio utiliza un sistema automatizado de cambio rápido con posicionamiento de precisión. ",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head, and control system for both applications. The CNC system automatically optimizes parameters for each mode. Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across all operations.": "Sí, la calidad de corte es idéntica en ambos modos. ",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines. Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most customers see ROI within 18-24 months compared to buying two separate systems.": "La máquina integrada suele costar entre un 30 y un 40 % menos que comprar máquinas cortadoras de placas y tubos por separado. ",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day. Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production orders without significant downtime.": "¡Absolutamente! ",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines. Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and dust extractors, which are shared between both modes.": "La máquina integrada requiere aproximadamente un 50% menos de espacio que las máquinas de placas y tubos separadas. ",
  "Training is actually simplified because operators learn one control system for both functions. The interface is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient in both modes within 3-5 days of training. The unified control system means operators don't need to learn two different machines, reducing the overall training burden.": "En realidad, la formación se simplifica porque los operadores aprenden un sistema de control para ambas funciones. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Get detailed technical specifications, dimensions, and performance data for our integrated plate and tube laser cutting machines. Download our comprehensive product brochure in PDF format.": "Obtenga especificaciones técnicas detalladas, dimensiones y datos de rendimiento para nuestras máquinas de corte por láser integradas de placas y tubos. "
}