{
  "Plate and Tube Integrated Laser Cutting Machine": "プレートとチューブ一体型レーザー切断機",
  "Revolutionary 2-in-1 fiber laser cutting system that combines plate and tube cutting capabilities. Features a 10-second exchange platform for seamless mode switching between sheet metal and tube processing. One machine, unlimited possibilities for maximum versatility and space efficiency.": "プレートとチューブの切断機能を組み合わせた革新的な 2-in-1 ファイバー レーザー切断システム。",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "Dual-purpose integrated laser cutting system with quick-change platform for plates and tubes": "プレートとチューブ用のクイックチェンジプラットフォームを備えたデュアル目的統合レーザー切断システム",
  "Plate Cutting Capacity": "プレート切断能力",
  "Laser Power: Multiple power options": "レーザー出力: 複数の出力オプション",
  "Working Area: Customizable dimensions": "作業領域: カスタマイズ可能な寸法",
  "Max Thickness: Various thicknesses": "最大厚さ: さまざまな厚さ",
  "Positioning Accuracy: High precision": "位置決め精度：高精度",
  "Tube Cutting Capacity": "チューブ切断能力",
  "Tube Diameter: Customizable tube diameter": "チューブ直径: カスタマイズ可能なチューブ直径",
  "Max Tube Length: Customizable length": "最大チューブ長: カスタマイズ可能な長さ",
  "Shapes: Round, Square, Rectangle": "形状: 円形、正方形、長方形",
  "Wall Thickness: Various wall thickness": "肉厚: さまざまな肉厚",
  "System Features": "システムの特徴",
  "rapid exchange platform": "迅速な交換プラットフォーム",
  "Auto-focus cutting head": "オートフォーカスカッティングヘッド",
  "Four-chuck tube clamping": "4チャックでチューブをクランプ",
  "CNC control system": "CNC制御システム",
  "Why Choose Our Integrated Laser Cutting Machine?": "当社の一体型レーザー切断機を選ぶ理由?",
  "Discover the revolutionary advantages of combining plate and tube cutting in one versatile machine for ultimate productivity and cost savings": "プレートとチューブの切断を 1 台の多用途機械で組み合わせて究極の生産性とコスト削減を実現する革新的な利点を発見してください。",
  "Dual Functionality": "二重機能",
  "One machine handles both plate and tube cutting, eliminating the need for separate equipment and maximizing workshop versatility": "1 台の機械でプレートとチューブの切断の両方を処理できるため、別個の機器が不要になり、工場の汎用性が最大化されます。",
  "Quick Mode Switching": "クイックモード切り替え",
  "10-second exchange platform allows seamless transition between plate and tube cutting modes for uninterrupted production": "10 秒間の交換プラットフォームにより、プレート切断モードとチューブ切断モード間のシームレスな移行が可能になり、生産が中断されません。",
  "Space Efficiency": "スペース効率",
  "Reduces factory footprint by 50% compared to separate machines, freeing up valuable production space for other operations": "個別の機械と比較して工場の設置面積を 50% 削減し、貴重な生産スペースを他の作業に確保します。",
  "Cost Savings": "コスト削減",
  "Invest in one machine instead of two, reducing capital costs, maintenance expenses, and operating overhead significantly": "2 台のマシンではなく 1 台のマシンに投資し、資本コスト、メンテナンス費用、運用経費を大幅に削減します。",
  "High Precision": "高精度",
  "Positioning accuracy of High precision for both plates and tubes ensures consistent quality across all cutting operations": "プレートとチューブの両方で高精度の位置決め精度により、すべての切断作業で一貫した品質を保証します",
  "Improved Efficiency": "効率の向上",
  "Process diverse projects without machine changeover, reducing downtime and increasing overall production throughput": "機械を切り替えずに多様なプロジェクトを処理し、ダウンタイムを削減し、全体的な生産スループットを向上させます。",
  "Key Components": "主要コンポーネント",
  "Understanding the integrated system that enables dual-mode cutting performance and quick platform exchange": "デュアルモード切断性能と素早いプラットフォーム交換を可能にする統合システムを理解する",
  "Fiber Laser Source": "ファイバーレーザー源",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Single laser source serves both plate and tube cutting modes with automatic parameter adjustment. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan for both applications.": "Raycus や IPG などの大手メーカーの高出力ファイバー レーザー ジェネレーター (複数の出力オプション)。",
  "Exchange Platform": "交換プラットフォーム",
  "Revolutionary quick-change platform system enables seamless switching between plate and tube cutting modes in just 10 seconds. Automated positioning ensures precise alignment after every exchange. Robust mechanical design withstands frequent mode changes while maintaining accuracy. Integrated sensors verify proper platform installation before cutting begins.": "革新的なクイックチェンジプラットフォームシステムにより、プレート切断モードとチューブ切断モードをわずか 10 秒でシームレスに切り替えることができます。",
  "Universal Auto-Focus Cutting Head": "ユニバーサルオートフォーカスカッティングヘッド",
  "Professional auto-focus cutting head optimized for both flat plate and tubular cutting. Capacitive height sensor automatically adjusts focal position for different material thicknesses and tube diameters. Built-in collision protection safeguards the head during mode switching. Quick lens replacement design minimizes maintenance downtime for both applications.": "平板と管状の両方の切断に最適化されたプロフェッショナル向けオートフォーカス切断ヘッド。",
  "Integrated Bed & Chuck System": "一体型ベッド＆チャックシステム",
  "Heavy-duty welded steel frame accommodates both plate cutting table and tube chuck assembly. Quick-release mechanism enables rapid platform exchange. Four-chuck pneumatic clamping system for tube mode provides stable positioning. Blade-type plate support prevents small part drop-through. Single frame design ensures consistent positioning accuracy across both modes.": "頑丈な溶接スチールフレームは、プレート切断テーブルとチューブチャックアセンブリの両方に対応します。",
  "Watch Our Machine in Action": "機械の動作をご覧ください",
  "See the versatility and quick platform exchange of our integrated laser cutting machine": "当社の統合レーザー切断機の多用途性と素早いプラットフォーム交換をご覧ください。",
  "Applications": "アプリケーション",
  "The integrated plate and tube laser cutting machine serves industries requiring both sheet metal and tubular component fabrication": "統合されたプレートとチューブのレーザー切断機は、板金と管状コンポーネントの両方の製造を必要とする業界に役立ちます",
  "Automotive Manufacturing": "自動車製造",
  "Cutting chassis plates, structural tubes, exhaust pipes, and brackets in one integrated production line": "シャーシプレート、構造チューブ、エキゾーストパイプ、ブラケットを 1 つの統合生産ラインで切断",
  "Furniture Industry": "家具産業",
  "Manufacturing both sheet metal panels and tubular frames for office furniture, shelving systems, and decorative items": "オフィス家具、棚システム、装飾品用の板金パネルと管状フレームの両方の製造",
  "Construction Equipment": "建設機械",
  "Processing both structural steel plates and tubular supports for heavy machinery and construction equipment": "重機や建設機械の構造用鋼板や支柱の加工",
  "Fitness Equipment": "フィットネス機器",
  "Cutting tubular frames and sheet metal covers for gym equipment, exercise machines, and weight training apparatus": "ジム設備、エクササイズマシン、ウエイトトレーニング器具の管状フレームや板金カバーの切断",
  "Metal Fabrication Shops": "金属加工店",
  "Job shops requiring flexibility to process diverse customer orders involving both plates and tubes": "プレートとチューブの両方を含む多様な顧客注文を処理する柔軟性が必要なジョブショップ",
  "Agricultural Machinery": "農業機械",
  "Manufacturing both sheet metal body panels and tubular structural frames for tractors and farm equipment": "トラクターや農機具用の板金ボディパネルと管状構造フレームの両方の製造",
  "HVAC Systems": "HVAC システム",
  "Cutting ductwork panels and ventilation tubes for heating, ventilation, and air conditioning systems": "暖房、換気、空調システム用のダクトパネルと換気チューブの切断",
  "Steel Structure Buildings": "鉄骨造建築物",
  "Processing both structural steel plates and tubular columns for prefabricated building construction": "プレハブ建築用構造用鋼板・管柱の加工",
  "Standard & Optional Configuration": "標準およびオプションの構成",
  "Customize your integrated machine with standard features and optional upgrades for both plate and tube cutting": "プレートとチューブの両方の切断のための標準機能とオプションのアップグレードを使用して統合マシンをカスタマイズします",
  "Standard Configuration": "標準構成",
  "Optional Upgrades": "オプションのアップグレード",
  "Need help choosing the right configuration?": "適切な構成を選択するのにサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about our plate and tube integrated laser cutting machines": "プレート＆チューブ一体型レーザー切断機に関するよくある質問",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the desired mode (plate or tube) on the control panel, and the machine automatically releases the current platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "交換プラットフォームには、正確な位置決めを備えた自動クイックチェンジ システムが使用されています。",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head, and control system for both applications. The CNC system automatically optimizes parameters for each mode. Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across all operations.": "はい、どちらのモードでも切断品質は同じです。",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines. Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most customers see ROI within 18-24 months compared to buying two separate systems.": "統合された機械は通常、プレートとチューブの切断機械を個別に購入するよりもコストが 30 ～ 40% 低くなります。",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day. Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production orders without significant downtime.": "絶対に！",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines. Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and dust extractors, which are shared between both modes.": "統合された機械は、別個のプレートアンドチューブ機械よりも約 50% 少ない床面積を必要とします。",
  "Training is actually simplified because operators learn one control system for both functions. The interface is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient in both modes within 3-5 days of training. The unified control system means operators don't need to learn two different machines, reducing the overall training burden.": "オペレータは両方の機能に対して 1 つの制御システムを学習するため、トレーニングは実際に簡素化されます。",
  "Still have questions?": "まだ質問がありますか?",
  "Download Technical Brochure": "技術パンフレットをダウンロード",
  "Get detailed technical specifications, dimensions, and performance data for our integrated plate and tube laser cutting machines. Download our comprehensive product brochure in PDF format.": "当社の統合型プレートおよびチューブレーザー切断機の詳細な技術仕様、寸法、性能データを入手してください。"
}