{
  "Plate and Tube Integrated Laser Cutting Machine": "Machine de découpe laser intégrée pour plaques et tubes",
  "Revolutionary 2-in-1 fiber laser cutting system that combines plate and tube cutting capabilities. Features a 10-second exchange platform for seamless mode switching between sheet metal and tube processing. One machine, unlimited possibilities for maximum versatility and space efficiency.": "Système de découpe laser à fibre révolutionnaire 2 en 1 qui combine les capacités de découpe de plaques et de tubes. ",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "Dual-purpose integrated laser cutting system with quick-change platform for plates and tubes": "Système de découpe laser intégré à double usage avec plateforme de changement rapide pour plaques et tubes",
  "Plate Cutting Capacity": "Capacité de coupe de plaque",
  "Laser Power: Multiple power options": "Puissance laser : plusieurs options d'alimentation",
  "Working Area: Customizable dimensions": "Zone de travail : dimensions personnalisables",
  "Max Thickness: Various thicknesses": "Épaisseur maximale : différentes épaisseurs",
  "Positioning Accuracy: High precision": "Précision de positionnement : haute précision",
  "Tube Cutting Capacity": "Capacité de coupe de tubes",
  "Tube Diameter: Customizable tube diameter": "Diamètre du tube : diamètre de tube personnalisable",
  "Max Tube Length: Customizable length": "Longueur maximale du tube : longueur personnalisable",
  "Shapes: Round, Square, Rectangle": "Formes : ronde, carrée, rectangulaire",
  "Wall Thickness: Various wall thickness": "Épaisseur de paroi : Diverses épaisseurs de paroi",
  "System Features": "Caractéristiques du système",
  "rapid exchange platform": "plateforme d'échange rapide",
  "Auto-focus cutting head": "Tête de coupe à mise au point automatique",
  "Four-chuck tube clamping": "Serrage de tube à quatre mandrins",
  "CNC control system": "Système de contrôle CNC",
  "Why Choose Our Integrated Laser Cutting Machine?": "Pourquoi choisir notre machine de découpe laser intégrée ?",
  "Discover the revolutionary advantages of combining plate and tube cutting in one versatile machine for ultimate productivity and cost savings": "Découvrez les avantages révolutionnaires de la combinaison de la découpe de plaques et de tubes dans une seule machine polyvalente pour une productivité et des économies ultimes",
  "Dual Functionality": "Double fonctionnalité",
  "One machine handles both plate and tube cutting, eliminating the need for separate equipment and maximizing workshop versatility": "Une seule machine gère à la fois la découpe de plaques et de tubes, éliminant ainsi le besoin d'équipement séparé et maximisant la polyvalence de l'atelier.",
  "Quick Mode Switching": "Changement de mode rapide",
  "10-second exchange platform allows seamless transition between plate and tube cutting modes for uninterrupted production": "La plate-forme d'échange en 10 secondes permet une transition transparente entre les modes de découpe de plaques et de tubes pour une production ininterrompue",
  "Space Efficiency": "Efficacité spatiale",
  "Reduces factory footprint by 50% compared to separate machines, freeing up valuable production space for other operations": "Réduit l'empreinte de l'usine de 50 % par rapport aux machines séparées, libérant ainsi un espace de production précieux pour d'autres opérations",
  "Cost Savings": "Économies de coûts",
  "Invest in one machine instead of two, reducing capital costs, maintenance expenses, and operating overhead significantly": "Investissez dans une machine au lieu de deux, réduisant ainsi considérablement les coûts d'investissement, les dépenses de maintenance et les frais généraux d'exploitation.",
  "High Precision": "Haute précision",
  "Positioning accuracy of High precision for both plates and tubes ensures consistent quality across all cutting operations": "Précision de positionnement de haute précision pour les plaques et les tubes garantit une qualité constante dans toutes les opérations de découpe",
  "Improved Efficiency": "Efficacité améliorée",
  "Process diverse projects without machine changeover, reducing downtime and increasing overall production throughput": "Traitez divers projets sans changement de machine, réduisant ainsi les temps d'arrêt et augmentant le débit de production global",
  "Key Components": "Composants clés",
  "Understanding the integrated system that enables dual-mode cutting performance and quick platform exchange": "Comprendre le système intégré qui permet des performances de coupe bimode et un échange rapide de plate-forme",
  "Fiber Laser Source": "Source laser à fibre",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Single laser source serves both plate and tube cutting modes with automatic parameter adjustment. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan for both applications.": "Générateur laser à fibre haute puissance (plusieurs options de puissance) de grands fabricants comme Raycus ou IPG. ",
  "Exchange Platform": "Plateforme d'échange",
  "Revolutionary quick-change platform system enables seamless switching between plate and tube cutting modes in just 10 seconds. Automated positioning ensures precise alignment after every exchange. Robust mechanical design withstands frequent mode changes while maintaining accuracy. Integrated sensors verify proper platform installation before cutting begins.": "Le système révolutionnaire de plate-forme à changement rapide permet une commutation transparente entre les modes de découpe de plaques et de tubes en seulement 10 secondes. ",
  "Universal Auto-Focus Cutting Head": "Tête de coupe universelle à mise au point automatique",
  "Professional auto-focus cutting head optimized for both flat plate and tubular cutting. Capacitive height sensor automatically adjusts focal position for different material thicknesses and tube diameters. Built-in collision protection safeguards the head during mode switching. Quick lens replacement design minimizes maintenance downtime for both applications.": "Tête de coupe professionnelle à mise au point automatique optimisée pour la coupe de plaques plates et tubulaires. ",
  "Integrated Bed & Chuck System": "Système de lit et de mandrin intégré",
  "Heavy-duty welded steel frame accommodates both plate cutting table and tube chuck assembly. Quick-release mechanism enables rapid platform exchange. Four-chuck pneumatic clamping system for tube mode provides stable positioning. Blade-type plate support prevents small part drop-through. Single frame design ensures consistent positioning accuracy across both modes.": "Le cadre en acier soudé robuste peut accueillir à la fois une table de découpe de plaques et un ensemble de mandrin à tubes. ",
  "Watch Our Machine in Action": "Regardez notre machine en action",
  "See the versatility and quick platform exchange of our integrated laser cutting machine": "Découvrez la polyvalence et l'échange rapide de plate-forme de notre machine de découpe laser intégrée",
  "Applications": "Applications",
  "The integrated plate and tube laser cutting machine serves industries requiring both sheet metal and tubular component fabrication": "La machine de découpe laser intégrée de plaques et de tubes est destinée aux industries nécessitant à la fois la fabrication de tôles et de composants tubulaires.",
  "Automotive Manufacturing": "Fabrication automobile",
  "Cutting chassis plates, structural tubes, exhaust pipes, and brackets in one integrated production line": "Découpe de plaques de châssis, de tubes structurels, de tuyaux d'échappement et de supports dans une seule ligne de production intégrée",
  "Furniture Industry": "Industrie du meuble",
  "Manufacturing both sheet metal panels and tubular frames for office furniture, shelving systems, and decorative items": "Fabrication de panneaux en tôle et de cadres tubulaires pour mobilier de bureau, systèmes d'étagères et objets de décoration",
  "Construction Equipment": "Matériel de construction",
  "Processing both structural steel plates and tubular supports for heavy machinery and construction equipment": "Traitement de tôles d'acier de construction et de supports tubulaires pour machines lourdes et équipements de construction",
  "Fitness Equipment": "Équipement de conditionnement physique",
  "Cutting tubular frames and sheet metal covers for gym equipment, exercise machines, and weight training apparatus": "Découpe de cadres tubulaires et de couvercles en tôle pour équipements de gymnastique, appareils d'exercice et appareils de musculation",
  "Metal Fabrication Shops": "Ateliers de fabrication de métaux",
  "Job shops requiring flexibility to process diverse customer orders involving both plates and tubes": "Ateliers nécessitant de la flexibilité pour traiter diverses commandes clients impliquant à la fois des plaques et des tubes",
  "Agricultural Machinery": "Machines agricoles",
  "Manufacturing both sheet metal body panels and tubular structural frames for tractors and farm equipment": "Fabrication de panneaux de carrosserie en tôle et de cadres structurels tubulaires pour tracteurs et équipements agricoles",
  "HVAC Systems": "Systèmes CVC",
  "Cutting ductwork panels and ventilation tubes for heating, ventilation, and air conditioning systems": "Découpe de panneaux de conduits et de tubes de ventilation pour les systèmes de chauffage, de ventilation et de climatisation",
  "Steel Structure Buildings": "Bâtiments à structure métallique",
  "Processing both structural steel plates and tubular columns for prefabricated building construction": "Traitement de tôles d'acier de construction et de colonnes tubulaires pour la construction de bâtiments préfabriqués",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Customize your integrated machine with standard features and optional upgrades for both plate and tube cutting": "Personnalisez votre machine intégrée avec des fonctionnalités standard et des mises à niveau en option pour la découpe de plaques et de tubes",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need help choosing the right configuration?": "Besoin d'aide pour choisir la bonne configuration ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our plate and tube integrated laser cutting machines": "Questions courantes sur nos machines de découpe laser intégrées pour plaques et tubes",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the desired mode (plate or tube) on the control panel, and the machine automatically releases the current platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "La plateforme d'échange utilise un système automatisé de changement rapide avec un positionnement précis. ",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head, and control system for both applications. The CNC system automatically optimizes parameters for each mode. Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across all operations.": "Oui, la qualité de découpe est identique dans les deux modes. ",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines. Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most customers see ROI within 18-24 months compared to buying two separate systems.": "La machine intégrée coûte généralement 30 à 40 % de moins que l'achat de machines de découpe de plaques et de tubes séparées. ",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day. Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production orders without significant downtime.": "Absolument! ",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines. Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and dust extractors, which are shared between both modes.": "La machine intégrée nécessite environ 50 % d'espace au sol en moins que les machines séparées à plaques et à tubes. ",
  "Training is actually simplified because operators learn one control system for both functions. The interface is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient in both modes within 3-5 days of training. The unified control system means operators don't need to learn two different machines, reducing the overall training burden.": "La formation est en réalité simplifiée car les opérateurs apprennent un seul système de contrôle pour les deux fonctions. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Get detailed technical specifications, dimensions, and performance data for our integrated plate and tube laser cutting machines. Download our comprehensive product brochure in PDF format.": "Obtenez des spécifications techniques détaillées, des dimensions et des données de performances pour nos machines de découpe laser intégrées de plaques et de tubes. "
}