{
  "Plate and Tube Integrated Laser Cutting Machine": "آلة القطع بالليزر المتكاملة للألواح والأنابيب",
  "Revolutionary 2-in-1 fiber laser cutting system that combines plate and tube cutting capabilities. Features a 10-second exchange platform for seamless mode switching between sheet metal and tube processing. One machine, unlimited possibilities for maximum versatility and space efficiency.": "نظام القطع بالليزر الليفي 2 في 1 الثوري الذي يجمع بين إمكانيات قطع الألواح والأنابيب. ",
  "Request Quote": "طلب اقتباس",
  "Watch Video": "شاهد الفيديو",
  "Technical Specifications": "المواصفات الفنية",
  "Dual-purpose integrated laser cutting system with quick-change platform for plates and tubes": "نظام قطع ليزر متكامل ثنائي الغرض مع منصة تغيير سريعة للألواح والأنابيب",
  "Plate Cutting Capacity": "قدرة قطع اللوحة",
  "Laser Power: Multiple power options": "طاقة الليزر: خيارات طاقة متعددة",
  "Working Area: Customizable dimensions": "منطقة العمل: أبعاد قابلة للتخصيص",
  "Max Thickness: Various thicknesses": "أقصى سمك: سمك مختلف",
  "Positioning Accuracy: High precision": "دقة تحديد المواقع: دقة عالية",
  "Tube Cutting Capacity": "قدرة قطع الأنبوب",
  "Tube Diameter: Customizable tube diameter": "قطر الأنبوب: قطر الأنبوب قابل للتخصيص",
  "Max Tube Length: Customizable length": "أقصى طول للأنبوب: طول قابل للتخصيص",
  "Shapes: Round, Square, Rectangle": "الأشكال: مستديرة، مربعة، مستطيلة",
  "Wall Thickness: Various wall thickness": "سمك الجدار: سمك الجدار المختلفة",
  "System Features": "مميزات النظام",
  "rapid exchange platform": "منصة التبادل السريع",
  "Auto-focus cutting head": "رأس قطع التركيز التلقائي",
  "Four-chuck tube clamping": "مشبك أنبوب بأربعة ظرف",
  "CNC control system": "نظام التحكم CNC",
  "Why Choose Our Integrated Laser Cutting Machine?": "لماذا تختار آلة القطع بالليزر المتكاملة لدينا؟",
  "Discover the revolutionary advantages of combining plate and tube cutting in one versatile machine for ultimate productivity and cost savings": "اكتشف المزايا الثورية للجمع بين قطع الألواح والأنابيب في آلة واحدة متعددة الاستخدامات لتحقيق أقصى إنتاجية وتوفير في التكلفة",
  "Dual Functionality": "وظيفة مزدوجة",
  "One machine handles both plate and tube cutting, eliminating the need for separate equipment and maximizing workshop versatility": "تتعامل آلة واحدة مع كل من قطع الألواح والأنابيب، مما يلغي الحاجة إلى معدات منفصلة ويزيد من تعدد استخدامات ورشة العمل",
  "Quick Mode Switching": "تبديل الوضع السريع",
  "10-second exchange platform allows seamless transition between plate and tube cutting modes for uninterrupted production": "تسمح منصة التبادل لمدة 10 ثوانٍ بالانتقال السلس بين أوضاع قطع الألواح والأنابيب من أجل الإنتاج المتواصل",
  "Space Efficiency": "كفاءة المساحة",
  "Reduces factory footprint by 50% compared to separate machines, freeing up valuable production space for other operations": "يقلل من أثر المصنع بنسبة 50% مقارنة بالآلات المنفصلة، ​​مما يوفر مساحة إنتاج قيمة لعمليات أخرى",
  "Cost Savings": "وفورات في التكاليف",
  "Invest in one machine instead of two, reducing capital costs, maintenance expenses, and operating overhead significantly": "استثمر في ماكينة واحدة بدلاً من اثنتين، مما يقلل التكاليف الرأسمالية ونفقات الصيانة ونفقات التشغيل العامة بشكل كبير",
  "High Precision": "دقة عالية",
  "Positioning accuracy of High precision for both plates and tubes ensures consistent quality across all cutting operations": "دقة تحديد المواقع عالية الدقة لكل من الألواح والأنابيب تضمن جودة متسقة عبر جميع عمليات القطع",
  "Improved Efficiency": "تحسين الكفاءة",
  "Process diverse projects without machine changeover, reducing downtime and increasing overall production throughput": "قم بمعالجة المشاريع المتنوعة دون الحاجة إلى تغيير الماكينة، مما يقلل وقت التوقف عن العمل ويزيد من إنتاجية الإنتاج الإجمالية",
  "Key Components": "المكونات الرئيسية",
  "Understanding the integrated system that enables dual-mode cutting performance and quick platform exchange": "فهم النظام المتكامل الذي يتيح أداء القطع ثنائي الوضع والتبادل السريع للنظام الأساسي",
  "Fiber Laser Source": "مصدر ألياف الليزر",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Single laser source serves both plate and tube cutting modes with automatic parameter adjustment. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan for both applications.": "مولد ليزر ألياف عالي الطاقة (خيارات طاقة متعددة) من الشركات المصنعة الرائدة مثل Raycus أو IPG. ",
  "Exchange Platform": "منصة التبادل",
  "Revolutionary quick-change platform system enables seamless switching between plate and tube cutting modes in just 10 seconds. Automated positioning ensures precise alignment after every exchange. Robust mechanical design withstands frequent mode changes while maintaining accuracy. Integrated sensors verify proper platform installation before cutting begins.": "يتيح نظام المنصة الثوري سريع التغيير التبديل السلس بين أوضاع قطع اللوحة والأنبوب في 10 ثوانٍ فقط. ",
  "Universal Auto-Focus Cutting Head": "رأس قطع التركيز التلقائي الشامل",
  "Professional auto-focus cutting head optimized for both flat plate and tubular cutting. Capacitive height sensor automatically adjusts focal position for different material thicknesses and tube diameters. Built-in collision protection safeguards the head during mode switching. Quick lens replacement design minimizes maintenance downtime for both applications.": "رأس قطع احترافي ذو تركيز تلقائي مُحسَّن لكل من الألواح المسطحة والقطع الأنبوبي. ",
  "Integrated Bed & Chuck System": "نظام متكامل للسرير والظرف",
  "Heavy-duty welded steel frame accommodates both plate cutting table and tube chuck assembly. Quick-release mechanism enables rapid platform exchange. Four-chuck pneumatic clamping system for tube mode provides stable positioning. Blade-type plate support prevents small part drop-through. Single frame design ensures consistent positioning accuracy across both modes.": "يستوعب الإطار الفولاذي الملحوم للخدمة الشاقة كلاً من طاولة قطع الألواح ومجموعة ظرف الأنبوب. ",
  "Watch Our Machine in Action": "شاهد آلتنا أثناء عملها",
  "See the versatility and quick platform exchange of our integrated laser cutting machine": "شاهد تعدد الاستخدامات والتبادل السريع للمنصة لآلة القطع بالليزر المدمجة لدينا",
  "Applications": "التطبيقات",
  "The integrated plate and tube laser cutting machine serves industries requiring both sheet metal and tubular component fabrication": "تخدم آلة القطع بالليزر للألواح والأنابيب المدمجة الصناعات التي تتطلب تصنيع مكونات الصفائح المعدنية والأنبوبية",
  "Automotive Manufacturing": "تصنيع السيارات",
  "Cutting chassis plates, structural tubes, exhaust pipes, and brackets in one integrated production line": "قطع صفائح الهيكل والأنابيب الهيكلية وأنابيب العادم والأقواس في خط إنتاج واحد متكامل",
  "Furniture Industry": "صناعة الأثاث",
  "Manufacturing both sheet metal panels and tubular frames for office furniture, shelving systems, and decorative items": "تصنيع كل من الألواح المعدنية والإطارات الأنبوبية للأثاث المكتبي وأنظمة الرفوف والعناصر الزخرفية",
  "Construction Equipment": "معدات البناء",
  "Processing both structural steel plates and tubular supports for heavy machinery and construction equipment": "معالجة كل من الألواح الفولاذية الهيكلية والدعامات الأنبوبية للآلات الثقيلة ومعدات البناء",
  "Fitness Equipment": "معدات اللياقة البدنية",
  "Cutting tubular frames and sheet metal covers for gym equipment, exercise machines, and weight training apparatus": "قطع الإطارات الأنبوبية وأغطية الصفائح المعدنية لمعدات الصالة الرياضية، وآلات التمرين، وأجهزة تدريب الأثقال",
  "Metal Fabrication Shops": "محلات تصنيع المعادن",
  "Job shops requiring flexibility to process diverse customer orders involving both plates and tubes": "تتطلب متاجر العمل مرونة في معالجة طلبات العملاء المتنوعة التي تشمل الألواح والأنابيب",
  "Agricultural Machinery": "الآلات الزراعية",
  "Manufacturing both sheet metal body panels and tubular structural frames for tractors and farm equipment": "تصنيع ألواح الجسم من الصفائح المعدنية والإطارات الهيكلية الأنبوبية للجرارات والمعدات الزراعية",
  "HVAC Systems": "أنظمة التدفئة والتهوية وتكييف الهواء",
  "Cutting ductwork panels and ventilation tubes for heating, ventilation, and air conditioning systems": "قطع ألواح مجاري الهواء وأنابيب التهوية لأنظمة التدفئة والتهوية وتكييف الهواء",
  "Steel Structure Buildings": "مباني الهيكل الصلب",
  "Processing both structural steel plates and tubular columns for prefabricated building construction": "معالجة كل من الألواح الفولاذية الإنشائية والأعمدة الأنبوبية لبناء المباني الجاهزة",
  "Standard & Optional Configuration": "التكوين القياسي والاختياري",
  "Customize your integrated machine with standard features and optional upgrades for both plate and tube cutting": "قم بتخصيص جهازك المدمج بالميزات القياسية والترقيات الاختيارية لكل من قطع الألواح والأنابيب",
  "Standard Configuration": "التكوين القياسي",
  "Optional Upgrades": "ترقيات اختيارية",
  "Need help choosing the right configuration?": "هل تحتاج إلى مساعدة في اختيار التكوين الصحيح؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about our plate and tube integrated laser cutting machines": "الأسئلة الشائعة حول آلات القطع بالليزر المتكاملة للألواح والأنابيب",
  "The exchange platform uses an automated quick-change system with precision positioning. Simply select the desired mode (plate or tube) on the control panel, and the machine automatically releases the current platform and guides the operator to install the correct one. Built-in sensors verify proper alignment and installation before allowing cutting operations to begin. The entire process takes approximately 10 seconds.": "تستخدم منصة التبادل نظامًا آليًا للتغيير السريع مع تحديد المواقع بدقة. ",
  "Yes, cutting quality is identical in both modes. The machine uses the same fiber laser source, cutting head, and control system for both applications. The CNC system automatically optimizes parameters for each mode. Positioning accuracy remains High precision for both plate and tube cutting, ensuring consistent precision across all operations.": "نعم، جودة القطع متطابقة في كلا الوضعين. ",
  "The integrated machine typically costs 30-40% less than purchasing separate plate and tube cutting machines. Additional savings include: reduced maintenance costs (one laser source instead of two), lower utility expenses, reduced floor space requirements (saving rental costs), and simplified operator training. Most customers see ROI within 18-24 months compared to buying two separate systems.": "عادةً ما تكون تكلفة الماكينة المدمجة أقل بنسبة 30-40% من شراء ماكينات قطع الألواح والأنابيب المنفصلة. ",
  "Absolutely! The quick exchange platform makes it practical to switch between modes multiple times per day. Many customers batch similar cuts together to minimize platform changes, but the flexibility allows you to switch modes as needed. The 10-second exchange time means you can efficiently handle mixed production orders without significant downtime.": "قطعاً! ",
  "The integrated machine requires approximately 50% less floor space than separate plate and tube machines. Standard configuration needs about 8m x 4m including operator access areas. This compact footprint makes it ideal for workshops with limited space. Additional area is needed for auxiliary equipment like chillers and dust extractors, which are shared between both modes.": "تتطلب الماكينة المدمجة مساحة أرضية أقل بنسبة 50% تقريبًا من الماكينات المنفصلة ذات الألواح والأنابيب. ",
  "Training is actually simplified because operators learn one control system for both functions. The interface is intuitive with clear mode selection and automatic parameter switching. Most operators become proficient in both modes within 3-5 days of training. The unified control system means operators don't need to learn two different machines, reducing the overall training burden.": "تم تبسيط التدريب في الواقع لأن المشغلين يتعلمون نظام تحكم واحدًا لكلا الوظيفتين. ",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "Download Technical Brochure": "تحميل الكتيب الفني",
  "Get detailed technical specifications, dimensions, and performance data for our integrated plate and tube laser cutting machines. Download our comprehensive product brochure in PDF format.": "احصل على المواصفات الفنية التفصيلية والأبعاد وبيانات الأداء الخاصة بآلات قطع الألواح والأنابيب المدمجة بالليزر. "
}