{
  "Single Table Fiber Laser Cutting Machine": "Machine de découpe laser à fibre à table unique",
  "Featuring high-power fiber laser source and advanced CNC control, our single table fiber laser cutting machine delivers exceptional cutting precision and speed with clean, burr-free edges. Ideal for sheet metal processing with minimal heat-affected zones.": "Dotée d'une source laser à fibre haute puissance et d'un contrôle CNC avancé, notre machine de découpe laser à fibre à table unique offre une précision et une vitesse de coupe exceptionnelles avec des bords propres et sans bavures. ",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "High-performance fiber laser cutting system with single table design for efficient metal processing": "Système de découpe laser à fibre haute performance avec une conception à table unique pour un traitement efficace des métaux",
  "Cutting Capacity": "Capacité de coupe",
  "Laser Power: Multiple power options": "Puissance laser : plusieurs options d'alimentation",
  "Working Area: Customizable dimensions": "Zone de travail : dimensions personnalisables",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Matériau : acier, inoxydable, aluminium, cuivre, laiton.",
  "Max Thickness: Various thickness capabilities": "Épaisseur maximale : diverses capacités d'épaisseur",
  "Control System": "Système de contrôle",
  "CNC System: CypCut or Raytools": "Système CNC : CypCut ou Raytools",
  "Cutting Head: Auto-focus": "Tête de coupe : mise au point automatique",
  "Positioning Accuracy: High precision": "Précision de positionnement : haute précision",
  "Repeat Accuracy: High repeatability": "Précision de répétition : haute répétabilité",
  "Key Features": "Principales fonctionnalités",
  "Fiber laser source (maintenance-free)": "Source laser à fibre (sans entretien)",
  "Linear motor drive system": "Système d'entraînement par moteur linéaire",
  "Capacitive height sensor": "Capteur de hauteur capacitif",
  "Cutting speed: High speed capability": "Vitesse de coupe : Capacité de vitesse élevée",
  "Why Choose Our Single Table Fiber Laser Cutting Machine?": "Pourquoi choisir notre machine de découpe laser fibre à table unique ?",
  "Discover the key advantages that make our fiber laser cutting machine the preferred choice for precision metal fabrication and sheet metal processing": "Découvrez les principaux avantages qui font de notre machine de découpe laser fibre le choix privilégié pour la fabrication métallique de précision et le traitement de la tôle.",
  "Ultra-High Precision": "Ultra-haute précision",
  "Positioning accuracy of High precision with minimal heat-affected zone ensures clean, burr-free edges on all cuts": "Précision de positionnement de haute précision avec une zone affectée par la chaleur minimale garantissant des bords propres et sans bavures sur toutes les coupes",
  "Narrow Kerf Width": "Largeur de saignée étroite",
  "Laser beam kerf width as narrow as 0.1mm minimizes material waste and maximizes cutting efficiency": "La largeur de saignée du faisceau laser aussi étroite que 0,1 mm minimise le gaspillage de matériau et optimise l'efficacité de coupe",
  "Fast Cutting Speeds": "Vitesses de coupe rapides",
  "Cutting speeds High speed capability for thin materials dramatically increase productivity and throughput": "Vitesses de coupe La capacité de vitesse élevée pour les matériaux minces augmente considérablement la productivité et le débit",
  "No Tool Wear": "Aucune usure des outils",
  "Non-contact cutting process eliminates tool wear, reducing maintenance costs and ensuring consistent quality": "Le processus de coupe sans contact élimine l'usure des outils, réduisant ainsi les coûts de maintenance et garantissant une qualité constante",
  "Versatile Materials": "Matériaux polyvalents",
  "Cuts steel, stainless steel, aluminum, copper, brass, and other reflective metals with ease": "Coupe facilement l'acier, l'acier inoxydable, l'aluminium, le cuivre, le laiton et d'autres métaux réfléchissants.",
  "Low Operating Cost": "Faible coût d'exploitation",
  "Fiber laser requires minimal maintenance with high electrical efficiency reducing operational expenses": "Le laser à fibre nécessite un entretien minimal avec une efficacité électrique élevée réduisant les dépenses opérationnelles",
  "Key Components": "Composants clés",
  "Understanding the core components that deliver precision laser cutting performance and reliability": "Comprendre les composants de base qui offrent des performances et une fiabilité de découpe laser de précision",
  "Fiber Laser Source": "Source laser à fibre",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan. Stable output ensures consistent cutting quality.": "Générateur laser à fibre haute puissance (plusieurs options de puissance) de grands fabricants comme Raycus ou IPG. ",
  "CNC Control System": "Système de contrôle CNC",
  "Advanced CNC system (CypCut or Raytools) with intuitive interface for easy programming and operation. Supports complex path planning, automatic nesting, and real-time monitoring. Compatible with standard file formats (DXF, DWG) for seamless CAD/CAM integration.": "Système CNC avancé (CypCut ou Raytools) avec interface intuitive pour une programmation et une utilisation faciles. ",
  "Auto-Focus Cutting Head": "Tête de coupe à mise au point automatique",
  "Professional auto-focus cutting head with capacitive height sensor for automatic focal length adjustment. Ensures optimal focus position across different material thicknesses. Built-in collision protection and quick lens replacement design minimize downtime.": "Tête de coupe professionnelle à mise au point automatique avec capteur de hauteur capacitif pour un réglage automatique de la distance focale. ",
  "Machine Bed & Single Table": "Lit de machine et table simple",
  "Heavy-duty welded steel frame with stress-relief treatment ensures long-term stability. Single working table with pneumatic clamps for material positioning. Blade-type or strip-type support structure prevents small parts from falling and protects cutting head from collision damage.": "Le cadre en acier soudé robuste avec traitement anti-stress assure une stabilité à long terme. ",
  "Assist Gas & Cooling System": "Système d'assistance au gaz et au refroidissement",
  "Precision gas delivery system with automatic pressure control for oxygen, nitrogen, or air assist. Industrial water chiller maintains optimal laser source temperature. Dust extraction system ensures clean cutting environment and protects optical components from contamination.": "Système de distribution de gaz de précision avec contrôle automatique de la pression pour l'oxygène, l'azote ou l'air. ",
  "Watch Our Machine in Action": "Regardez notre machine en action",
  "See the precision and speed of our fiber laser cutting machine in real production": "Découvrez la précision et la rapidité de notre machine de découpe laser fibre en production réelle",
  "Applications": "Applications",
  "Our fiber laser cutting machines are widely used across various industries for precision metal cutting and complex pattern processing": "Nos machines de découpe laser à fibre sont largement utilisées dans diverses industries pour la découpe de précision des métaux et le traitement de motifs complexes.",
  "Sheet Metal Fabrication": "Fabrication de tôles",
  "Precision laser cutting of complex patterns, intricate designs, and tight tolerances for custom fabrication": "Découpe laser de précision de motifs complexes, de conceptions complexes et de tolérances serrées pour une fabrication personnalisée",
  "Automotive Parts": "Pièces automobiles",
  "Manufacturing chassis components, exhaust systems, brackets, and precision automotive parts with tight tolerances": "Fabrication de composants de châssis, de systèmes d'échappement, de supports et de pièces automobiles de précision avec des tolérances serrées",
  "Elevator & Escalator": "Ascenseur et escalier roulant",
  "Cutting decorative panels, structural components, and safety parts for elevator and escalator manufacturing": "Découpe de panneaux décoratifs, de composants structurels et de pièces de sécurité pour la fabrication d'ascenseurs et d'escaliers mécaniques",
  "Electronics Enclosures": "Boîtiers électroniques",
  "Laser cutting of server racks, control panels, electrical cabinets with precise ventilation holes": "Découpe laser de racks de serveurs, panneaux de contrôle, armoires électriques avec trous de ventilation précis",
  "Agricultural Machinery": "Machines agricoles",
  "Manufacturing parts for tractors, harvesters, and farm equipment with complex geometries": "Fabrication de pièces pour tracteurs, moissonneuses et équipements agricoles aux géométries complexes",
  "Fitness Equipment": "Équipement de conditionnement physique",
  "Cutting structural frames, decorative covers, and mechanical parts for exercise machines": "Découpe de cadres structurels, de couvercles décoratifs et de pièces mécaniques pour appareils d'exercice",
  "Advertising & Signage": "Publicité et signalisation",
  "Cutting intricate letters, logos, and decorative metal signs with smooth edges": "Découpe de lettres complexes, de logos et de panneaux métalliques décoratifs aux bords lisses",
  "Kitchen Equipment": "Équipement de cuisine",
  "Manufacturing stainless steel sinks, countertops, appliance panels, and commercial kitchen components": "Fabrication d'éviers, de comptoirs, de panneaux d'appareils électroménagers et de composants de cuisine commerciale en acier inoxydable",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personnalisez votre machine avec des fonctionnalités standard et des mises à niveau facultatives pour répondre à vos besoins spécifiques",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need help choosing the right configuration?": "Besoin d'aide pour choisir la bonne configuration ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our fiber laser cutting machines": "Questions courantes sur nos machines de découpe laser fibre",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing productivity by reducing idle time.": "Les machines de découpe laser à table unique disposent d'une table de travail fixe, offrant une solution plus économique adaptée aux volumes de production faibles à moyens. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and 12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel, aluminum alloys, copper, brass, and titanium.": "Nos machines de découpe laser à fibre peuvent couper différentes épaisseurs d'acier au carbone, d'acier inoxydable, d'aluminium et 12 mm, et de cuivre/laiton jusqu'à 8 mm (les épaisseurs varient en fonction de la puissance du laser). ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser gas refills or mirror alignments are needed.": "Les lasers à fibre ne nécessitent presque aucun entretien par rapport aux lasers CO2. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization, basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Oui, nous fournissons une assistance complète comprenant l'installation sur site, la mise en service de la machine et la formation des opérateurs (généralement 3 à 5 jours). ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion), assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power consumption and minimal maintenance requirements.": "Les coûts de fonctionnement comprennent l'électricité (les lasers à fibre sont très efficaces avec une conversion électro-optique d'environ 30 %), le gaz d'assistance (azote, oxygène ou air comprimé), l'électricité du refroidisseur d'eau et les consommables occasionnels (lentilles de protection, buses). ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications or higher power configurations may require 45-60 days. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Les machines à configuration standard sont généralement expédiées dans les 30 à 45 jours suivant la confirmation de la commande. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Get detailed technical specifications, dimensions, and performance data for our fiber laser cutting machines. Download our comprehensive product brochure in PDF format.": "Obtenez des spécifications techniques détaillées, des dimensions et des données de performances pour nos machines de découpe laser à fibre. "
}