{
  "Single Table Fiber Laser Cutting Machine": "Máquina cortadora láser de fibra de mesa única",
  "Featuring high-power fiber laser source and advanced CNC control, our single table fiber laser cutting machine delivers exceptional cutting precision and speed with clean, burr-free edges. Ideal for sheet metal processing with minimal heat-affected zones.": "Con una fuente de láser de fibra de alta potencia y un control CNC avanzado, nuestra máquina cortadora por láser de fibra de mesa única ofrece una precisión y velocidad de corte excepcionales con bordes limpios y sin rebabas. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "High-performance fiber laser cutting system with single table design for efficient metal processing": "Sistema de corte por láser de fibra de alto rendimiento con diseño de mesa única para un procesamiento eficiente de metales",
  "Cutting Capacity": "Capacidad de corte",
  "Laser Power: Multiple power options": "Potencia del láser: múltiples opciones de potencia",
  "Working Area: Customizable dimensions": "Área de trabajo: dimensiones personalizables",
  "Material: Steel, Stainless, Aluminum, Copper, Brass": "Material: acero, inoxidable, aluminio, cobre, latón",
  "Max Thickness: Various thickness capabilities": "Espesor máximo: varias capacidades de espesor",
  "Control System": "Sistema de control",
  "CNC System: CypCut or Raytools": "Sistema CNC: CypCut o Raytools",
  "Cutting Head: Auto-focus": "Cabezal de corte: enfoque automático",
  "Positioning Accuracy: High precision": "Precisión de posicionamiento: alta precisión",
  "Repeat Accuracy: High repeatability": "Precisión de repetición: Alta repetibilidad",
  "Key Features": "Características clave",
  "Fiber laser source (maintenance-free)": "Fuente láser de fibra (sin mantenimiento)",
  "Linear motor drive system": "Sistema de accionamiento de motor lineal",
  "Capacitive height sensor": "Sensor de altura capacitivo",
  "Cutting speed: High speed capability": "Velocidad de corte: Capacidad de alta velocidad",
  "Why Choose Our Single Table Fiber Laser Cutting Machine?": "¿Por qué elegir nuestra máquina cortadora láser de fibra de mesa única?",
  "Discover the key advantages that make our fiber laser cutting machine the preferred choice for precision metal fabrication and sheet metal processing": "Descubra las ventajas clave que hacen de nuestra máquina de corte por láser de fibra la opción preferida para la fabricación de metales de precisión y el procesamiento de chapa metálica.",
  "Ultra-High Precision": "Precisión ultraalta",
  "Positioning accuracy of High precision with minimal heat-affected zone ensures clean, burr-free edges on all cuts": "Precisión de posicionamiento de alta precisión con una mínima zona afectada por el calor que garantiza bordes limpios y sin rebabas en todos los cortes.",
  "Narrow Kerf Width": "Ancho de corte estrecho",
  "Laser beam kerf width as narrow as 0.1mm minimizes material waste and maximizes cutting efficiency": "El ancho de corte del rayo láser de tan solo 0,1 mm minimiza el desperdicio de material y maximiza la eficiencia de corte.",
  "Fast Cutting Speeds": "Velocidades de corte rápidas",
  "Cutting speeds High speed capability for thin materials dramatically increase productivity and throughput": "Velocidades de corte La capacidad de alta velocidad para materiales delgados aumenta drásticamente la productividad y el rendimiento.",
  "No Tool Wear": "Sin desgaste de herramientas",
  "Non-contact cutting process eliminates tool wear, reducing maintenance costs and ensuring consistent quality": "El proceso de corte sin contacto elimina el desgaste de la herramienta, lo que reduce los costos de mantenimiento y garantiza una calidad constante.",
  "Versatile Materials": "Materiales versátiles",
  "Cuts steel, stainless steel, aluminum, copper, brass, and other reflective metals with ease": "Corta acero, acero inoxidable, aluminio, cobre, latón y otros metales reflectantes con facilidad.",
  "Low Operating Cost": "Bajo costo operativo",
  "Fiber laser requires minimal maintenance with high electrical efficiency reducing operational expenses": "El láser de fibra requiere un mantenimiento mínimo con una alta eficiencia eléctrica que reduce los gastos operativos.",
  "Key Components": "Componentes clave",
  "Understanding the core components that deliver precision laser cutting performance and reliability": "Comprender los componentes principales que ofrecen rendimiento y confiabilidad en el corte por láser de precisión",
  "Fiber Laser Source": "Fuente láser de fibra",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan. Stable output ensures consistent cutting quality.": "Generador láser de fibra de alta potencia (múltiples opciones de potencia) de fabricantes líderes como Raycus o IPG. ",
  "CNC Control System": "Sistema de control CNC",
  "Advanced CNC system (CypCut or Raytools) with intuitive interface for easy programming and operation. Supports complex path planning, automatic nesting, and real-time monitoring. Compatible with standard file formats (DXF, DWG) for seamless CAD/CAM integration.": "Sistema CNC avanzado (CypCut o Raytools) con interfaz intuitiva para una fácil programación y operación. ",
  "Auto-Focus Cutting Head": "Cabezal de corte con enfoque automático",
  "Professional auto-focus cutting head with capacitive height sensor for automatic focal length adjustment. Ensures optimal focus position across different material thicknesses. Built-in collision protection and quick lens replacement design minimize downtime.": "Cabezal de corte profesional con enfoque automático y sensor de altura capacitivo para ajuste automático de la distancia focal. ",
  "Machine Bed & Single Table": "Cama de máquina y mesa individual",
  "Heavy-duty welded steel frame with stress-relief treatment ensures long-term stability. Single working table with pneumatic clamps for material positioning. Blade-type or strip-type support structure prevents small parts from falling and protects cutting head from collision damage.": "El marco de acero soldado de alta resistencia con tratamiento de alivio de tensión garantiza estabilidad a largo plazo. ",
  "Assist Gas & Cooling System": "Sistema de refrigeración y gas auxiliar",
  "Precision gas delivery system with automatic pressure control for oxygen, nitrogen, or air assist. Industrial water chiller maintains optimal laser source temperature. Dust extraction system ensures clean cutting environment and protects optical components from contamination.": "Sistema de suministro de gas de precisión con control automático de presión para asistencia de oxígeno, nitrógeno o aire. ",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "See the precision and speed of our fiber laser cutting machine in real production": "Vea la precisión y velocidad de nuestra máquina de corte por láser de fibra en producción real",
  "Applications": "Aplicaciones",
  "Our fiber laser cutting machines are widely used across various industries for precision metal cutting and complex pattern processing": "Nuestras máquinas de corte por láser de fibra se utilizan ampliamente en diversas industrias para el corte de metales de precisión y el procesamiento de patrones complejos.",
  "Sheet Metal Fabrication": "Fabricación de chapa metálica",
  "Precision laser cutting of complex patterns, intricate designs, and tight tolerances for custom fabrication": "Corte láser de precisión de patrones complejos, diseños intrincados y tolerancias estrictas para fabricación personalizada",
  "Automotive Parts": "Piezas automotrices",
  "Manufacturing chassis components, exhaust systems, brackets, and precision automotive parts with tight tolerances": "Fabricación de componentes de chasis, sistemas de escape, soportes y piezas automotrices de precisión con tolerancias estrictas.",
  "Elevator & Escalator": "Ascensor y escalera mecánica",
  "Cutting decorative panels, structural components, and safety parts for elevator and escalator manufacturing": "Corte de paneles decorativos, componentes estructurales y piezas de seguridad para la fabricación de ascensores y escaleras mecánicas.",
  "Electronics Enclosures": "Cajas electrónicas",
  "Laser cutting of server racks, control panels, electrical cabinets with precise ventilation holes": "Corte por láser de racks de servidores, paneles de control y armarios eléctricos con orificios de ventilación precisos.",
  "Agricultural Machinery": "Maquinaria agrícola",
  "Manufacturing parts for tractors, harvesters, and farm equipment with complex geometries": "Fabricación de piezas para tractores, cosechadoras y equipos agrícolas con geometrías complejas.",
  "Fitness Equipment": "Equipo de gimnasia",
  "Cutting structural frames, decorative covers, and mechanical parts for exercise machines": "Corte de marcos estructurales, cubiertas decorativas y piezas mecánicas para máquinas de ejercicio.",
  "Advertising & Signage": "Publicidad y Señalización",
  "Cutting intricate letters, logos, and decorative metal signs with smooth edges": "Cortar letras, logotipos y letreros metálicos decorativos intrincados con bordes lisos",
  "Kitchen Equipment": "Equipo de cocina",
  "Manufacturing stainless steel sinks, countertops, appliance panels, and commercial kitchen components": "Fabricación de fregaderos, encimeras, paneles de electrodomésticos y componentes de cocinas comerciales de acero inoxidable.",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personalice su máquina con funciones estándar y actualizaciones opcionales para satisfacer sus requisitos específicos",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our fiber laser cutting machines": "Preguntas comunes sobre nuestras máquinas de corte por láser de fibra",
  "Single table laser cutting machines have one fixed working table, offering a more economical solution suitable for low to medium production volumes. Dual table machines feature two exchangeable tables that allow for continuous operation - while one table is cutting, the other can be loaded/unloaded, significantly increasing productivity by reducing idle time.": "Las máquinas de corte por láser de mesa única tienen una mesa de trabajo fija, lo que ofrece una solución más económica adecuada para volúmenes de producción bajos a medios. ",
  "Our fiber laser cutting machines can cut various thicknesses of carbon steel, stainless steel, aluminum, and 12mm, and copper/brass up to 8mm (thicknesses vary based on laser power). Higher wattage lasers can cut thicker materials. The machines handle various metals including mild steel, stainless steel, galvanized steel, aluminum alloys, copper, brass, and titanium.": "Nuestras máquinas de corte por láser de fibra pueden cortar varios espesores de acero al carbono, acero inoxidable, aluminio y 12 mm, y cobre/latón hasta 8 mm (los espesores varían según la potencia del láser). ",
  "Fiber lasers are nearly maintenance-free compared to CO2 lasers. Regular maintenance includes: cleaning protective lenses weekly, checking water chiller levels, inspecting gas pressure, and cleaning dust extraction filters. The fiber laser source itself requires no maintenance and has a lifespan of 100,000+ hours. No laser gas refills or mirror alignments are needed.": "Los láseres de fibra prácticamente no requieren mantenimiento en comparación con los láseres de CO2. ",
  "Yes, we provide comprehensive support including on-site installation, machine commissioning, and operator training (typically 3-5 days). Training covers machine operation, CNC programming, parameter optimization, basic maintenance, and troubleshooting. Complete operation manuals and video tutorials are also provided.": "Sí, brindamos soporte integral que incluye instalación en el sitio, puesta en marcha de la máquina y capacitación del operador (generalmente de 3 a 5 días). ",
  "Operating costs include electricity (fiber lasers are highly efficient with ~30% electro-optical conversion), assist gas (nitrogen, oxygen, or compressed air), water chiller electricity, and occasional consumables (protective lenses, nozzles). Fiber lasers are more cost-effective than CO2 lasers due to lower power consumption and minimal maintenance requirements.": "Los costos operativos incluyen electricidad (los láseres de fibra son altamente eficientes con ~30% de conversión electroóptica), gas auxiliar (nitrógeno, oxígeno o aire comprimido), electricidad para enfriadores de agua y consumibles ocasionales (lentes protectoras, boquillas). ",
  "Standard configuration machines typically ship within 30-45 days after order confirmation. Custom specifications or higher power configurations may require 45-60 days. We provide regular production updates and coordinate logistics to ensure smooth delivery and installation.": "Las máquinas de configuración estándar generalmente se envían entre 30 y 45 días después de la confirmación del pedido. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Get detailed technical specifications, dimensions, and performance data for our fiber laser cutting machines. Download our comprehensive product brochure in PDF format.": "Obtenga especificaciones técnicas detalladas, dimensiones y datos de rendimiento de nuestras máquinas de corte por láser de fibra. "
}