{
  "Tube Laser Cutting Machine": "チューブレーザー切断機",
  "Advanced fiber laser tube cutting system with four-chuck clamping and automatic feeding. Cuts round, square, and rectangular tubes with exceptional precision and speed. Ideal for structural fabrication, furniture manufacturing, and automotive components.": "4 チャッククランプと自動送りを備えた高度なファイバーレーザーチューブ切断システム。",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "High-performance tube laser cutting system with automatic feeding and intelligent control": "自動供給とインテリジェント制御を備えた高性能チューブレーザー切断システム",
  "Cutting Capacity": "切断能力",
  "Laser Power: Multiple power options": "レーザー出力: 複数の出力オプション",
  "Tube Diameter: Customizable tube diameter": "チューブ直径: カスタマイズ可能なチューブ直径",
  "Max Tube Length: Customizable length": "最大チューブ長: カスタマイズ可能な長さ",
  "Tube Shapes: Round, Square, Rectangular, Oval": "チューブの形状: 円形、正方形、長方形、楕円形",
  "Control System": "制御システム",
  "CNC System: SmartCut AI Control": "CNC システム: SmartCut AI 制御",
  "Clamping: Four-Chuck System": "クランプ: 4 チャックシステム",
  "Positioning Accuracy: High precision": "位置決め精度：高精度",
  "Cutting Speed: Up to 120m/min": "切断速度：最大120m/分",
  "Key Features": "主な特長",
  "Automatic tube feeding system": "自動チューブ供給システム",
  "Real-time parameter optimization": "リアルタイムパラメータの最適化",
  "Four-chuck stable clamping": "4チャックで安定したクランプ",
  "Bevel cutting capability": "ベベルカット能力",
  "Why Choose Our Tube Laser Cutting Machine?": "当社のチューブレーザー切断機を選ぶ理由?",
  "Discover the key advantages that make our tube laser cutting machine the preferred choice for precision tube fabrication and structural manufacturing": "当社のチューブレーザー切断機が精密チューブ製造および構造製造に最適な選択肢となる主な利点をご覧ください。",
  "Ultra-High Precision": "超高精度",
  "Positioning accuracy of High precision ensures tight dimensional tolerances for complex tube geometries and intricate patterns": "高精度の位置決め精度により、複雑なチューブ形状や複雑なパターンに対して厳しい寸法公差を保証します",
  "Four-Chuck Clamping": "4チャッククランプ",
  "Stable four-chuck clamping system minimizes vibration and prevents tube displacement during cutting operations": "安定した 4 チャック クランプ システムにより振動が最小限に抑えられ、切断作業中のチューブのズレを防ぎます。",
  "Automatic Feeding": "自動供給",
  "Bundle feeder holds up to 1800kg of raw tube stock for uninterrupted processing and maximum productivity": "バンドルフィーダーは最大 1800kg の生チューブストックを保持し、中断のない処理と最大の生産性を実現します",
  "AI Parameter Optimization": "AIパラメータの最適化",
  "SmartCut AI automatically adjusts cutting parameters for material variations, reducing scrap by up to 18%": "SmartCut AI は材料の変化に応じて切断パラメータを自動的に調整し、スクラップを最大 18% 削減します",
  "Versatile Tube Shapes": "多彩なチューブ形状",
  "Cuts round, square, rectangular, and oval tubes with various wall thicknesses and diameters": "さまざまな肉厚と直径の円形、正方形、長方形、楕円形のチューブを切断します。",
  "High Speed Cutting": "高速切断",
  "Cutting speeds exceeding 120m/min for thin-walled tubes dramatically increase throughput and efficiency": "薄肉チューブの切断速度が 120m/分を超えるため、スループットと効率が大幅に向上します。",
  "Key Components": "主要コンポーネント",
  "Understanding the core components that deliver precision tube cutting performance and reliability": "精密なチューブ切断性能と信頼性を実現するコアコンポーネントを理解する",
  "Fiber Laser Source": "ファイバーレーザー源",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan. Stable output ensures consistent cutting quality across all tube materials.": "Raycus や IPG などの大手メーカーの高出力ファイバー レーザー ジェネレーター (複数の出力オプション)。",
  "Four-Chuck Clamping System": "4 チャッククランプシステム",
  "Advanced four-chuck pneumatic clamping system provides stable tube positioning during cutting. Minimizes vibration and prevents tube displacement, ensuring precise cuts and tight tolerances. Quick-release design allows rapid tube changes for efficient production. Compatible with various tube shapes and sizes.": "高度な 4 チャック空気圧クランプ システムにより、切断中のチューブの位置が安定します。",
  "Automatic Tube Feeding System": "自動経管供給システム",
  "Bundle feeder system holds up to 1800kg of raw tube stock for continuous operation. Automatically feeds tubes one by one into the cutting area, eliminating manual loading and maximizing productivity. Programmable for different tube sizes and materials. Reduces operator intervention and increases throughput.": "バンドルフィーダーシステムは、連続運転のために最大 1800kg の生チューブストックを保持します。",
  "SmartCut AI Control System": "SmartCut AI 制御システム",
  "Intelligent CNC control system with real-time parameter optimization. Automatically adjusts laser power, cutting speed, and focus position based on material characteristics and tube geometry. Reduces scrap by up to 18% through intelligent analysis. User-friendly interface supports complex pattern programming and 3D visualization.": "リアルタイムのパラメータ最適化を備えたインテリジェントな CNC 制御システム。",
  "Rotary Chuck & Drive System": "ロータリーチャック＆ドライブシステム",
  "High-precision rotary drive system enables 360° tube rotation for complete circumferential cutting. Servo motor control provides smooth acceleration and accurate positioning. Synchronized with laser cutting head for complex patterns and bevel cuts. Supports cutting holes, slots, and contours at any angle around the tube.": "高精度回転駆動システムにより、チューブを 360°回転させて全周切断が可能です。",
  "Watch Our Machine in Action": "機械の動作をご覧ください",
  "See the precision and automation of our tube laser cutting machine in real production": "実際の生産における当社のチューブレーザー切断機の精度と自動化をご覧ください。",
  "Applications": "アプリケーション",
  "Our tube laser cutting machines serve diverse industries requiring precision tube and pipe processing": "当社のチューブレーザー切断機は、精密なチューブやパイプの加工を必要とするさまざまな業界に貢献しています。",
  "Automotive Industry": "自動車産業",
  "Manufacturing chassis components, exhaust systems, roll cages, and structural parts with precise tolerances": "シャーシコンポーネント、排気システム、ロールケージ、構造部品を正確な公差で製造",
  "Furniture Manufacturing": "家具製造",
  "Producing tubular components for chairs, tables, and decorative items with clean edges for both aesthetics and structure": "美観と構造の両方を考慮したきれいなエッジを備えた椅子、テーブル、装飾品用の管状コンポーネントの製造",
  "Construction Machinery": "建設機械",
  "Cutting structural frames, boom arms, and support beams for construction equipment and heavy machinery": "建設機械や重機の構造フレーム、ブームアーム、サポートビームの切断",
  "Renewable Energy": "再生可能エネルギー",
  "Precision tube cutting for wind turbine frames and solar panel supports requiring durability and exact tolerances": "耐久性と正確な公差が必要な風力タービンのフレームやソーラーパネルサポート用の精密チューブ切断",
  "Medical Equipment": "医療機器",
  "Manufacturing frames and structural components for medical devices that comply with strict regulatory standards": "厳しい規制基準に準拠した医療機器のフレームや構造部品の製造",
  "Fitness Equipment": "フィットネス機器",
  "Cutting structural tube frames for exercise machines, weight equipment, and gym apparatus": "エクササイズマシン、ウェイト器具、ジム器具の構造用チューブフレームの切断",
  "Agriculture Equipment": "農業機器",
  "Manufacturing tubular parts for tractors, harvesters, and farm equipment with complex geometries": "複雑な形状のトラクター、ハーベスター、農機具用の管状部品の製造",
  "Petroleum Pipelines": "石油パイプライン",
  "Precision cutting of pipe components and connections for oil and gas pipeline systems": "石油およびガスパイプラインシステムのパイプコンポーネントおよび接続部の精密切断",
  "Standard & Optional Configuration": "標準およびオプションの構成",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "標準機能とオプションのアップグレードを使用してマシンをカスタマイズし、特定の要件を満たすことができます",
  "Standard Configuration": "標準構成",
  "Optional Upgrades": "オプションのアップグレード",
  "Need help choosing the right configuration?": "適切な構成を選択するのにサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about our tube laser cutting machines": "当社のチューブレーザー切断機に関するよくある質問",
  "Our tube laser cutting machines can process round, square, rectangular, and oval tubes. Standard capacity ranges from customizable diameter, with optional upgrades available for tubes larger diameter options. The machine can handle tube lengths up to Customizable length (standard) with extended options up to 12000mm. Wall thicknesses depend on laser power and material type.": "当社のチューブレーザー切断機は、円形、正方形、長方形、楕円形のチューブを加工できます。",
  "The bundle feeder system can hold up to 1800kg of raw tube stock arranged in bundles. Tubes are automatically separated and fed one by one into the four-chuck clamping system. The system is programmable for different tube sizes and can operate continuously without manual intervention. This dramatically increases productivity by eliminating manual loading time and allowing operators to focus on other tasks.": "バンドルフィーダーシステムは、最大 1800kg の生チューブストックを束に配置して保持できます。",
  "The four-chuck clamping system provides superior stability compared to three-chuck systems. It minimizes vibration during cutting, prevents tube displacement, and ensures consistent positioning accuracy of High precision. This is especially important for thin-walled tubes and complex cutting patterns. The pneumatic system allows for quick tube changes while maintaining precise clamping force across different tube sizes.": "4 チャッククランプシステムは 3 チャックシステムと比較して優れた安定性を提供します。",
  "Yes, with the optional bevel cutting head upgrade, our tube laser can cut various bevel angles for pipe welding preparation. The system can create V-grooves, K-grooves, and other weld joint configurations at precise angles. This eliminates the need for secondary beveling operations and ensures perfect fit-up for welding. The SmartCut AI system automatically calculates optimal cutting paths for complex bevel geometries.": "はい、オプションのベベル切断ヘッドのアップグレードにより、当社のチューブレーザーはパイプ溶接の準備のためにさまざまなベベル角度を切断できます。",
  "The fiber laser tube cutter can process carbon steel, stainless steel, aluminum, copper, brass, and titanium tubes. Maximum cutting thickness varies by material: carbon steel up to 8mm, stainless steel up to 6mm, aluminum up to 5mm (thicknesses depend on laser power). The machine handles both coated and uncoated tubes, including galvanized and powder-coated materials.": "ファイバーレーザーチューブカッターは、炭素鋼、ステンレス鋼、アルミニウム、銅、真鍮、チタンのチューブを加工できます。",
  "SmartCut AI is our intelligent control system that automatically optimizes cutting parameters in real-time. It analyzes tube geometry, material characteristics, and wall thickness to adjust laser power, cutting speed, and focal position. This reduces material waste by up to 18%, improves edge quality, and minimizes operator skill requirements. The system also includes automatic nesting software to maximize material utilization.": "SmartCut AI は、リアルタイムで切断パラメータを自動的に最適化する当社のインテリジェントな制御システムです。",
  "Still have questions?": "まだ質問がありますか?",
  "Download Technical Brochure": "技術パンフレットをダウンロード",
  "Get detailed technical specifications, dimensions, and performance data for our tube laser cutting machines. Download our comprehensive product brochure in PDF format.": "当社のチューブレーザー切断機の詳細な技術仕様、寸法、性能データを入手してください。"
}