{
  "Tube Laser Cutting Machine": "Станок для лазерной резки труб",
  "Advanced fiber laser tube cutting system with four-chuck clamping and automatic feeding. Cuts round, square, and rectangular tubes with exceptional precision and speed. Ideal for structural fabrication, furniture manufacturing, and automotive components.": "Усовершенствованная система резки труб волоконным лазером с четырьмя зажимными патронами и автоматической подачей. ",
  "Request Quote": "Запросить цену",
  "Watch Video": "Посмотреть видео",
  "Technical Specifications": "Технические характеристики",
  "High-performance tube laser cutting system with automatic feeding and intelligent control": "Высокопроизводительная система лазерной резки труб с автоматической подачей и интеллектуальным управлением.",
  "Cutting Capacity": "Режущая способность",
  "Laser Power: Multiple power options": "Мощность лазера: несколько вариантов мощности",
  "Tube Diameter: Customizable tube diameter": "Диаметр трубки: настраиваемый диаметр трубки",
  "Max Tube Length: Customizable length": "Максимальная длина трубки: настраиваемая длина",
  "Tube Shapes: Round, Square, Rectangular, Oval": "Формы трубок: круглые, квадратные, прямоугольные, овальные.",
  "Control System": "Система управления",
  "CNC System: SmartCut AI Control": "Система ЧПУ: управление SmartCut AI",
  "Clamping: Four-Chuck System": "Зажим: система с четырьмя патронами",
  "Positioning Accuracy: High precision": "Точность позиционирования: Высокая точность",
  "Cutting Speed: Up to 120m/min": "Скорость резки: до 120 м/мин.",
  "Key Features": "Ключевые особенности",
  "Automatic tube feeding system": "Автоматическая система подачи трубок",
  "Real-time parameter optimization": "Оптимизация параметров в реальном времени",
  "Four-chuck stable clamping": "Стабильный зажим с четырьмя патронами",
  "Bevel cutting capability": "Возможность наклонной резки",
  "Why Choose Our Tube Laser Cutting Machine?": "Почему стоит выбрать наш станок для лазерной резки труб?",
  "Discover the key advantages that make our tube laser cutting machine the preferred choice for precision tube fabrication and structural manufacturing": "Откройте для себя ключевые преимущества, которые делают наш станок для лазерной резки труб предпочтительным выбором для прецизионного изготовления труб и изготовления конструкций.",
  "Ultra-High Precision": "Сверхвысокая точность",
  "Positioning accuracy of High precision ensures tight dimensional tolerances for complex tube geometries and intricate patterns": "Точность позиционирования Высокая точность обеспечивает жесткие допуски на размеры труб сложной геометрии и сложных узоров.",
  "Four-Chuck Clamping": "Зажим с четырьмя патронами",
  "Stable four-chuck clamping system minimizes vibration and prevents tube displacement during cutting operations": "Стабильная система зажима с четырьмя патронами минимизирует вибрацию и предотвращает смещение трубы во время резки.",
  "Automatic Feeding": "Автоматическая подача",
  "Bundle feeder holds up to 1800kg of raw tube stock for uninterrupted processing and maximum productivity": "Устройство подачи пачек вмещает до 1800 кг необработанных труб для бесперебойной обработки и максимальной производительности.",
  "AI Parameter Optimization": "Оптимизация параметров ИИ",
  "SmartCut AI automatically adjusts cutting parameters for material variations, reducing scrap by up to 18%": "SmartCut AI автоматически настраивает параметры резки в зависимости от материала, сокращая количество отходов до 18 %.",
  "Versatile Tube Shapes": "Универсальные формы трубок",
  "Cuts round, square, rectangular, and oval tubes with various wall thicknesses and diameters": "Режет круглые, квадратные, прямоугольные и овальные трубы с различной толщиной стенок и диаметром.",
  "High Speed Cutting": "Высокоскоростная резка",
  "Cutting speeds exceeding 120m/min for thin-walled tubes dramatically increase throughput and efficiency": "Скорость резки тонкостенных труб, превышающая 120 м/мин, значительно увеличивает производительность и эффективность.",
  "Key Components": "Ключевые компоненты",
  "Understanding the core components that deliver precision tube cutting performance and reliability": "Понимание основных компонентов, которые обеспечивают производительность и надежность точной резки труб.",
  "Fiber Laser Source": "Волоконный лазерный источник",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan. Stable output ensures consistent cutting quality across all tube materials.": "Мощный волоконный лазерный генератор (несколько вариантов мощности) от ведущих производителей, таких как Raycus или IPG. ",
  "Four-Chuck Clamping System": "Система зажима с четырьмя патронами",
  "Advanced four-chuck pneumatic clamping system provides stable tube positioning during cutting. Minimizes vibration and prevents tube displacement, ensuring precise cuts and tight tolerances. Quick-release design allows rapid tube changes for efficient production. Compatible with various tube shapes and sizes.": "Усовершенствованная система пневматического зажима с четырьмя патронами обеспечивает стабильное позиционирование трубы во время резки. ",
  "Automatic Tube Feeding System": "Автоматическая система подачи трубок",
  "Bundle feeder system holds up to 1800kg of raw tube stock for continuous operation. Automatically feeds tubes one by one into the cutting area, eliminating manual loading and maximizing productivity. Programmable for different tube sizes and materials. Reduces operator intervention and increases throughput.": "Система подачи пачек вмещает до 1800 кг необработанных труб для непрерывной работы. ",
  "SmartCut AI Control System": "Система управления SmartCut с искусственным интеллектом",
  "Intelligent CNC control system with real-time parameter optimization. Automatically adjusts laser power, cutting speed, and focus position based on material characteristics and tube geometry. Reduces scrap by up to 18% through intelligent analysis. User-friendly interface supports complex pattern programming and 3D visualization.": "Интеллектуальная система управления ЧПУ с оптимизацией параметров в реальном времени. ",
  "Rotary Chuck & Drive System": "Роторный патрон и система привода",
  "High-precision rotary drive system enables 360° tube rotation for complete circumferential cutting. Servo motor control provides smooth acceleration and accurate positioning. Synchronized with laser cutting head for complex patterns and bevel cuts. Supports cutting holes, slots, and contours at any angle around the tube.": "Высокоточная поворотная система привода обеспечивает вращение трубы на 360° для полной резки по окружности. ",
  "Watch Our Machine in Action": "Посмотрите нашу машину в действии",
  "See the precision and automation of our tube laser cutting machine in real production": "Посмотрите точность и автоматизацию нашего станка для лазерной резки труб в реальном производстве.",
  "Applications": "Приложения",
  "Our tube laser cutting machines serve diverse industries requiring precision tube and pipe processing": "Наши станки для лазерной резки труб используются в различных отраслях промышленности, где требуется прецизионная обработка труб и труб.",
  "Automotive Industry": "Автомобильная промышленность",
  "Manufacturing chassis components, exhaust systems, roll cages, and structural parts with precise tolerances": "Производство компонентов шасси, выхлопных систем, каркасов безопасности и деталей конструкции с точными допусками.",
  "Furniture Manufacturing": "Производство мебели",
  "Producing tubular components for chairs, tables, and decorative items with clean edges for both aesthetics and structure": "Производство трубчатых компонентов для стульев, столов и декоративных предметов с чистыми краями, обеспечивающими эстетику и структуру.",
  "Construction Machinery": "Строительная техника",
  "Cutting structural frames, boom arms, and support beams for construction equipment and heavy machinery": "Резка структурных рам, стрел и опорных балок строительной и тяжелой техники.",
  "Renewable Energy": "Возобновляемая энергия",
  "Precision tube cutting for wind turbine frames and solar panel supports requiring durability and exact tolerances": "Прецизионная резка труб для рам ветряных турбин и опор солнечных панелей, требующих долговечности и точных допусков.",
  "Medical Equipment": "Медицинское оборудование",
  "Manufacturing frames and structural components for medical devices that comply with strict regulatory standards": "Производство каркасов и конструктивных элементов для медицинских изделий, соответствующих строгим нормативным стандартам.",
  "Fitness Equipment": "Фитнес-оборудование",
  "Cutting structural tube frames for exercise machines, weight equipment, and gym apparatus": "Резка трубчатых рам для тренажеров, силового оборудования и тренажеров.",
  "Agriculture Equipment": "Сельскохозяйственное оборудование",
  "Manufacturing tubular parts for tractors, harvesters, and farm equipment with complex geometries": "Производство трубчатых деталей для тракторов, комбайнов и сельскохозяйственной техники сложной геометрии.",
  "Petroleum Pipelines": "Нефтяные Трубопроводы",
  "Precision cutting of pipe components and connections for oil and gas pipeline systems": "Прецизионная резка деталей труб и соединений для нефте- и газопроводных систем",
  "Standard & Optional Configuration": "Стандартная и дополнительная конфигурация",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Настройте свою машину с помощью стандартных функций и дополнительных обновлений в соответствии с вашими конкретными требованиями.",
  "Standard Configuration": "Стандартная конфигурация",
  "Optional Upgrades": "Дополнительные обновления",
  "Need help choosing the right configuration?": "Нужна помощь в выборе правильной конфигурации?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about our tube laser cutting machines": "Общие вопросы о наших станках для лазерной резки труб",
  "Our tube laser cutting machines can process round, square, rectangular, and oval tubes. Standard capacity ranges from customizable diameter, with optional upgrades available for tubes larger diameter options. The machine can handle tube lengths up to Customizable length (standard) with extended options up to 12000mm. Wall thicknesses depend on laser power and material type.": "Наши станки для лазерной резки труб могут обрабатывать круглые, квадратные, прямоугольные и овальные трубы. ",
  "The bundle feeder system can hold up to 1800kg of raw tube stock arranged in bundles. Tubes are automatically separated and fed one by one into the four-chuck clamping system. The system is programmable for different tube sizes and can operate continuously without manual intervention. This dramatically increases productivity by eliminating manual loading time and allowing operators to focus on other tasks.": "Система подачи пачек может вмещать до 1800 кг необработанных труб, уложенных в пачки. ",
  "The four-chuck clamping system provides superior stability compared to three-chuck systems. It minimizes vibration during cutting, prevents tube displacement, and ensures consistent positioning accuracy of High precision. This is especially important for thin-walled tubes and complex cutting patterns. The pneumatic system allows for quick tube changes while maintaining precise clamping force across different tube sizes.": "Система зажима с четырьмя патронами обеспечивает превосходную стабильность по сравнению с системами с тремя патронами. ",
  "Yes, with the optional bevel cutting head upgrade, our tube laser can cut various bevel angles for pipe welding preparation. The system can create V-grooves, K-grooves, and other weld joint configurations at precise angles. This eliminates the need for secondary beveling operations and ensures perfect fit-up for welding. The SmartCut AI system automatically calculates optimal cutting paths for complex bevel geometries.": "Да, благодаря дополнительной модернизации головки для резки фасок наш трубчатый лазер может резать фаски под разными углами для подготовки труб к сварке. ",
  "The fiber laser tube cutter can process carbon steel, stainless steel, aluminum, copper, brass, and titanium tubes. Maximum cutting thickness varies by material: carbon steel up to 8mm, stainless steel up to 6mm, aluminum up to 5mm (thicknesses depend on laser power). The machine handles both coated and uncoated tubes, including galvanized and powder-coated materials.": "Волоконный лазерный труборез может обрабатывать трубы из углеродистой стали, нержавеющей стали, алюминия, меди, латуни и титана. ",
  "SmartCut AI is our intelligent control system that automatically optimizes cutting parameters in real-time. It analyzes tube geometry, material characteristics, and wall thickness to adjust laser power, cutting speed, and focal position. This reduces material waste by up to 18%, improves edge quality, and minimizes operator skill requirements. The system also includes automatic nesting software to maximize material utilization.": "SmartCut AI — это наша интеллектуальная система управления, которая автоматически оптимизирует параметры резки в режиме реального времени. ",
  "Still have questions?": "Остались вопросы?",
  "Download Technical Brochure": "Загрузить техническую брошюру",
  "Get detailed technical specifications, dimensions, and performance data for our tube laser cutting machines. Download our comprehensive product brochure in PDF format.": "Получите подробные технические характеристики, размеры и характеристики наших станков для лазерной резки труб. "
}