{
  "Tube Laser Cutting Machine": "Rohrlaserschneidemaschine",
  "Advanced fiber laser tube cutting system with four-chuck clamping and automatic feeding. Cuts round, square, and rectangular tubes with exceptional precision and speed. Ideal for structural fabrication, furniture manufacturing, and automotive components.": "Fortschrittliches Faserlaser-Rohrschneidsystem mit Vier-Spannfutter-Spannung und automatischem Vorschub. ",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "High-performance tube laser cutting system with automatic feeding and intelligent control": "Hochleistungs-Rohrlaserschneidanlage mit automatischer Zuführung und intelligenter Steuerung",
  "Cutting Capacity": "Schnittkapazität",
  "Laser Power: Multiple power options": "Laserleistung: Mehrere Leistungsoptionen",
  "Tube Diameter: Customizable tube diameter": "Rohrdurchmesser: Anpassbarer Rohrdurchmesser",
  "Max Tube Length: Customizable length": "Maximale Rohrlänge: Anpassbare Länge",
  "Tube Shapes: Round, Square, Rectangular, Oval": "Rohrformen: Rund, Quadratisch, Rechteckig, Oval",
  "Control System": "Kontrollsystem",
  "CNC System: SmartCut AI Control": "CNC-System: SmartCut AI Control",
  "Clamping: Four-Chuck System": "Spannung: Vier-Chuck-System",
  "Positioning Accuracy: High precision": "Positionierungsgenauigkeit: Hohe Präzision",
  "Cutting Speed: Up to 120m/min": "Schnittgeschwindigkeit: Bis zu 120 m/min",
  "Key Features": "Hauptmerkmale",
  "Automatic tube feeding system": "Automatisches Schlauchzuführungssystem",
  "Real-time parameter optimization": "Parameteroptimierung in Echtzeit",
  "Four-chuck stable clamping": "Stabile Vier-Spannfutter-Spannung",
  "Bevel cutting capability": "Fähigkeit zum Fasenschneiden",
  "Why Choose Our Tube Laser Cutting Machine?": "Warum sollten Sie sich für unsere Rohrlaserschneidmaschine entscheiden?",
  "Discover the key advantages that make our tube laser cutting machine the preferred choice for precision tube fabrication and structural manufacturing": "Entdecken Sie die wichtigsten Vorteile, die unsere Rohrlaserschneidmaschine zur bevorzugten Wahl für die Präzisionsrohrfertigung und Strukturfertigung machen",
  "Ultra-High Precision": "Ultrahohe Präzision",
  "Positioning accuracy of High precision ensures tight dimensional tolerances for complex tube geometries and intricate patterns": "Die hohe Positionierungsgenauigkeit gewährleistet enge Maßtoleranzen für komplexe Rohrgeometrien und komplizierte Muster",
  "Four-Chuck Clamping": "Vier-Futter-Spannung",
  "Stable four-chuck clamping system minimizes vibration and prevents tube displacement during cutting operations": "Das stabile Vier-Spannfutter-Spannsystem minimiert Vibrationen und verhindert Rohrverschiebungen während des Schneidvorgangs",
  "Automatic Feeding": "Automatische Fütterung",
  "Bundle feeder holds up to 1800kg of raw tube stock for uninterrupted processing and maximum productivity": "Der Bündelzuführer fasst bis zu 1.800 kg Rohrrohmaterial für eine unterbrechungsfreie Verarbeitung und maximale Produktivität",
  "AI Parameter Optimization": "KI-Parameteroptimierung",
  "SmartCut AI automatically adjusts cutting parameters for material variations, reducing scrap by up to 18%": "SmartCut AI passt die Schnittparameter automatisch an Materialschwankungen an und reduziert so den Ausschuss um bis zu 18 %.",
  "Versatile Tube Shapes": "Vielseitige Rohrformen",
  "Cuts round, square, rectangular, and oval tubes with various wall thicknesses and diameters": "Schneidet runde, quadratische, rechteckige und ovale Rohre mit unterschiedlichen Wandstärken und Durchmessern",
  "High Speed Cutting": "Hochgeschwindigkeitsschneiden",
  "Cutting speeds exceeding 120m/min for thin-walled tubes dramatically increase throughput and efficiency": "Schneidgeschwindigkeiten von mehr als 120 m/min für dünnwandige Rohre erhöhen den Durchsatz und die Effizienz erheblich",
  "Key Components": "Schlüsselkomponenten",
  "Understanding the core components that deliver precision tube cutting performance and reliability": "Verständnis der Kernkomponenten, die für präzise Leistung und Zuverlässigkeit beim Rohrschneiden sorgen",
  "Fiber Laser Source": "Faserlaserquelle",
  "High-power fiber laser generator (multiple power options) from leading manufacturers like Raycus or IPG. Offers exceptional beam quality, high electro-optical efficiency up to 30%, and maintenance-free operation with 100,000+ hour lifespan. Stable output ensures consistent cutting quality across all tube materials.": "Hochleistungs-Faserlasergenerator (mehrere Leistungsoptionen) von führenden Herstellern wie Raycus oder IPG. ",
  "Four-Chuck Clamping System": "Vier-Chuck-Spannsystem",
  "Advanced four-chuck pneumatic clamping system provides stable tube positioning during cutting. Minimizes vibration and prevents tube displacement, ensuring precise cuts and tight tolerances. Quick-release design allows rapid tube changes for efficient production. Compatible with various tube shapes and sizes.": "Das fortschrittliche pneumatische Spannsystem mit vier Spannfuttern sorgt für eine stabile Rohrpositionierung während des Schneidens. ",
  "Automatic Tube Feeding System": "Automatisches Rohrzuführsystem",
  "Bundle feeder system holds up to 1800kg of raw tube stock for continuous operation. Automatically feeds tubes one by one into the cutting area, eliminating manual loading and maximizing productivity. Programmable for different tube sizes and materials. Reduces operator intervention and increases throughput.": "Das Bündelzuführsystem fasst bis zu 1.800 kg Rohrrohmaterial für den kontinuierlichen Betrieb. ",
  "SmartCut AI Control System": "SmartCut AI-Steuerungssystem",
  "Intelligent CNC control system with real-time parameter optimization. Automatically adjusts laser power, cutting speed, and focus position based on material characteristics and tube geometry. Reduces scrap by up to 18% through intelligent analysis. User-friendly interface supports complex pattern programming and 3D visualization.": "Intelligentes CNC-Steuerungssystem mit Echtzeit-Parameteroptimierung. ",
  "Rotary Chuck & Drive System": "Drehspannfutter und Antriebssystem",
  "High-precision rotary drive system enables 360° tube rotation for complete circumferential cutting. Servo motor control provides smooth acceleration and accurate positioning. Synchronized with laser cutting head for complex patterns and bevel cuts. Supports cutting holes, slots, and contours at any angle around the tube.": "Das hochpräzise Drehantriebssystem ermöglicht eine 360°-Rohrdrehung für einen vollständigen Umfangsschnitt. ",
  "Watch Our Machine in Action": "Sehen Sie unsere Maschine in Aktion",
  "See the precision and automation of our tube laser cutting machine in real production": "Erleben Sie die Präzision und Automatisierung unserer Rohrlaserschneidmaschine in der realen Produktion",
  "Applications": "Anwendungen",
  "Our tube laser cutting machines serve diverse industries requiring precision tube and pipe processing": "Unsere Laserschneidmaschinen für Rohre bedienen verschiedene Branchen, die eine präzise Rohr- und Leitungsbearbeitung erfordern",
  "Automotive Industry": "Automobilindustrie",
  "Manufacturing chassis components, exhaust systems, roll cages, and structural parts with precise tolerances": "Herstellung von Fahrwerkskomponenten, Abgassystemen, Überrollkäfigen und Strukturteilen mit präzisen Toleranzen",
  "Furniture Manufacturing": "Möbelherstellung",
  "Producing tubular components for chairs, tables, and decorative items with clean edges for both aesthetics and structure": "Herstellung von Rohrkomponenten für Stühle, Tische und Dekorationsgegenstände mit sauberen Kanten für Ästhetik und Struktur",
  "Construction Machinery": "Baumaschinen",
  "Cutting structural frames, boom arms, and support beams for construction equipment and heavy machinery": "Schneiden von Strukturrahmen, Auslegerarmen und Stützbalken für Baumaschinen und schwere Maschinen",
  "Renewable Energy": "Erneuerbare Energie",
  "Precision tube cutting for wind turbine frames and solar panel supports requiring durability and exact tolerances": "Präzises Rohrschneiden für Windkraftanlagenrahmen und Solarpanelträger, bei denen Haltbarkeit und genaue Toleranzen erforderlich sind",
  "Medical Equipment": "Medizinische Ausrüstung",
  "Manufacturing frames and structural components for medical devices that comply with strict regulatory standards": "Herstellung von Rahmen und Strukturkomponenten für medizinische Geräte, die strengen gesetzlichen Standards entsprechen",
  "Fitness Equipment": "Fitnessgeräte",
  "Cutting structural tube frames for exercise machines, weight equipment, and gym apparatus": "Schneiden von Strukturrohrrahmen für Trainingsgeräte, Kraftgeräte und Fitnessgeräte",
  "Agriculture Equipment": "Landwirtschaftliche Ausrüstung",
  "Manufacturing tubular parts for tractors, harvesters, and farm equipment with complex geometries": "Herstellung von Rohrteilen für Traktoren, Erntemaschinen und Landmaschinen mit komplexen Geometrien",
  "Petroleum Pipelines": "Erdölpipelines",
  "Precision cutting of pipe components and connections for oil and gas pipeline systems": "Präzisionsschneiden von Rohrkomponenten und Verbindungen für Öl- und Gaspipelinesysteme",
  "Standard & Optional Configuration": "Standard- und optionale Konfiguration",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Passen Sie Ihre Maschine mit Standardfunktionen und optionalen Upgrades an Ihre spezifischen Anforderungen an",
  "Standard Configuration": "Standardkonfiguration",
  "Optional Upgrades": "Optionale Upgrades",
  "Need help choosing the right configuration?": "Benötigen Sie Hilfe bei der Auswahl der richtigen Konfiguration?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about our tube laser cutting machines": "Häufige Fragen zu unseren Rohrlaserschneidmaschinen",
  "Our tube laser cutting machines can process round, square, rectangular, and oval tubes. Standard capacity ranges from customizable diameter, with optional upgrades available for tubes larger diameter options. The machine can handle tube lengths up to Customizable length (standard) with extended options up to 12000mm. Wall thicknesses depend on laser power and material type.": "Unsere Rohrlaserschneidmaschinen können runde, quadratische, rechteckige und ovale Rohre bearbeiten. ",
  "The bundle feeder system can hold up to 1800kg of raw tube stock arranged in bundles. Tubes are automatically separated and fed one by one into the four-chuck clamping system. The system is programmable for different tube sizes and can operate continuously without manual intervention. This dramatically increases productivity by eliminating manual loading time and allowing operators to focus on other tasks.": "Das Bündelzuführsystem kann bis zu 1800 kg Rohrohrmaterial in Bündeln lagern. ",
  "The four-chuck clamping system provides superior stability compared to three-chuck systems. It minimizes vibration during cutting, prevents tube displacement, and ensures consistent positioning accuracy of High precision. This is especially important for thin-walled tubes and complex cutting patterns. The pneumatic system allows for quick tube changes while maintaining precise clamping force across different tube sizes.": "Das Vier-Spannfutter-Spannsystem bietet im Vergleich zu Drei-Spannfutter-Systemen eine überlegene Stabilität. ",
  "Yes, with the optional bevel cutting head upgrade, our tube laser can cut various bevel angles for pipe welding preparation. The system can create V-grooves, K-grooves, and other weld joint configurations at precise angles. This eliminates the need for secondary beveling operations and ensures perfect fit-up for welding. The SmartCut AI system automatically calculates optimal cutting paths for complex bevel geometries.": "Ja, mit dem optionalen Fasenschneidkopf-Upgrade kann unser Rohrlaser verschiedene Fasenwinkel zur Rohrschweißvorbereitung schneiden. ",
  "The fiber laser tube cutter can process carbon steel, stainless steel, aluminum, copper, brass, and titanium tubes. Maximum cutting thickness varies by material: carbon steel up to 8mm, stainless steel up to 6mm, aluminum up to 5mm (thicknesses depend on laser power). The machine handles both coated and uncoated tubes, including galvanized and powder-coated materials.": "Der Faserlaser-Rohrschneider kann Kohlenstoffstahl-, Edelstahl-, Aluminium-, Kupfer-, Messing- und Titanrohre bearbeiten. ",
  "SmartCut AI is our intelligent control system that automatically optimizes cutting parameters in real-time. It analyzes tube geometry, material characteristics, and wall thickness to adjust laser power, cutting speed, and focal position. This reduces material waste by up to 18%, improves edge quality, and minimizes operator skill requirements. The system also includes automatic nesting software to maximize material utilization.": "SmartCut AI ist unser intelligentes Steuerungssystem, das die Schnittparameter automatisch und in Echtzeit optimiert. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Download Technical Brochure": "Laden Sie die technische Broschüre herunter",
  "Get detailed technical specifications, dimensions, and performance data for our tube laser cutting machines. Download our comprehensive product brochure in PDF format.": "Erhalten Sie detaillierte technische Spezifikationen, Abmessungen und Leistungsdaten für unsere Rohrlaserschneidmaschinen. "
}