{
  "Electro-hydraulic CNC Bending Machine": "電動油圧式CNCベンディングマシン",
  "New industrial design, top-level craftsmanship, pleasing appearance": "新しい工業デザイン、トップレベルの職人技、心地よい外観",
  "Heavy-duty frame, robust and durable": "頑丈なフレーム、頑丈で耐久性のある",
  "Advanced production technology and strict quality control": "高度な生産技術と徹底した品質管理",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "Advanced electro-hydraulic CNC bending machine with precision control and high efficiency": "精密制御と高効率を備えた先進的な電動油圧式 CNC 曲げ機",
  "Machine Capacity": "機械能力",
  "Available in various tonnage ranges": "さまざまなトン数範囲で利用可能",
  "Multiple table length options": "複数のテーブル長オプション",
  "Adjustable stroke capabilities": "調整可能なストローク機能",
  "Various throat depth configurations": "さまざまなスロート深さの構成",
  "Control System": "制御システム",
  "CNC Controller: Advanced digital": "CNCコントローラー：アドバンストデジタル",
  "Positioning Accuracy: High precision": "位置決め精度：高精度",
  "Back Gauge: Multi-axis CNC control": "バックゲージ：多軸CNC制御",
  "Safety: CE certified": "安全性: CE 認証済み",
  "Features": "特徴",
  "Electro-hydraulic drive system": "電気油圧駆動システム",
  "Heavy-duty welded frame": "頑丈な溶接フレーム",
  "Multiple tool solutions": "複数のツールソリューション",
  "Easy operation interface": "簡単な操作インターフェイス",
  "Why Choose Our CNC Bending Machine?": "当社の CNC ベンディングマシンを選ぶ理由?",
  "Discover the key advantages that make our electro-hydraulic CNC bending machine the preferred choice for manufacturers worldwide": "当社の電気油圧式 CNC 曲げ機が世界中のメーカーに選ばれる主な利点をご覧ください。",
  "Advanced CNC controller with intuitive touch screen interface. Features include automatic bending sequence programming, real-time angle monitoring, multiple bending modes, and data storage capabilities. The system allows for precise control of bending angle, depth, and speed.": "直感的なタッチスクリーンインターフェイスを備えた高度な CNC コントローラー。機能には、自動曲げシーケンス プログラミング、リアルタイム角度モニタリング、複数の曲げモード、データ ストレージ機能が含まれます。このシステムにより、曲げ角度、深さ、速度を正確に制御できます。",
  "Advanced hydraulic system optimizes energy consumption while maintaining high performance": "高度な油圧システムにより、高性能を維持しながらエネルギー消費を最適化します。",
  "Aerospace": "航空宇宙",
  "Applications": "アプリケーション",
  "Architectural metalwork, railings, and structural steel": "建築金物、手すり、形鋼",
  "Are spare parts readily available?": "スペアパーツはすぐに入手できますか?",
  "Automotive Industry": "自動車産業",
  "Back Gauge System": "バックゲージシステム",
  "CE certified with comprehensive safety features including light curtains and emergency stops": "ライトカーテンや緊急停止などの包括的な安全機能を備えたCE認定済み",
  "CNC Control System": "CNC制御システム",
  "Common questions about our electro-hydraulic CNC bending machines": "電動油圧式 CNC 曲げ機に関するよくある質問",
  "Compatible with various punch and die configurations for diverse bending applications": "多様な曲げ用途に対応するさまざまなパンチとダイの構成と互換性があります",
  "Components": "コンポーネント",
  "Comprehensive safety features including light curtains, emergency stop buttons, and safety guards. The machine meets CE safety standards and incorporates multiple protection mechanisms to ensure operator safety during all phases of operation while maintaining maximum productivity.": "ライトカーテン、非常停止ボタン、セーフティガードなどの総合安全機能を搭載。この機械は CE 安全基準を満たしており、最大限の生産性を維持しながら、操作のすべての段階でオペレータの安全を確保するための複数の保護機構が組み込まれています。",
  "Construction": "工事",
  "Contact our support team →": "サポートチームにお問い合わせください→",
  "Do you provide installation and training?": "設置とトレーニングは提供されますか?",
  "Download Technical Brochure": "技術パンフレットをダウンロード",
  "Ductwork, ventilation components, and air conditioning parts": "ダクト、換気部品、空調部品",
  "Easy Operation": "簡単操作",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "電気油圧プレス ブレーキは、電子制御システムを使用してシリンダ間の正確な同期を実現し、従来の油圧システムと比較して精度と再現性が向上します。また、消費エネルギーも少なくなり、応答時間が短縮されます。",
  "Electronics": "エレクトロニクス",
  "Energy Efficient": "エネルギー効率が高い",
  "Frequently Asked Questions": "よくある質問",
  "Furniture": "家具",
  "HVAC Systems": "HVAC システム",
  "Heavy-duty welded steel frame ensures long-term stability and durability under continuous operation": "耐久性の高い溶接スチールフレームにより、連続運転下でも長期の安定性と耐久性を保証します。",
  "High Precision": "高精度",
  "High positioning accuracy ensures consistent bending quality for demanding applications": "高い位置決め精度により、要求の厳しい用途でも一貫した曲げ品質を保証します",
  "High-precision bending for aircraft components and assemblies": "航空機の部品やアセンブリの高精度曲げ加工",
  "How long is the warranty period?": "保証期間はどれくらいですか?",
  "Hydraulic System": "油圧システム",
  "Industrial Equipment": "産業機器",
  "Intuitive CNC controller with touch screen interface reduces training time and increases productivity": "タッチスクリーンインターフェイスを備えた直感的な CNC コントローラーにより、トレーニング時間が短縮され、生産性が向上します。",
  "Machine guards, hoppers, and custom metal parts": "マシンガード、ホッパー、カスタム金属部品",
  "Manufacturing of brackets, frames, and body parts": "ブラケット、フレーム、ボディ部品の製造",
  "Mechanical Structure": "機械構造",
  "Metal furniture frames, cabinets, and decorative elements": "金属製の家具フレーム、キャビネット、装飾要素",
  "Multi-axis CNC back gauge system with ball screw transmission for high positioning accuracy. The system features automatic positioning, programmable movements, and can be equipped with additional support arms for handling large workpieces efficiently and accurately.": "ボールネジ伝達を備えた多軸CNCバックゲージシステムにより、高い位置決め精度を実現します。このシステムは自動位置決め、プログラム可能な動作を備えており、大きなワークピースを効率的かつ正確に取り扱うための追加のサポートアームを装備することができます。",
  "Need help choosing the right configuration?": "適切な構成を選択するのにサポートが必要ですか?",
  "Optional Upgrades": "オプションのアップグレード",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "当社の CNC 曲げ機は、軟鋼、ステンレス鋼、アルミニウム、銅、その他の合金を含むさまざまな材料を加工できます。最大厚さは材料の種類と機械のトン数によって異なります。",
  "Precision bending for enclosures, chassis, and structural components": "エンクロージャ、シャーシ、構造コンポーネントの精密曲げ",
  "Robust Construction": "堅牢な構造",
  "Safety First": "安全第一",
  "Safety System": "安全システム",
  "Server racks, control cabinets, and electronic enclosures": "サーバーラック、制御キャビネット、電子エンクロージャ",
  "Sheet Metal Fabrication": "板金加工",
  "Size: 2.5 MB | Pages: 24": "サイズ: 2.5 MB |ページ数: 24",
  "Standard & Optional Configuration": "標準およびオプションの構成",
  "Standard Configuration": "標準構成",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "標準構成は通常 30 ～ 45 日以内に出荷されます。カスタム構成には 60 ～ 90 日かかる場合があります。ご注文時に具体的な納期をお知らせいたします。",
  "Still have questions?": "まだ質問がありますか?",
  "The electro-hydraulic synchronous system ensures precise synchronization of the left and right cylinders. Equipped with high-quality imported hydraulic components, the system provides stable pressure, low noise operation, and excellent energy efficiency for consistent bending performance.": "電気油圧同期システムにより、左右のシリンダーの正確な同期が保証されます。高品質の輸入油圧コンポーネントを装備したこのシステムは、安定した圧力、低騒音動作、優れたエネルギー効率を実現し、一貫した曲げ性能を実現します。",
  "The main mechanical structure of the press brake consists of the frame, column, ram, worktable, the main cylinder and backgauge. The main components are through finite element analysis and optimized design by 3D software to fully guarantee the structural strength and rigidity of each component.": "プレスブレーキの主な機械構造は、フレーム、コラム、ラム、ワークテーブル、メインシリンダー、バックゲージで構成されます。主要なコンポーネントは、有限要素解析と 3D ソフトウェアによる最適化設計を通じて行われ、各コンポーネントの構造強度と剛性が完全に保証されています。",
  "Versatile Tooling": "多用途のツール",
  "Watch Our Machine in Action": "機械の動作をご覧ください",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "すべての主要コンポーネントとシステムをカバーする包括的な 2 年間の保証を提供します。延長保証オプションもご利用いただけます。すべてのマシンには生涯テクニカル サポートが含まれています。",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "電気油圧プレスブレーキと油圧プレスブレーキの違いは何ですか?",
  "What is the typical lead time for delivery?": "配達までの通常のリードタイムはどれくらいですか?",
  "What materials can be bent with this machine?": "この機械で曲げられる材料は何ですか?",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "はい、当社はスペアパーツと消耗品の包括的な在庫を維持しています。ほとんどの部品は 24 ～ 48 時間以内に発送可能です。詳細なパーツカタログやメンテナンスガイドも提供しています。",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "はい、完全な設置サービスと包括的なオペレータートレーニングを提供します。当社の技術チームは、お客様の機械が適切にセットアップされ、オペレーターが効率的かつ安全に使用できるように十分な訓練を受けていることを保証します。",
  "You can better understand the performance of the machine through the following machine detail display and text description": "次のマシンの詳細表示とテキストの説明を通じて、マシンのパフォーマンスをよりよく理解できます。",
  "Are spare parts readily available? Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "スペアパーツはすぐに入手できますか?はい、当社はスペアパーツと消耗品の包括的な在庫を維持しています。ほとんどの部品は 24 ～ 48 時間以内に発送可能です。詳細なパーツカタログやメンテナンスガイドも提供しています。",
  "Do you provide installation and training? Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "設置とトレーニングは提供されますか?はい、完全な設置サービスと包括的なオペレータートレーニングを提供します。当社の技術チームは、お客様の機械が適切にセットアップされ、オペレーターが効率的かつ安全に使用できるように十分な訓練を受けていることを保証します。",
  "How long is the warranty period? We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "保証期間はどれくらいですか?すべての主要コンポーネントとシステムをカバーする包括的な 2 年間の保証を提供します。延長保証オプションもご利用いただけます。すべてのマシンには生涯テクニカル サポートが含まれています。",
  "What is the difference between electro-hydraulic and hydraulic press brakes? Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "電気油圧プレスブレーキと油圧プレスブレーキの違いは何ですか?電気油圧プレス ブレーキは、電子制御システムを使用してシリンダ間の正確な同期を実現し、従来の油圧システムと比較して精度と再現性が向上します。また、消費エネルギーも少なくなり、応答時間が短縮されます。",
  "What is the typical lead time for delivery? Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "配達までの通常のリードタイムはどれくらいですか?標準構成は通常 30 ～ 45 日以内に出荷されます。カスタム構成には 60 ～ 90 日かかる場合があります。ご注文時に具体的な納期をお知らせいたします。",
  "What materials can be bent with this machine? Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "この機械で曲げられる材料は何ですか?当社の CNC 曲げ機は、軟鋼、ステンレス鋼、アルミニウム、銅、その他の合金を含むさまざまな材料を加工できます。最大厚さは材料の種類と機械のトン数によって異なります。"
}