{
  "Electro-hydraulic CNC Bending Machine": "Machine à cintrer CNC électro-hydraulique",
  "New industrial design, top-level craftsmanship, pleasing appearance": "Nouveau design industriel, savoir-faire de haut niveau, aspect agréable",
  "Heavy-duty frame, robust and durable": "Cadre robuste, robuste et durable",
  "Advanced production technology and strict quality control": "Technologie de production avancée et contrôle de qualité strict",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "Advanced electro-hydraulic CNC bending machine with precision control and high efficiency": "Machine à cintrer CNC électro-hydraulique avancée avec contrôle de précision et haute efficacité",
  "Machine Capacity": "Capacité des machines",
  "Available in various tonnage ranges": "Disponible dans différentes gammes de tonnages",
  "Multiple table length options": "Plusieurs options de longueur de table",
  "Adjustable stroke capabilities": "Capacités de course réglables",
  "Various throat depth configurations": "Diverses configurations de profondeur de gorge",
  "Control System": "Système de contrôle",
  "CNC Controller: Advanced digital": "Contrôleur CNC : numérique avancé",
  "Positioning Accuracy: High precision": "Précision de positionnement : haute précision",
  "Back Gauge: Multi-axis CNC control": "Jauge arrière : commande CNC multi-axes",
  "Safety: CE certified": "Sécurité : certifié CE",
  "Features": "Caractéristiques",
  "Electro-hydraulic drive system": "Système d'entraînement électro-hydraulique",
  "Heavy-duty welded frame": "Cadre soudé robuste",
  "Multiple tool solutions": "Solutions d'outils multiples",
  "Easy operation interface": "Interface d'utilisation simple",
  "Why Choose Our CNC Bending Machine?": "Pourquoi choisir notre cintreuse CNC ?",
  "Discover the key advantages that make our electro-hydraulic CNC bending machine the preferred choice for manufacturers worldwide": "Découvrez les principaux avantages qui font de notre cintreuse électro-hydraulique CNC le choix préféré des fabricants du monde entier",
  "Advanced CNC controller with intuitive touch screen interface. Features include automatic bending sequence programming, real-time angle monitoring, multiple bending modes, and data storage capabilities. The system allows for precise control of bending angle, depth, and speed.": "Contrôleur CNC avancé avec interface à écran tactile intuitive. Les fonctionnalités incluent la programmation automatique de la séquence de pliage, la surveillance des angles en temps réel, plusieurs modes de pliage et des capacités de stockage de données. Le système permet un contrôle précis de l’angle de pliage, de la profondeur et de la vitesse.",
  "Advanced hydraulic system optimizes energy consumption while maintaining high performance": "Le système hydraulique avancé optimise la consommation d’énergie tout en maintenant des performances élevées",
  "Aerospace": "Aérospatial",
  "Applications": "Applications",
  "Architectural metalwork, railings, and structural steel": "Ferronnerie architecturale, garde-corps et acier de construction",
  "Are spare parts readily available?": "Les pièces de rechange sont-elles facilement disponibles ?",
  "Automotive Industry": "Industrie automobile",
  "Back Gauge System": "Système de jauge arrière",
  "CE certified with comprehensive safety features including light curtains and emergency stops": "Certifié CE avec des fonctionnalités de sécurité complètes, notamment des barrières immatérielles et des arrêts d'urgence",
  "CNC Control System": "Système de contrôle CNC",
  "Common questions about our electro-hydraulic CNC bending machines": "Questions courantes sur nos cintreuses électro-hydrauliques CNC",
  "Compatible with various punch and die configurations for diverse bending applications": "Compatible avec diverses configurations de poinçons et de matrices pour diverses applications de pliage",
  "Components": "Composants",
  "Comprehensive safety features including light curtains, emergency stop buttons, and safety guards. The machine meets CE safety standards and incorporates multiple protection mechanisms to ensure operator safety during all phases of operation while maintaining maximum productivity.": "Fonctions de sécurité complètes, notamment des barrières immatérielles, des boutons d'arrêt d'urgence et des protections de sécurité. La machine répond aux normes de sécurité CE et intègre de multiples mécanismes de protection pour garantir la sécurité de l'opérateur pendant toutes les phases de fonctionnement tout en maintenant une productivité maximale.",
  "Construction": "Construction",
  "Contact our support team →": "Contactez notre équipe d'assistance →",
  "Do you provide installation and training?": "Fournissez-vous l’installation et la formation ?",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Ductwork, ventilation components, and air conditioning parts": "Conduits, composants de ventilation et pièces de climatisation",
  "Easy Operation": "Opération facile",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "Les presses plieuses électrohydrauliques utilisent un système de contrôle électronique pour une synchronisation précise entre les cylindres, offrant une meilleure précision et répétabilité par rapport aux systèmes hydrauliques traditionnels. Ils consomment également moins d’énergie et offrent des temps de réponse plus rapides.",
  "Electronics": "Électronique",
  "Energy Efficient": "Efficacité énergétique",
  "Frequently Asked Questions": "Foire aux questions",
  "Furniture": "Meubles",
  "HVAC Systems": "Systèmes CVC",
  "Heavy-duty welded steel frame ensures long-term stability and durability under continuous operation": "Le cadre en acier soudé robuste assure une stabilité et une durabilité à long terme en fonctionnement continu",
  "High Precision": "Haute précision",
  "High positioning accuracy ensures consistent bending quality for demanding applications": "Une précision de positionnement élevée garantit une qualité de pliage constante pour les applications exigeantes",
  "High-precision bending for aircraft components and assemblies": "Cintrage de haute précision pour composants et assemblages aéronautiques",
  "How long is the warranty period?": "Quelle est la durée de la période de garantie ?",
  "Hydraulic System": "Système hydraulique",
  "Industrial Equipment": "Équipement industriel",
  "Intuitive CNC controller with touch screen interface reduces training time and increases productivity": "Le contrôleur CNC intuitif avec interface à écran tactile réduit le temps de formation et augmente la productivité",
  "Machine guards, hoppers, and custom metal parts": "Protections de machines, trémies et pièces métalliques sur mesure",
  "Manufacturing of brackets, frames, and body parts": "Fabrication de supports, cadres et pièces de carrosserie",
  "Mechanical Structure": "Structure mécanique",
  "Metal furniture frames, cabinets, and decorative elements": "Cadres de meubles, armoires et éléments décoratifs en métal",
  "Multi-axis CNC back gauge system with ball screw transmission for high positioning accuracy. The system features automatic positioning, programmable movements, and can be equipped with additional support arms for handling large workpieces efficiently and accurately.": "Système de butée arrière CNC multi-axes avec transmission par vis à billes pour une précision de positionnement élevée. Le système dispose d'un positionnement automatique, de mouvements programmables et peut être équipé de bras de support supplémentaires pour manipuler de grandes pièces de manière efficace et précise.",
  "Need help choosing the right configuration?": "Besoin d'aide pour choisir la bonne configuration ?",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Nos cintreuses CNC peuvent traiter divers matériaux, notamment l'acier doux, l'acier inoxydable, l'aluminium, le cuivre et d'autres alliages métalliques. L'épaisseur maximale dépend du type de matériau et du tonnage de la machine.",
  "Precision bending for enclosures, chassis, and structural components": "Pliage de précision pour les boîtiers, les châssis et les composants structurels",
  "Robust Construction": "Construction robuste",
  "Safety First": "La sécurité avant tout",
  "Safety System": "Système de sécurité",
  "Server racks, control cabinets, and electronic enclosures": "Racks de serveurs, armoires de commande et boîtiers électroniques",
  "Sheet Metal Fabrication": "Fabrication de tôles",
  "Size: 2.5 MB | Pages: 24": "Taille : 2,5 Mo | Pages : 24",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Standard Configuration": "Configuration standard",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "Les configurations standard sont généralement expédiées sous 30 à 45 jours. Les configurations personnalisées peuvent nécessiter 60 à 90 jours. Nous vous fournirons un calendrier précis lorsque vous passerez votre commande.",
  "Still have questions?": "Vous avez encore des questions ?",
  "The electro-hydraulic synchronous system ensures precise synchronization of the left and right cylinders. Equipped with high-quality imported hydraulic components, the system provides stable pressure, low noise operation, and excellent energy efficiency for consistent bending performance.": "Le système synchrone électro-hydraulique assure une synchronisation précise des vérins gauche et droit. Équipé de composants hydrauliques importés de haute qualité, le système offre une pression stable, un fonctionnement silencieux et une excellente efficacité énergétique pour des performances de pliage constantes.",
  "The main mechanical structure of the press brake consists of the frame, column, ram, worktable, the main cylinder and backgauge. The main components are through finite element analysis and optimized design by 3D software to fully guarantee the structural strength and rigidity of each component.": "La structure mécanique principale de la presse plieuse comprend le châssis, la colonne, le vérin, la table de travail, le cylindre principal et la butée arrière. Les principaux composants sont analysés par éléments finis et conçus de manière optimisée par un logiciel 3D pour garantir pleinement la résistance structurelle et la rigidité de chaque composant.",
  "Versatile Tooling": "Outillage polyvalent",
  "Watch Our Machine in Action": "Regardez notre machine en action",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "Nous offrons une garantie complète de 2 ans couvrant tous les principaux composants et systèmes. Des options de garantie prolongée sont disponibles. Un support technique à vie est inclus avec toutes les machines.",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "Quelle est la différence entre les presses plieuses électro-hydrauliques et hydrauliques ?",
  "What is the typical lead time for delivery?": "Quel est le délai de livraison habituel ?",
  "What materials can be bent with this machine?": "Quels matériaux peuvent être pliés avec cette machine ?",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Oui, nous maintenons un inventaire complet de pièces de rechange et de consommables. La plupart des pièces peuvent être expédiées sous 24 à 48 heures. Nous fournissons également des catalogues de pièces détaillés et des guides de maintenance.",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "Oui, nous fournissons des services d’installation complets et une formation complète des opérateurs. Notre équipe technique veillera à ce que votre machine soit correctement configurée et que vos opérateurs soient entièrement formés pour l'utiliser efficacement et en toute sécurité.",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Vous pouvez mieux comprendre les performances de la machine grâce à l'affichage détaillé de la machine et à la description textuelle suivante",
  "Are spare parts readily available? Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Les pièces de rechange sont-elles facilement disponibles ? Oui, nous maintenons un inventaire complet de pièces de rechange et de consommables. La plupart des pièces peuvent être expédiées sous 24 à 48 heures. Nous fournissons également des catalogues de pièces détaillés et des guides de maintenance.",
  "Do you provide installation and training? Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "Fournissez-vous l’installation et la formation ? Oui, nous fournissons des services d’installation complets et une formation complète des opérateurs. Notre équipe technique veillera à ce que votre machine soit correctement configurée et que vos opérateurs soient entièrement formés pour l'utiliser efficacement et en toute sécurité.",
  "How long is the warranty period? We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "Quelle est la durée de la période de garantie ? Nous offrons une garantie complète de 2 ans couvrant tous les principaux composants et systèmes. Des options de garantie prolongée sont disponibles. Un support technique à vie est inclus avec toutes les machines.",
  "What is the difference between electro-hydraulic and hydraulic press brakes? Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "Quelle est la différence entre les presses plieuses électro-hydrauliques et hydrauliques ? Les presses plieuses électrohydrauliques utilisent un système de contrôle électronique pour une synchronisation précise entre les cylindres, offrant une meilleure précision et répétabilité par rapport aux systèmes hydrauliques traditionnels. Ils consomment également moins d’énergie et offrent des temps de réponse plus rapides.",
  "What is the typical lead time for delivery? Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "Quel est le délai de livraison habituel ? Les configurations standard sont généralement expédiées sous 30 à 45 jours. Les configurations personnalisées peuvent nécessiter 60 à 90 jours. Nous vous fournirons un calendrier précis lorsque vous passerez votre commande.",
  "What materials can be bent with this machine? Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Quels matériaux peuvent être pliés avec cette machine ? Nos cintreuses CNC peuvent traiter divers matériaux, notamment l'acier doux, l'acier inoxydable, l'aluminium, le cuivre et d'autres alliages métalliques. L'épaisseur maximale dépend du type de matériau et du tonnage de la machine."
}