{
  "Electro-hydraulic CNC Bending Machine": "Elektrohydraulische CNC-Biegemaschine",
  "New industrial design, top-level craftsmanship, pleasing appearance": "Neues Industriedesign, erstklassige Handwerkskunst, ansprechende Optik",
  "Heavy-duty frame, robust and durable": "Robuster Rahmen, robust und langlebig",
  "Advanced production technology and strict quality control": "Fortschrittliche Produktionstechnologie und strenge Qualitätskontrolle",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "Advanced electro-hydraulic CNC bending machine with precision control and high efficiency": "Fortschrittliche elektrohydraulische CNC-Biegemaschine mit präziser Steuerung und hoher Effizienz",
  "Machine Capacity": "Maschinenkapazität",
  "Available in various tonnage ranges": "Erhältlich in verschiedenen Tonnagebereichen",
  "Multiple table length options": "Mehrere Tischlängenoptionen",
  "Adjustable stroke capabilities": "Einstellbare Hubmöglichkeiten",
  "Various throat depth configurations": "Verschiedene Halstiefenkonfigurationen",
  "Control System": "Kontrollsystem",
  "CNC Controller: Advanced digital": "CNC-Steuerung: Fortschrittlich digital",
  "Positioning Accuracy: High precision": "Positionierungsgenauigkeit: Hohe Präzision",
  "Back Gauge: Multi-axis CNC control": "Hinteranschlag: Mehrachsige CNC-Steuerung",
  "Safety: CE certified": "Sicherheit: CE-zertifiziert",
  "Features": "Merkmale",
  "Electro-hydraulic drive system": "Elektrohydraulisches Antriebssystem",
  "Heavy-duty welded frame": "Robuster geschweißter Rahmen",
  "Multiple tool solutions": "Mehrere Werkzeuglösungen",
  "Easy operation interface": "Einfache Bedienoberfläche",
  "Why Choose Our CNC Bending Machine?": "Warum sollten Sie sich für unsere CNC-Biegemaschine entscheiden?",
  "Discover the key advantages that make our electro-hydraulic CNC bending machine the preferred choice for manufacturers worldwide": "Entdecken Sie die entscheidenden Vorteile, die unsere elektrohydraulische CNC-Biegemaschine zur bevorzugten Wahl für Hersteller weltweit machen",
  "Advanced CNC controller with intuitive touch screen interface. Features include automatic bending sequence programming, real-time angle monitoring, multiple bending modes, and data storage capabilities. The system allows for precise control of bending angle, depth, and speed.": "Fortschrittlicher CNC-Controller mit intuitiver Touchscreen-Oberfläche. Zu den Funktionen gehören die automatische Programmierung der Biegesequenz, Echtzeit-Winkelüberwachung, mehrere Biegemodi und Datenspeicherfunktionen. Das System ermöglicht eine präzise Steuerung von Biegewinkel, -tiefe und -geschwindigkeit.",
  "Advanced hydraulic system optimizes energy consumption while maintaining high performance": "Das fortschrittliche Hydrauliksystem optimiert den Energieverbrauch und sorgt gleichzeitig für eine hohe Leistung",
  "Aerospace": "Luft- und Raumfahrt",
  "Applications": "Anwendungen",
  "Architectural metalwork, railings, and structural steel": "Architektonische Metallarbeiten, Geländer und Baustahl",
  "Are spare parts readily available?": "Sind Ersatzteile leicht verfügbar?",
  "Automotive Industry": "Automobilindustrie",
  "Back Gauge System": "Hinteranschlagsystem",
  "CE certified with comprehensive safety features including light curtains and emergency stops": "CE-zertifiziert mit umfassenden Sicherheitsfunktionen, einschließlich Lichtvorhängen und Notstopps",
  "CNC Control System": "CNC-Steuerungssystem",
  "Common questions about our electro-hydraulic CNC bending machines": "Häufige Fragen zu unseren elektrohydraulischen CNC-Biegemaschinen",
  "Compatible with various punch and die configurations for diverse bending applications": "Kompatibel mit verschiedenen Stempel- und Matrizenkonfigurationen für verschiedene Biegeanwendungen",
  "Components": "Komponenten",
  "Comprehensive safety features including light curtains, emergency stop buttons, and safety guards. The machine meets CE safety standards and incorporates multiple protection mechanisms to ensure operator safety during all phases of operation while maintaining maximum productivity.": "Umfassende Sicherheitsfunktionen, einschließlich Lichtvorhängen, Not-Aus-Tasten und Schutzvorrichtungen. Die Maschine erfüllt die CE-Sicherheitsstandards und verfügt über mehrere Schutzmechanismen, um die Sicherheit des Bedieners in allen Betriebsphasen zu gewährleisten und gleichzeitig maximale Produktivität aufrechtzuerhalten.",
  "Construction": "Konstruktion",
  "Contact our support team →": "Kontaktieren Sie unser Support-Team →",
  "Do you provide installation and training?": "Bieten Sie Installation und Schulung an?",
  "Download Technical Brochure": "Laden Sie die technische Broschüre herunter",
  "Ductwork, ventilation components, and air conditioning parts": "Rohrleitungen, Lüftungskomponenten und Klimaanlagenteile",
  "Easy Operation": "Einfache Bedienung",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "Elektrohydraulische Abkantpressen nutzen ein elektronisches Steuersystem zur präzisen Synchronisierung zwischen den Zylindern und bieten im Vergleich zu herkömmlichen hydraulischen Systemen eine bessere Genauigkeit und Wiederholbarkeit. Sie verbrauchen außerdem weniger Energie und bieten schnellere Reaktionszeiten.",
  "Electronics": "Elektronik",
  "Energy Efficient": "Energieeffizient",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Furniture": "Möbel",
  "HVAC Systems": "HVAC-Systeme",
  "Heavy-duty welded steel frame ensures long-term stability and durability under continuous operation": "Der robuste Rahmen aus geschweißtem Stahl gewährleistet langfristige Stabilität und Haltbarkeit im Dauerbetrieb",
  "High Precision": "Hohe Präzision",
  "High positioning accuracy ensures consistent bending quality for demanding applications": "Eine hohe Positionierungsgenauigkeit gewährleistet eine gleichbleibende Biegequalität bei anspruchsvollen Anwendungen",
  "High-precision bending for aircraft components and assemblies": "Hochpräzises Biegen für Flugzeugkomponenten und Baugruppen",
  "How long is the warranty period?": "Wie lange ist die Garantiezeit?",
  "Hydraulic System": "Hydrauliksystem",
  "Industrial Equipment": "Industrieausrüstung",
  "Intuitive CNC controller with touch screen interface reduces training time and increases productivity": "Die intuitive CNC-Steuerung mit Touchscreen-Schnittstelle reduziert die Einarbeitungszeit und erhöht die Produktivität",
  "Machine guards, hoppers, and custom metal parts": "Maschinenschutz, Trichter und kundenspezifische Metallteile",
  "Manufacturing of brackets, frames, and body parts": "Herstellung von Halterungen, Rahmen und Karosserieteilen",
  "Mechanical Structure": "Mechanische Struktur",
  "Metal furniture frames, cabinets, and decorative elements": "Möbelrahmen, Schränke und dekorative Elemente aus Metall",
  "Multi-axis CNC back gauge system with ball screw transmission for high positioning accuracy. The system features automatic positioning, programmable movements, and can be equipped with additional support arms for handling large workpieces efficiently and accurately.": "Mehrachsiges CNC-Hinteranschlagsystem mit Kugelumlaufspindelgetriebe für hohe Positioniergenauigkeit. Das System verfügt über eine automatische Positionierung, programmierbare Bewegungen und kann mit zusätzlichen Tragarmen zur effizienten und präzisen Handhabung großer Werkstücke ausgestattet werden.",
  "Need help choosing the right configuration?": "Benötigen Sie Hilfe bei der Auswahl der richtigen Konfiguration?",
  "Optional Upgrades": "Optionale Upgrades",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Unsere CNC-Biegemaschinen können verschiedene Materialien verarbeiten, darunter Weichstahl, Edelstahl, Aluminium, Kupfer und andere Metalllegierungen. Die maximale Dicke hängt von der Materialart und der Maschinentonnage ab.",
  "Precision bending for enclosures, chassis, and structural components": "Präzisionsbiegen für Gehäuse, Chassis und Strukturbauteile",
  "Robust Construction": "Robuste Konstruktion",
  "Safety First": "Sicherheit geht vor",
  "Safety System": "Sicherheitssystem",
  "Server racks, control cabinets, and electronic enclosures": "Serverschränke, Schaltschränke und Elektronikgehäuse",
  "Sheet Metal Fabrication": "Blechbearbeitung",
  "Size: 2.5 MB | Pages: 24": "Größe: 2,5 MB | Seiten: 24",
  "Standard & Optional Configuration": "Standard- und optionale Konfiguration",
  "Standard Configuration": "Standardkonfiguration",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "Standardkonfigurationen werden in der Regel innerhalb von 30–45 Tagen versendet. Benutzerdefinierte Konfigurationen können 60–90 Tage dauern. Wenn Sie Ihre Bestellung aufgeben, nennen wir Ihnen einen genauen Zeitplan.",
  "Still have questions?": "Sie haben noch Fragen?",
  "The electro-hydraulic synchronous system ensures precise synchronization of the left and right cylinders. Equipped with high-quality imported hydraulic components, the system provides stable pressure, low noise operation, and excellent energy efficiency for consistent bending performance.": "Das elektrohydraulische Synchronsystem sorgt für eine präzise Synchronisierung der linken und rechten Zylinder. Ausgestattet mit hochwertigen importierten Hydraulikkomponenten bietet das System einen stabilen Druck, einen geräuscharmen Betrieb und eine hervorragende Energieeffizienz für eine konstante Biegeleistung.",
  "The main mechanical structure of the press brake consists of the frame, column, ram, worktable, the main cylinder and backgauge. The main components are through finite element analysis and optimized design by 3D software to fully guarantee the structural strength and rigidity of each component.": "Die mechanische Hauptstruktur der Abkantpresse besteht aus Rahmen, Säule, Stößel, Arbeitstisch, Hauptzylinder und Hinteranschlag. Die Hauptkomponenten werden durch Finite-Elemente-Analyse und optimiertes Design durch 3D-Software hergestellt, um die strukturelle Festigkeit und Steifigkeit jeder Komponente vollständig zu gewährleisten.",
  "Versatile Tooling": "Vielseitige Werkzeuge",
  "Watch Our Machine in Action": "Sehen Sie unsere Maschine in Aktion",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "Wir bieten eine umfassende 2-Jahres-Garantie auf alle wichtigen Komponenten und Systeme. Erweiterte Garantieoptionen sind verfügbar. Lebenslanger technischer Support ist bei allen Maschinen inbegriffen.",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "Was ist der Unterschied zwischen elektrohydraulischen und hydraulischen Abkantpressen?",
  "What is the typical lead time for delivery?": "Was ist die typische Vorlaufzeit für die Lieferung?",
  "What materials can be bent with this machine?": "Welche Materialien können mit dieser Maschine gebogen werden?",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Ja, wir verfügen über einen umfassenden Bestand an Ersatzteilen und Verbrauchsmaterialien. Die meisten Teile können innerhalb von 24–48 Stunden versendet werden. Wir stellen auch detaillierte Teilekataloge und Wartungsanleitungen zur Verfügung.",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "Ja, wir bieten komplette Installationsdienste und umfassende Bedienerschulungen. Unser technisches Team stellt sicher, dass Ihre Maschine ordnungsgemäß eingerichtet ist und Ihre Bediener umfassend für den effizienten und sicheren Einsatz der Maschine geschult sind.",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Anhand der folgenden Maschinendetailanzeige und Textbeschreibung können Sie die Leistung der Maschine besser verstehen",
  "Are spare parts readily available? Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Sind Ersatzteile leicht verfügbar? Ja, wir verfügen über einen umfassenden Bestand an Ersatzteilen und Verbrauchsmaterialien. Die meisten Teile können innerhalb von 24–48 Stunden versendet werden. Wir stellen auch detaillierte Teilekataloge und Wartungsanleitungen zur Verfügung.",
  "Do you provide installation and training? Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "Bieten Sie Installation und Schulung an? Ja, wir bieten komplette Installationsdienste und umfassende Bedienerschulungen. Unser technisches Team stellt sicher, dass Ihre Maschine ordnungsgemäß eingerichtet ist und Ihre Bediener umfassend für den effizienten und sicheren Einsatz der Maschine geschult sind.",
  "How long is the warranty period? We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "Wie lange ist die Garantiezeit? Wir bieten eine umfassende 2-Jahres-Garantie auf alle wichtigen Komponenten und Systeme. Erweiterte Garantieoptionen sind verfügbar. Lebenslanger technischer Support ist bei allen Maschinen inbegriffen.",
  "What is the difference between electro-hydraulic and hydraulic press brakes? Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "Was ist der Unterschied zwischen elektrohydraulischen und hydraulischen Abkantpressen? Elektrohydraulische Abkantpressen nutzen ein elektronisches Steuersystem zur präzisen Synchronisierung zwischen den Zylindern und bieten im Vergleich zu herkömmlichen hydraulischen Systemen eine bessere Genauigkeit und Wiederholbarkeit. Sie verbrauchen außerdem weniger Energie und bieten schnellere Reaktionszeiten.",
  "What is the typical lead time for delivery? Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "Was ist die typische Vorlaufzeit für die Lieferung? Standardkonfigurationen werden in der Regel innerhalb von 30–45 Tagen versendet. Benutzerdefinierte Konfigurationen können 60–90 Tage dauern. Wenn Sie Ihre Bestellung aufgeben, nennen wir Ihnen einen genauen Zeitplan.",
  "What materials can be bent with this machine? Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Welche Materialien können mit dieser Maschine gebogen werden? Unsere CNC-Biegemaschinen können verschiedene Materialien verarbeiten, darunter Weichstahl, Edelstahl, Aluminium, Kupfer und andere Metalllegierungen. Die maximale Dicke hängt von der Materialart und der Maschinentonnage ab."
}