{
  "Electro-hydraulic CNC Bending Machine": "Электрогидравлический гибочный станок с ЧПУ",
  "New industrial design, top-level craftsmanship, pleasing appearance": "Новый промышленный дизайн, мастерство высшего уровня, приятный внешний вид.",
  "Heavy-duty frame, robust and durable": "Прочная рама, прочная и долговечная",
  "Advanced production technology and strict quality control": "Передовые технологии производства и строгий контроль качества.",
  "Request Quote": "Запросить цену",
  "Watch Video": "Посмотреть видео",
  "Technical Specifications": "Технические характеристики",
  "Advanced electro-hydraulic CNC bending machine with precision control and high efficiency": "Усовершенствованный электрогидравлический гибочный станок с ЧПУ с точным управлением и высокой эффективностью.",
  "Machine Capacity": "Производительность машины",
  "Available in various tonnage ranges": "Доступен в различных диапазонах тоннажа",
  "Multiple table length options": "Несколько вариантов длины стола",
  "Adjustable stroke capabilities": "Регулируемые возможности хода",
  "Various throat depth configurations": "Различные конфигурации глубины горловины",
  "Control System": "Система управления",
  "CNC Controller: Advanced digital": "Контроллер ЧПУ: усовершенствованный цифровой",
  "Positioning Accuracy: High precision": "Точность позиционирования: Высокая точность",
  "Back Gauge: Multi-axis CNC control": "Задний датчик: многоосевое управление с ЧПУ",
  "Safety: CE certified": "Безопасность: сертифицирован CE.",
  "Features": "Функции",
  "Electro-hydraulic drive system": "Электрогидравлическая система привода",
  "Heavy-duty welded frame": "Прочная сварная рама",
  "Multiple tool solutions": "Несколько инструментальных решений",
  "Easy operation interface": "Простой интерфейс работы",
  "Why Choose Our CNC Bending Machine?": "Почему стоит выбрать наш гибочный станок с ЧПУ?",
  "Discover the key advantages that make our electro-hydraulic CNC bending machine the preferred choice for manufacturers worldwide": "Откройте для себя ключевые преимущества, которые делают наш электрогидравлический гибочный станок с ЧПУ предпочтительным выбором для производителей по всему миру.",
  "Advanced CNC controller with intuitive touch screen interface. Features include automatic bending sequence programming, real-time angle monitoring, multiple bending modes, and data storage capabilities. The system allows for precise control of bending angle, depth, and speed.": "Усовершенствованный контроллер ЧПУ с интуитивно понятным интерфейсом сенсорного экрана. Функции включают автоматическое программирование последовательности гибки, мониторинг угла в реальном времени, несколько режимов гибки и возможности хранения данных. Система позволяет точно контролировать угол, глубину и скорость гибки.",
  "Advanced hydraulic system optimizes energy consumption while maintaining high performance": "Усовершенствованная гидравлическая система оптимизирует потребление энергии, сохраняя при этом высокую производительность.",
  "Aerospace": "Аэрокосмическая промышленность",
  "Applications": "Приложения",
  "Architectural metalwork, railings, and structural steel": "Архитектурные металлоконструкции, перила и конструкционная сталь",
  "Are spare parts readily available?": "Доступны ли запасные части?",
  "Automotive Industry": "Автомобильная промышленность",
  "Back Gauge System": "Система заднего упора",
  "CE certified with comprehensive safety features including light curtains and emergency stops": "Сертификат CE, комплексные функции безопасности, включая световые завесы и аварийную остановку.",
  "CNC Control System": "Система управления ЧПУ",
  "Common questions about our electro-hydraulic CNC bending machines": "Общие вопросы о наших электрогидравлических гибочных станках с ЧПУ",
  "Compatible with various punch and die configurations for diverse bending applications": "Совместимость с различными конфигурациями пуансонов и матриц для разнообразных операций гибки.",
  "Components": "Компоненты",
  "Comprehensive safety features including light curtains, emergency stop buttons, and safety guards. The machine meets CE safety standards and incorporates multiple protection mechanisms to ensure operator safety during all phases of operation while maintaining maximum productivity.": "Комплексные функции безопасности, включая световые завесы, кнопки аварийной остановки и защитные ограждения. Машина соответствует стандартам безопасности CE и включает в себя несколько механизмов защиты, обеспечивающих безопасность оператора на всех этапах работы при сохранении максимальной производительности.",
  "Construction": "Строительство",
  "Contact our support team →": "Свяжитесь с нашей службой поддержки →",
  "Do you provide installation and training?": "Предоставляете ли вы установку и обучение?",
  "Download Technical Brochure": "Загрузить техническую брошюру",
  "Ductwork, ventilation components, and air conditioning parts": "Воздуховоды, компоненты вентиляции и детали кондиционирования воздуха",
  "Easy Operation": "Простота в эксплуатации",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "В электрогидравлических листогибочных прессах используется электронная система управления для точной синхронизации между цилиндрами, обеспечивающая лучшую точность и повторяемость по сравнению с традиционными гидравлическими системами. Они также потребляют меньше энергии и обеспечивают более быстрое время отклика.",
  "Electronics": "Электроника",
  "Energy Efficient": "Энергоэффективный",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Furniture": "Мебель",
  "HVAC Systems": "Системы отопления, вентиляции и кондиционирования",
  "Heavy-duty welded steel frame ensures long-term stability and durability under continuous operation": "Прочная сварная стальная рама обеспечивает долговременную стабильность и долговечность при непрерывной эксплуатации.",
  "High Precision": "Высокая точность",
  "High positioning accuracy ensures consistent bending quality for demanding applications": "Высокая точность позиционирования обеспечивает стабильное качество гибки для требовательных применений.",
  "High-precision bending for aircraft components and assemblies": "Высокоточная гибка узлов и агрегатов самолетов",
  "How long is the warranty period?": "Каков срок гарантии?",
  "Hydraulic System": "Гидравлическая система",
  "Industrial Equipment": "Промышленное оборудование",
  "Intuitive CNC controller with touch screen interface reduces training time and increases productivity": "Интуитивно понятный контроллер ЧПУ с интерфейсом сенсорного экрана сокращает время обучения и повышает производительность.",
  "Machine guards, hoppers, and custom metal parts": "Защитные ограждения машины, бункеры и металлические детали, изготовленные на заказ.",
  "Manufacturing of brackets, frames, and body parts": "Изготовление кронштейнов, рам и кузовных деталей",
  "Mechanical Structure": "Механическая структура",
  "Metal furniture frames, cabinets, and decorative elements": "Металлические каркасы мебели, шкафы и декоративные элементы",
  "Multi-axis CNC back gauge system with ball screw transmission for high positioning accuracy. The system features automatic positioning, programmable movements, and can be equipped with additional support arms for handling large workpieces efficiently and accurately.": "Многоосевая система заднего упора с ЧПУ и шарико-винтовой передачей для высокой точности позиционирования. Система оснащена автоматическим позиционированием, программируемыми перемещениями и может быть оснащена дополнительными опорными рычагами для эффективной и точной обработки крупных заготовок.",
  "Need help choosing the right configuration?": "Нужна помощь в выборе правильной конфигурации?",
  "Optional Upgrades": "Дополнительные обновления",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Наши гибочные станки с ЧПУ могут обрабатывать различные материалы, включая мягкую сталь, нержавеющую сталь, алюминий, медь и другие металлические сплавы. Максимальная толщина зависит от типа материала и тоннажа машины.",
  "Precision bending for enclosures, chassis, and structural components": "Прецизионная гибка корпусов, шасси и конструктивных элементов",
  "Robust Construction": "Прочная конструкция",
  "Safety First": "Безопасность превыше всего",
  "Safety System": "Система безопасности",
  "Server racks, control cabinets, and electronic enclosures": "Серверные стойки, шкафы управления и электронные корпуса",
  "Sheet Metal Fabrication": "Изготовление листового металла",
  "Size: 2.5 MB | Pages: 24": "Размер: 2,5 МБ | Страниц: 24",
  "Standard & Optional Configuration": "Стандартная и дополнительная конфигурация",
  "Standard Configuration": "Стандартная конфигурация",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "Стандартные конфигурации обычно доставляются в течение 30–45 дней. Изготовление индивидуальных конфигураций может занять 60-90 дней. Точные сроки мы сообщим при размещении заказа.",
  "Still have questions?": "Остались вопросы?",
  "The electro-hydraulic synchronous system ensures precise synchronization of the left and right cylinders. Equipped with high-quality imported hydraulic components, the system provides stable pressure, low noise operation, and excellent energy efficiency for consistent bending performance.": "Электрогидравлическая синхронная система обеспечивает точную синхронизацию левого и правого цилиндров. Оснащенная высококачественными импортными гидравлическими компонентами, система обеспечивает стабильное давление, низкий уровень шума и отличную энергоэффективность для стабильной производительности гибки.",
  "The main mechanical structure of the press brake consists of the frame, column, ram, worktable, the main cylinder and backgauge. The main components are through finite element analysis and optimized design by 3D software to fully guarantee the structural strength and rigidity of each component.": "Основная механическая конструкция листогибочного пресса состоит из рамы, колонны, толкателя, рабочего стола, главного цилиндра и заднего упора. Основные компоненты создаются методом конечных элементов и оптимизированы с помощью 3D-программного обеспечения, чтобы полностью гарантировать структурную прочность и жесткость каждого компонента.",
  "Versatile Tooling": "Универсальные инструменты",
  "Watch Our Machine in Action": "Посмотрите нашу машину в действии",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "Мы предлагаем комплексную 2-летнюю гарантию на все основные компоненты и системы. Возможны варианты расширенной гарантии. Пожизненная техническая поддержка включена во все машины.",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "В чем разница между электрогидравлическими и гидравлическими листогибочными прессами?",
  "What is the typical lead time for delivery?": "Каков типичный срок доставки?",
  "What materials can be bent with this machine?": "Какие материалы можно гнуть на этом станке?",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Да, у нас имеется полный склад запасных частей и расходных материалов. Большинство деталей могут быть отправлены в течение 24-48 часов. Мы также предоставляем подробные каталоги запчастей и руководства по техническому обслуживанию.",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "Да, мы предоставляем полный комплекс услуг по установке и всестороннее обучение операторов. Наша техническая команда позаботится о том, чтобы ваша машина была правильно настроена, а ваши операторы были полностью обучены ее эффективному и безопасному использованию.",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Вы можете лучше понять производительность машины с помощью следующего подробного описания машины и текстового описания."
}