{
  "Electro-hydraulic CNC Bending Machine": "آلة الثني CNC الكهروهيدروليكية",
  "New industrial design, top-level craftsmanship, pleasing appearance": "تصميم صناعي جديد، براعة عالية المستوى، مظهر ممتع",
  "Heavy-duty frame, robust and durable": "إطار عالي التحمل، قوي ومتين",
  "Advanced production technology and strict quality control": "تكنولوجيا الإنتاج المتقدمة ومراقبة الجودة الصارمة",
  "Request Quote": "طلب اقتباس",
  "Watch Video": "شاهد الفيديو",
  "Technical Specifications": "المواصفات الفنية",
  "Advanced electro-hydraulic CNC bending machine with precision control and high efficiency": "آلة ثني CNC الكهروهيدروليكية المتقدمة مع التحكم الدقيق والكفاءة العالية",
  "Machine Capacity": "سعة الآلة",
  "Available in various tonnage ranges": "متوفر في نطاقات حمولة مختلفة",
  "Multiple table length options": "خيارات متعددة لطول الجدول",
  "Adjustable stroke capabilities": "قدرات السكتة الدماغية قابلة للتعديل",
  "Various throat depth configurations": "تكوينات مختلفة لعمق الحلق",
  "Control System": "نظام التحكم",
  "CNC Controller: Advanced digital": "تحكم CNC: رقمي متقدم",
  "Positioning Accuracy: High precision": "دقة تحديد المواقع: دقة عالية",
  "Back Gauge: Multi-axis CNC control": "المقياس الخلفي: تحكم CNC متعدد المحاور",
  "Safety: CE certified": "السلامة: شهادة CE",
  "Features": "سمات",
  "Electro-hydraulic drive system": "نظام القيادة الكهروهيدروليكية",
  "Heavy-duty welded frame": "إطار ملحوم للخدمة الشاقة",
  "Multiple tool solutions": "حلول أدوات متعددة",
  "Easy operation interface": "واجهة عملية سهلة",
  "Why Choose Our CNC Bending Machine?": "لماذا تختار آلة الثني CNC الخاصة بنا؟",
  "Discover the key advantages that make our electro-hydraulic CNC bending machine the preferred choice for manufacturers worldwide": "اكتشف المزايا الرئيسية التي تجعل آلة الثني CNC الكهروهيدروليكية الخاصة بنا هي الخيار المفضل للمصنعين في جميع أنحاء العالم",
  "Advanced CNC controller with intuitive touch screen interface. Features include automatic bending sequence programming, real-time angle monitoring, multiple bending modes, and data storage capabilities. The system allows for precise control of bending angle, depth, and speed.": "وحدة تحكم CNC متقدمة مع واجهة شاشة تعمل باللمس بديهية. تشتمل الميزات على برمجة تسلسل الانحناء التلقائي، ومراقبة الزاوية في الوقت الفعلي، وأوضاع الانحناء المتعددة، وقدرات تخزين البيانات. يسمح النظام بالتحكم الدقيق في زاوية الانحناء والعمق والسرعة.",
  "Advanced hydraulic system optimizes energy consumption while maintaining high performance": "يعمل النظام الهيدروليكي المتقدم على تحسين استهلاك الطاقة مع الحفاظ على الأداء العالي",
  "Aerospace": "الفضاء الجوي",
  "Applications": "التطبيقات",
  "Architectural metalwork, railings, and structural steel": "الأعمال المعدنية المعمارية، والسور، والفولاذ الهيكلي",
  "Are spare parts readily available?": "هل قطع الغيار متوفرة بسهولة؟",
  "Automotive Industry": "صناعة السيارات",
  "Back Gauge System": "نظام القياس الخلفي",
  "CE certified with comprehensive safety features including light curtains and emergency stops": "حاصلة على شهادة CE مع ميزات أمان شاملة بما في ذلك الستائر الخفيفة ومحطات التوقف في حالات الطوارئ",
  "CNC Control System": "نظام التحكم CNC",
  "Common questions about our electro-hydraulic CNC bending machines": "أسئلة شائعة حول آلات الثني CNC الكهروهيدروليكية الخاصة بنا",
  "Compatible with various punch and die configurations for diverse bending applications": "متوافق مع تكوينات مختلفة للثقب والقوالب لتطبيقات الانحناء المتنوعة",
  "Components": "عناصر",
  "Comprehensive safety features including light curtains, emergency stop buttons, and safety guards. The machine meets CE safety standards and incorporates multiple protection mechanisms to ensure operator safety during all phases of operation while maintaining maximum productivity.": "ميزات أمان شاملة تشمل ستائر خفيفة، وأزرار التوقف في حالات الطوارئ، ووسائل حماية السلامة. تتوافق الماكينة مع معايير السلامة CE وتتضمن آليات حماية متعددة لضمان سلامة المشغل أثناء جميع مراحل التشغيل مع الحفاظ على أقصى قدر من الإنتاجية.",
  "Construction": "بناء",
  "Contact our support team →": "اتصل بفريق الدعم الخاص بنا →",
  "Do you provide installation and training?": "هل توفرون التركيب والتدريب؟",
  "Download Technical Brochure": "تحميل الكتيب الفني",
  "Ductwork, ventilation components, and air conditioning parts": "مجاري الهواء ومكونات التهوية وأجزاء تكييف الهواء",
  "Easy Operation": "عملية سهلة",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "تستخدم مكابح الضغط الكهروهيدروليكية نظام تحكم إلكتروني لتحقيق التزامن الدقيق بين الأسطوانات، مما يوفر دقة وتكرارًا أفضل مقارنة بالأنظمة الهيدروليكية التقليدية. كما أنها تستهلك طاقة أقل وتوفر أوقات استجابة أسرع.",
  "Electronics": "إلكترونيات",
  "Energy Efficient": "كفاءة في استخدام الطاقة",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Furniture": "أثاث",
  "HVAC Systems": "أنظمة التدفئة والتهوية وتكييف الهواء",
  "Heavy-duty welded steel frame ensures long-term stability and durability under continuous operation": "يضمن الإطار الفولاذي الملحوم للخدمة الشاقة الاستقرار والمتانة على المدى الطويل في ظل التشغيل المستمر",
  "High Precision": "دقة عالية",
  "High positioning accuracy ensures consistent bending quality for demanding applications": "تضمن الدقة العالية لتحديد المواقع جودة انحناء متسقة للتطبيقات الصعبة",
  "High-precision bending for aircraft components and assemblies": "ثني عالي الدقة لمكونات وتجميعات الطائرات",
  "How long is the warranty period?": "ما هي مدة الضمان؟",
  "Hydraulic System": "النظام الهيدروليكي",
  "Industrial Equipment": "المعدات الصناعية",
  "Intuitive CNC controller with touch screen interface reduces training time and increases productivity": "تعمل وحدة التحكم CNC البديهية المزودة بواجهة شاشة تعمل باللمس على تقليل وقت التدريب وزيادة الإنتاجية",
  "Machine guards, hoppers, and custom metal parts": "حراس الآلة، والقواديس، والأجزاء المعدنية المخصصة",
  "Manufacturing of brackets, frames, and body parts": "تصنيع الأقواس والإطارات وأجزاء الجسم",
  "Mechanical Structure": "الهيكل الميكانيكي",
  "Metal furniture frames, cabinets, and decorative elements": "إطارات الأثاث المعدني، والخزائن، والعناصر الزخرفية",
  "Multi-axis CNC back gauge system with ball screw transmission for high positioning accuracy. The system features automatic positioning, programmable movements, and can be equipped with additional support arms for handling large workpieces efficiently and accurately.": "نظام قياس خلفي CNC متعدد المحاور مع ناقل حركة لولبي كروي لضمان دقة تحديد المواقع العالية. يتميز النظام بتحديد موضع تلقائي، وحركات قابلة للبرمجة، ويمكن تجهيزه بأذرع دعم إضافية للتعامل مع قطع العمل الكبيرة بكفاءة ودقة.",
  "Need help choosing the right configuration?": "هل تحتاج إلى مساعدة في اختيار التكوين الصحيح؟",
  "Optional Upgrades": "ترقيات اختيارية",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "يمكن لآلات الثني CNC الخاصة بنا معالجة المواد المختلفة بما في ذلك الفولاذ الطري والفولاذ المقاوم للصدأ والألومنيوم والنحاس والسبائك المعدنية الأخرى. يعتمد الحد الأقصى للسمك على نوع المادة وحمولة الماكينة.",
  "Precision bending for enclosures, chassis, and structural components": "الانحناء الدقيق للمرفقات والهيكل والمكونات الهيكلية",
  "Robust Construction": "البناء القوي",
  "Safety First": "السلامة أولا",
  "Safety System": "نظام السلامة",
  "Server racks, control cabinets, and electronic enclosures": "رفوف الخادم وخزائن التحكم والمرفقات الإلكترونية",
  "Sheet Metal Fabrication": "تصنيع الصفائح المعدنية",
  "Size: 2.5 MB | Pages: 24": "الحجم: 2.5 ميجا بايت | الصفحات: 24",
  "Standard & Optional Configuration": "التكوين القياسي والاختياري",
  "Standard Configuration": "التكوين القياسي",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "يتم شحن التكوينات القياسية عادةً خلال 30-45 يومًا. قد تتطلب التكوينات المخصصة ما بين 60 إلى 90 يومًا. سنقدم لك جدولًا زمنيًا محددًا عند تقديم طلبك.",
  "Still have questions?": "لا تزال لديك أسئلة؟",
  "The electro-hydraulic synchronous system ensures precise synchronization of the left and right cylinders. Equipped with high-quality imported hydraulic components, the system provides stable pressure, low noise operation, and excellent energy efficiency for consistent bending performance.": "يضمن النظام المتزامن الكهروهيدروليكي التزامن الدقيق للأسطوانات اليسرى واليمنى. نظرًا لأنه مُجهز بمكونات هيدروليكية مستوردة عالية الجودة، فإن النظام يوفر ضغطًا مستقرًا وتشغيلًا منخفض الضوضاء وكفاءة طاقة ممتازة لأداء ثني ثابت.",
  "The main mechanical structure of the press brake consists of the frame, column, ram, worktable, the main cylinder and backgauge. The main components are through finite element analysis and optimized design by 3D software to fully guarantee the structural strength and rigidity of each component.": "يتكون الهيكل الميكانيكي الرئيسي لفرامل الضغط من الإطار، العمود، الكبش، طاولة العمل، الأسطوانة الرئيسية والمقياس الخلفي. يتم الحصول على المكونات الرئيسية من خلال تحليل العناصر المحدودة والتصميم الأمثل بواسطة برنامج ثلاثي الأبعاد لضمان القوة الهيكلية والصلابة لكل مكون بشكل كامل.",
  "Versatile Tooling": "أدوات متعددة الاستخدامات",
  "Watch Our Machine in Action": "شاهد آلتنا أثناء عملها",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "نحن نقدم ضمانًا شاملاً لمدة عامين يغطي جميع المكونات والأنظمة الرئيسية. تتوفر خيارات الضمان الممتد. يتم تضمين الدعم الفني مدى الحياة مع جميع الأجهزة.",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "ما الفرق بين مكابح الضغط الكهروهيدروليكية والهيدروليكية؟",
  "What is the typical lead time for delivery?": "ما هي المهلة الزمنية النموذجية للتسليم؟",
  "What materials can be bent with this machine?": "ما هي المواد التي يمكن ثنيها بهذه الآلة؟",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "نعم، نحتفظ بمخزون شامل من قطع الغيار والمواد الاستهلاكية. يمكن شحن معظم الأجزاء خلال 24-48 ساعة. كما نقدم كتالوجات مفصلة للأجزاء وأدلة الصيانة.",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "نعم، نحن نقدم خدمات التركيب الكاملة والتدريب الشامل للمشغلين. سيتأكد فريقنا الفني من إعداد جهازك بشكل صحيح وأن المشغلين لديك مدربون تدريبًا كاملاً على استخدامه بكفاءة وأمان.",
  "You can better understand the performance of the machine through the following machine detail display and text description": "يمكنك فهم أداء الجهاز بشكل أفضل من خلال شاشة عرض تفاصيل الجهاز والوصف النصي التاليين"
}