{
  "Electro-hydraulic CNC Bending Machine": "Dobladora CNC electrohidráulica",
  "New industrial design, top-level craftsmanship, pleasing appearance": "Nuevo diseño industrial, artesanía de alto nivel, apariencia agradable.",
  "Heavy-duty frame, robust and durable": "Estructura resistente, robusta y duradera.",
  "Advanced production technology and strict quality control": "Tecnología de producción avanzada y estricto control de calidad.",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "Advanced electro-hydraulic CNC bending machine with precision control and high efficiency": "Dobladora CNC electrohidráulica avanzada con control de precisión y alta eficiencia",
  "Machine Capacity": "Capacidad de la máquina",
  "Available in various tonnage ranges": "Disponible en varios rangos de tonelaje",
  "Multiple table length options": "Múltiples opciones de longitud de mesa",
  "Adjustable stroke capabilities": "Capacidades de carrera ajustables",
  "Various throat depth configurations": "Varias configuraciones de profundidad de garganta",
  "Control System": "Sistema de control",
  "CNC Controller: Advanced digital": "Controlador CNC: digital avanzado",
  "Positioning Accuracy: High precision": "Precisión de posicionamiento: alta precisión",
  "Back Gauge: Multi-axis CNC control": "Tope trasero: control CNC multieje",
  "Safety: CE certified": "Seguridad: certificado CE",
  "Features": "Características",
  "Electro-hydraulic drive system": "Sistema de accionamiento electrohidráulico",
  "Heavy-duty welded frame": "Marco soldado de alta resistencia",
  "Multiple tool solutions": "Soluciones de herramientas múltiples",
  "Easy operation interface": "Interfaz de fácil operación",
  "Why Choose Our CNC Bending Machine?": "¿Por qué elegir nuestra máquina dobladora CNC?",
  "Discover the key advantages that make our electro-hydraulic CNC bending machine the preferred choice for manufacturers worldwide": "Descubra las ventajas clave que hacen de nuestra máquina dobladora CNC electrohidráulica la opción preferida de los fabricantes de todo el mundo.",
  "Advanced CNC controller with intuitive touch screen interface. Features include automatic bending sequence programming, real-time angle monitoring, multiple bending modes, and data storage capabilities. The system allows for precise control of bending angle, depth, and speed.": "Controlador CNC avanzado con interfaz de pantalla táctil intuitiva. Las características incluyen programación automática de secuencia de plegado, monitoreo de ángulo en tiempo real, múltiples modos de plegado y capacidades de almacenamiento de datos. El sistema permite un control preciso del ángulo, la profundidad y la velocidad de plegado.",
  "Advanced hydraulic system optimizes energy consumption while maintaining high performance": "El sistema hidráulico avanzado optimiza el consumo de energía manteniendo un alto rendimiento.",
  "Aerospace": "Aeroespacial",
  "Applications": "Aplicaciones",
  "Architectural metalwork, railings, and structural steel": "Carpintería arquitectónica, barandillas y acero estructural.",
  "Are spare parts readily available?": "¿Hay repuestos fácilmente disponibles?",
  "Automotive Industry": "Industria automotriz",
  "Back Gauge System": "Sistema de tope trasero",
  "CE certified with comprehensive safety features including light curtains and emergency stops": "Certificado CE con características de seguridad integrales que incluyen cortinas de luz y paradas de emergencia.",
  "CNC Control System": "Sistema de control CNC",
  "Common questions about our electro-hydraulic CNC bending machines": "Preguntas comunes sobre nuestras dobladoras CNC electrohidráulicas",
  "Compatible with various punch and die configurations for diverse bending applications": "Compatible con varias configuraciones de punzones y matrices para diversas aplicaciones de doblado",
  "Components": "Componentes",
  "Comprehensive safety features including light curtains, emergency stop buttons, and safety guards. The machine meets CE safety standards and incorporates multiple protection mechanisms to ensure operator safety during all phases of operation while maintaining maximum productivity.": "Funciones de seguridad integrales que incluyen cortinas de luz, botones de parada de emergencia y protectores de seguridad. La máquina cumple con los estándares de seguridad CE e incorpora múltiples mecanismos de protección para garantizar la seguridad del operador durante todas las fases de operación manteniendo la máxima productividad.",
  "Construction": "Construcción",
  "Contact our support team →": "Contacta con nuestro equipo de soporte →",
  "Do you provide installation and training?": "¿Ofrecen instalación y capacitación?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Ductwork, ventilation components, and air conditioning parts": "Conductos, componentes de ventilación y piezas de aire acondicionado.",
  "Easy Operation": "Operación fácil",
  "Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "Las prensas plegadoras electrohidráulicas utilizan un sistema de control electrónico para una sincronización precisa entre cilindros, lo que ofrece mayor precisión y repetibilidad en comparación con los sistemas hidráulicos tradicionales. También consumen menos energía y brindan tiempos de respuesta más rápidos.",
  "Electronics": "Electrónica",
  "Energy Efficient": "Eficiencia energética",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Furniture": "Muebles",
  "HVAC Systems": "Sistemas HVAC",
  "Heavy-duty welded steel frame ensures long-term stability and durability under continuous operation": "El marco de acero soldado de alta resistencia garantiza estabilidad y durabilidad a largo plazo en funcionamiento continuo.",
  "High Precision": "Alta precisión",
  "High positioning accuracy ensures consistent bending quality for demanding applications": "La alta precisión de posicionamiento garantiza una calidad de plegado constante para aplicaciones exigentes",
  "High-precision bending for aircraft components and assemblies": "Doblado de alta precisión para componentes y conjuntos de aeronaves",
  "How long is the warranty period?": "¿Cuánto dura el período de garantía?",
  "Hydraulic System": "Sistema hidráulico",
  "Industrial Equipment": "Equipos industriales",
  "Intuitive CNC controller with touch screen interface reduces training time and increases productivity": "El controlador CNC intuitivo con interfaz de pantalla táctil reduce el tiempo de capacitación y aumenta la productividad",
  "Machine guards, hoppers, and custom metal parts": "Protectores de máquinas, tolvas y piezas metálicas personalizadas",
  "Manufacturing of brackets, frames, and body parts": "Fabricación de soportes, marcos y partes de carrocería.",
  "Mechanical Structure": "Estructura mecánica",
  "Metal furniture frames, cabinets, and decorative elements": "Estructuras de muebles, armarios y elementos decorativos metálicos.",
  "Multi-axis CNC back gauge system with ball screw transmission for high positioning accuracy. The system features automatic positioning, programmable movements, and can be equipped with additional support arms for handling large workpieces efficiently and accurately.": "Sistema de tope trasero CNC multieje con transmisión de husillo de bolas para una alta precisión de posicionamiento. El sistema presenta posicionamiento automático, movimientos programables y puede equiparse con brazos de soporte adicionales para manipular piezas de trabajo grandes de manera eficiente y precisa.",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "Nuestras máquinas dobladoras CNC pueden procesar diversos materiales, incluidos acero dulce, acero inoxidable, aluminio, cobre y otras aleaciones metálicas. El espesor máximo depende del tipo de material y del tonelaje de la máquina.",
  "Precision bending for enclosures, chassis, and structural components": "Doblado de precisión para gabinetes, chasis y componentes estructurales",
  "Robust Construction": "Construcción robusta",
  "Safety First": "Seguridad ante todo",
  "Safety System": "Sistema de seguridad",
  "Server racks, control cabinets, and electronic enclosures": "Racks de servidores, gabinetes de control y gabinetes electrónicos",
  "Sheet Metal Fabrication": "Fabricación de chapa metálica",
  "Size: 2.5 MB | Pages: 24": "Tamaño: 2,5 MB | Páginas: 24",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Standard Configuration": "Configuración estándar",
  "Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "Las configuraciones estándar normalmente se envían en un plazo de 30 a 45 días. Las configuraciones personalizadas pueden requerir entre 60 y 90 días. Le proporcionaremos un cronograma específico cuando realice su pedido.",
  "Still have questions?": "¿Aún tienes preguntas?",
  "The electro-hydraulic synchronous system ensures precise synchronization of the left and right cylinders. Equipped with high-quality imported hydraulic components, the system provides stable pressure, low noise operation, and excellent energy efficiency for consistent bending performance.": "El sistema síncrono electrohidráulico garantiza una sincronización precisa de los cilindros izquierdo y derecho. Equipado con componentes hidráulicos importados de alta calidad, el sistema proporciona una presión estable, un funcionamiento silencioso y una excelente eficiencia energética para un rendimiento de flexión constante.",
  "The main mechanical structure of the press brake consists of the frame, column, ram, worktable, the main cylinder and backgauge. The main components are through finite element analysis and optimized design by 3D software to fully guarantee the structural strength and rigidity of each component.": "La estructura mecánica principal de la plegadora consta del marco, la columna, el ariete, la mesa de trabajo, el cilindro principal y el tope trasero. Los componentes principales son mediante análisis de elementos finitos y diseño optimizado mediante software 3D para garantizar plenamente la resistencia estructural y rigidez de cada componente.",
  "Versatile Tooling": "Herramientas versátiles",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "Ofrecemos una garantía integral de 2 años que cubre todos los componentes y sistemas principales. Hay opciones de garantía extendida disponibles. Todas las máquinas incluyen soporte técnico de por vida.",
  "What is the difference between electro-hydraulic and hydraulic press brakes?": "¿Cuál es la diferencia entre prensas plegadoras electrohidráulicas e hidráulicas?",
  "What is the typical lead time for delivery?": "¿Cuál es el plazo típico de entrega?",
  "What materials can be bent with this machine?": "¿Qué materiales se pueden doblar con esta máquina?",
  "Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "Sí, mantenemos un inventario completo de repuestos y consumibles. La mayoría de las piezas se pueden enviar en un plazo de 24 a 48 horas. También proporcionamos catálogos de piezas detallados y guías de mantenimiento.",
  "Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "Sí, brindamos servicios completos de instalación y capacitación integral para operadores. Nuestro equipo técnico se asegurará de que su máquina esté configurada correctamente y que sus operadores estén completamente capacitados para usarla de manera eficiente y segura.",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Puede comprender mejor el rendimiento de la máquina a través de la siguiente pantalla detallada de la máquina y descripción de texto",
  "Are spare parts readily available? Yes, we maintain a comprehensive inventory of spare parts and consumables. Most parts can be shipped within 24-48 hours. We also provide detailed parts catalogs and maintenance guides.": "¿Hay repuestos fácilmente disponibles? Sí, mantenemos un inventario completo de repuestos y consumibles. La mayoría de las piezas se pueden enviar en un plazo de 24 a 48 horas. También proporcionamos catálogos de piezas detallados y guías de mantenimiento.",
  "Do you provide installation and training? Yes, we provide complete installation services and comprehensive operator training. Our technical team will ensure your machine is properly set up and your operators are fully trained to use it efficiently and safely.": "¿Ofrecen instalación y capacitación? Sí, brindamos servicios completos de instalación y capacitación integral para operadores. Nuestro equipo técnico se asegurará de que su máquina esté configurada correctamente y que sus operadores estén completamente capacitados para usarla de manera eficiente y segura.",
  "How long is the warranty period? We offer a comprehensive 2-year warranty covering all major components and systems. Extended warranty options are available. Lifetime technical support is included with all machines.": "¿Cuánto dura el período de garantía? Ofrecemos una garantía integral de 2 años que cubre todos los componentes y sistemas principales. Hay opciones de garantía extendida disponibles. Todas las máquinas incluyen soporte técnico de por vida.",
  "What is the difference between electro-hydraulic and hydraulic press brakes? Electro-hydraulic press brakes use an electronic control system for precise synchronization between cylinders, offering better accuracy and repeatability compared to traditional hydraulic systems. They also consume less energy and provide faster response times.": "¿Cuál es la diferencia entre prensas plegadoras electrohidráulicas e hidráulicas? Las prensas plegadoras electrohidráulicas utilizan un sistema de control electrónico para una sincronización precisa entre cilindros, lo que ofrece mayor precisión y repetibilidad en comparación con los sistemas hidráulicos tradicionales. También consumen menos energía y brindan tiempos de respuesta más rápidos.",
  "What is the typical lead time for delivery? Standard configurations typically ship within 30-45 days. Custom configurations may require 60-90 days. We'll provide a specific timeline when you place your order.": "¿Cuál es el plazo típico de entrega? Las configuraciones estándar normalmente se envían en un plazo de 30 a 45 días. Las configuraciones personalizadas pueden requerir entre 60 y 90 días. Le proporcionaremos un cronograma específico cuando realice su pedido.",
  "What materials can be bent with this machine? Our CNC bending machines can process various materials including mild steel, stainless steel, aluminum, copper, and other metal alloys. The maximum thickness depends on the material type and machine tonnage.": "¿Qué materiales se pueden doblar con esta máquina? Nuestras máquinas dobladoras CNC pueden procesar diversos materiales, incluidos acero dulce, acero inoxidable, aluminio, cobre y otras aleaciones metálicas. El espesor máximo depende del tipo de material y del tonelaje de la máquina."
}