{
  "Heavy-duty Press Brake": "Prensa plegadora de servicio pesado",
  "Industrial-grade press brake engineered for extreme bending forces and thick materials. Built with reinforced frame construction, oversized hydraulic systems, and advanced CNC control for demanding heavy manufacturing applications requiring maximum power and precision.": "Prensa plegadora de grado industrial diseñada para fuerzas de flexión extremas y materiales gruesos. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "Industrial heavy-duty press brake designed for extreme bending applications": "Prensa plegadora industrial de servicio pesado diseñada para aplicaciones de flexión extremas",
  "Machine Capacity": "Capacidad de la máquina",
  "Available in heavy-duty tonnage ranges": "Disponible en rangos de tonelaje para servicio pesado",
  "Extended table length options": "Opciones de longitud de mesa extendida",
  "Large stroke capabilities": "Grandes capacidades de carrera",
  "Deep throat depth configurations": "Configuraciones de profundidad de garganta profunda",
  "Control System": "Sistema de control",
  "Advanced CNC controller": "Controlador CNC avanzado",
  "Positioning Accuracy: ±0.01mm": "Precisión de posicionamiento: ±0,01 mm",
  "6-8 axis CNC back gauge": "Tope trasero CNC de 6-8 ejes",
  "Industrial safety systems": "Sistemas de seguridad industriales",
  "Features": "Características",
  "Reinforced frame structure": "Estructura de marco reforzada",
  "Heavy-duty hydraulic system": "Sistema hidráulico de servicio pesado",
  "Automatic crowning system": "Sistema de coronación automática",
  "Premium industrial components": "Componentes industriales de primera calidad",
  "Why Choose Heavy-duty Press Brake?": "¿Por qué elegir una plegadora de servicio pesado?",
  "Discover the powerful advantages of our heavy-duty press brake for industrial applications": "Descubra las poderosas ventajas de nuestra plegadora de servicio pesado para aplicaciones industriales",
  "Extreme Bending Force": "Fuerza de flexión extrema",
  "Up to 1000 tons of bending force for thick steel plates and heavy-duty applications": "Hasta 1000 toneladas de fuerza de flexión para placas de acero gruesas y aplicaciones de servicio pesado",
  "Reinforced Structure": "Estructura reforzada",
  "Ultra-strong welded steel frame with stress-relieved construction for maximum rigidity": "Estructura de acero soldado ultrarresistente con construcción con alivio de tensiones para máxima rigidez",
  "High Precision": "Alta precisión",
  "Advanced CNC control maintains ±0.01mm accuracy even at maximum tonnage": "El control CNC avanzado mantiene una precisión de ±0,01 mm incluso con el tonelaje máximo",
  "Industrial Components": "Componentes industriales",
  "Premium European hydraulic components and industrial-grade electrical systems": "Componentes hidráulicos europeos de primera calidad y sistemas eléctricos de calidad industrial.",
  "Continuous Operation": "Operación continua",
  "Built for 24/7 industrial production with advanced cooling and monitoring systems": "Construido para producción industrial 24 horas al día, 7 días a la semana, con sistemas avanzados de refrigeración y monitoreo",
  "Maximum Safety": "Máxima Seguridad",
  "Comprehensive industrial safety systems including light curtains and overload protection": "Sistemas integrales de seguridad industrial que incluyen cortinas de luz y protección contra sobrecargas.",
  "Components": "Componentes",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Puede comprender mejor el rendimiento de la máquina a través de la siguiente pantalla detallada de la máquina y descripción de texto",
  "Controller": "Controlador",
  "The controller can control the Y1 and Y2 axes (Y1 controls the left cylinder and Y2 controls the right cylinder) to ensure the synchronous movement of the ram. The standard controller of our WAD series press brake is Delem DA53T. CYBELEC and Esa brand controller can be selected based on your practical use and budget.": "El controlador puede controlar los ejes Y1 e Y2 (Y1 controla el cilindro izquierdo e Y2 controla el cilindro derecho) para garantizar el movimiento sincrónico del ariete. ",
  "Main Motor": "Motor principal",
  "The motor of our press brake is adopt world famous brand \"Siemens\", which will not only has low noise during working of the machine but also has longer service life.": "El motor de nuestra plegadora adopta la mundialmente famosa marca \"Siemens\", que no solo genera poco ruido durante el funcionamiento de la máquina sino que también tiene una vida útil más larga.",
  "Oil Pump": "Bomba de aceite",
  "International imported brand oil pump is adopted, with lower noise and stronger output power. Amazing low noise, made of high strength cast iron and unique design for inner noise reduction. Low sensitivity to oil pollution and assure of long service life.": "Se adopta una bomba de aceite de marca importada internacional, con menor ruido y mayor potencia de salida. ",
  "Hydraulic System": "Sistema hidráulico",
  "Our press brake machine uses Hoerbiger integrated hydraulic control system that make it more reliable and easy for maintenance.": "Nuestra prensa plegadora utiliza el sistema de control hidráulico integrado Hoerbiger que la hace más confiable y fácil de mantener.",
  "Punches & Dies": "Punzones y matrices",
  "The standard top punch and dual-V bottom die are specially designed for bending sheet metals. More press brake toolings can be selected as per your practical use. Material and HRC47 degree values ​​are marked on it.": "El punzón superior estándar y el troquel inferior de doble V están especialmente diseñados para doblar láminas de metal. ",
  "Mechanical Crowning": "Coronación mecánica",
  "The motorized crowning system will adjust the parallelism and straightness automatically.": "El sistema de coronación motorizado ajustará el paralelismo y la rectitud automáticamente.",
  "See Heavy-Duty Power in Action": "Vea la potencia de servicio pesado en acción",
  "Watch our heavy-duty press brake handle thick steel plates with precision and power": "Observe cómo nuestra plegadora de servicio pesado maneja placas de acero gruesas con precisión y potencia",
  "Applications": "Aplicaciones",
  "Heavy-duty press brakes excel in industries requiring extreme bending force and thick material processing": "Las plegadoras de servicio pesado destacan en industrias que requieren fuerza de flexión extrema y procesamiento de materiales gruesos.",
  "Heavy Steel Fabrication": "Fabricación de acero pesado",
  "Thick steel plates, structural beams, and heavy-duty components": "Placas de acero gruesas, vigas estructurales y componentes de alta resistencia.",
  "Mining Equipment": "Equipo de minería",
  "Heavy machinery frames, excavator components, and mining structures": "Bastidores de maquinaria pesada, componentes de excavadoras y estructuras mineras.",
  "Shipbuilding": "Construcción naval",
  "Thick hull plates, marine structures, and shipyard fabrication": "Placas gruesas de casco, estructuras marinas y fabricación en astilleros.",
  "Bridge Construction": "Construcción de puentes",
  "Heavy structural steel, bridge girders, and infrastructure components": "Acero estructural pesado, vigas de puentes y componentes de infraestructura",
  "Oil & Gas Industry": "Industria del petróleo y el gas",
  "Pressure vessels, storage tanks, and pipeline components": "Recipientes a presión, tanques de almacenamiento y componentes de tuberías",
  "Power Generation": "Generación de energía",
  "Power plant structures, boiler components, and turbine housings": "Estructuras de centrales eléctricas, componentes de calderas y carcasas de turbinas.",
  "Construction Machinery": "Maquinaria de construcción",
  "Bulldozer blades, crane components, and heavy equipment parts": "Hojas de topadoras, componentes de grúas y piezas de equipos pesados",
  "Steel Service Centers": "Centros de servicio de acero",
  "High-volume processing of thick steel plates and profiles": "Procesamiento de gran volumen de placas y perfiles de acero gruesos",
  "Industrial Configuration": "Configuración industrial",
  "Premium standard features and advanced options for heavy-duty industrial applications": "Funciones estándar premium y opciones avanzadas para aplicaciones industriales de servicio pesado",
  "Standard Configuration": "Configuración estándar",
  "Advanced Options": "Opciones avanzadas",
  "Need a custom heavy-duty solution?": "¿Necesita una solución personalizada para trabajos pesados?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about heavy-duty press brakes": "Preguntas comunes sobre plegadoras de servicio pesado",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick, stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage, working length, and material properties.": "Dependiendo del tonelaje y el tipo de material, las plegadoras de servicio pesado pueden doblar acero dulce de hasta 50 mm de espesor, acero inoxidable de hasta 30 mm y aluminio de hasta 40 mm. ",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "El sistema de coronación automático compensa la deflexión del marco ajustando la curvatura de la mesa. ",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation. Regular maintenance schedules should be followed to ensure optimal performance.": "Sí, las plegadoras de servicio pesado están diseñadas específicamente para la producción industrial continua. ",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "Las plegadoras de servicio pesado requieren cimientos de hormigón armado debido a su importante peso y fuerzas operativas. ",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days depending on tonnage, configuration, and optional features. Rush delivery may be available for certain configurations.": "Las plegadoras de servicio pesado generalmente se diseñan a medida según las especificaciones. ",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended warranty packages and preventive maintenance programs are available.": "Ofrecemos una garantía integral de 3 años para máquinas de servicio pesado que cubre todos los componentes principales. ",
  "Need technical specifications?": "¿Necesita especificaciones técnicas?",
  "Download Industrial Catalog": "Descargar Catálogo Industrial",
  "Get comprehensive technical information about our heavy-duty press brake series, including tonnage charts, specifications, and application examples in PDF format.": "Obtenga información técnica completa sobre nuestra serie de plegadoras de servicio pesado, incluidas tablas de tonelaje, especificaciones y ejemplos de aplicaciones en formato PDF."
}