{
  "Heavy-duty Press Brake": "Presse plieuse robuste",
  "Industrial-grade press brake engineered for extreme bending forces and thick materials. Built with reinforced frame construction, oversized hydraulic systems, and advanced CNC control for demanding heavy manufacturing applications requiring maximum power and precision.": "Presse plieuse de qualité industrielle conçue pour les forces de flexion extrêmes et les matériaux épais. ",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "Industrial heavy-duty press brake designed for extreme bending applications": "Presse-plieuse industrielle robuste conçue pour les applications de pliage extrêmes",
  "Machine Capacity": "Capacité des machines",
  "Available in heavy-duty tonnage ranges": "Disponible dans des gammes de tonnages robustes",
  "Extended table length options": "Options de longueur de table étendue",
  "Large stroke capabilities": "Capacités de grande course",
  "Deep throat depth configurations": "Configurations de profondeur de gorge profonde",
  "Control System": "Système de contrôle",
  "Advanced CNC controller": "Contrôleur CNC avancé",
  "Positioning Accuracy: ±0.01mm": "Précision de positionnement : ±0,01 mm",
  "6-8 axis CNC back gauge": "Jauge arrière CNC 6-8 axes",
  "Industrial safety systems": "Systèmes de sécurité industrielle",
  "Features": "Caractéristiques",
  "Reinforced frame structure": "Structure de cadre renforcée",
  "Heavy-duty hydraulic system": "Système hydraulique robuste",
  "Automatic crowning system": "Système de couronnement automatique",
  "Premium industrial components": "Composants industriels haut de gamme",
  "Why Choose Heavy-duty Press Brake?": "Pourquoi choisir une presse plieuse robuste ?",
  "Discover the powerful advantages of our heavy-duty press brake for industrial applications": "Découvrez les puissants avantages de notre presse plieuse robuste pour les applications industrielles",
  "Extreme Bending Force": "Force de flexion extrême",
  "Up to 1000 tons of bending force for thick steel plates and heavy-duty applications": "Jusqu'à 1 000 tonnes de force de flexion pour les tôles d'acier épaisses et les applications lourdes",
  "Reinforced Structure": "Structure renforcée",
  "Ultra-strong welded steel frame with stress-relieved construction for maximum rigidity": "Cadre en acier soudé ultra résistant avec construction sans contrainte pour une rigidité maximale",
  "High Precision": "Haute précision",
  "Advanced CNC control maintains ±0.01mm accuracy even at maximum tonnage": "La commande CNC avancée maintient une précision de ± 0,01 mm même au tonnage maximum",
  "Industrial Components": "Composants industriels",
  "Premium European hydraulic components and industrial-grade electrical systems": "Composants hydrauliques européens haut de gamme et systèmes électriques de qualité industrielle",
  "Continuous Operation": "Fonctionnement continu",
  "Built for 24/7 industrial production with advanced cooling and monitoring systems": "Conçu pour une production industrielle 24h/24 et 7j/7 avec des systèmes de refroidissement et de surveillance avancés",
  "Maximum Safety": "Sécurité maximale",
  "Comprehensive industrial safety systems including light curtains and overload protection": "Systèmes complets de sécurité industrielle comprenant des barrières immatérielles et une protection contre les surcharges",
  "Components": "Composants",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Vous pouvez mieux comprendre les performances de la machine grâce à l'affichage détaillé de la machine et à la description textuelle suivante",
  "Controller": "Contrôleur",
  "The controller can control the Y1 and Y2 axes (Y1 controls the left cylinder and Y2 controls the right cylinder) to ensure the synchronous movement of the ram. The standard controller of our WAD series press brake is Delem DA53T. CYBELEC and Esa brand controller can be selected based on your practical use and budget.": "Le contrôleur peut contrôler les axes Y1 et Y2 (Y1 contrôle le cylindre gauche et Y2 contrôle le cylindre droit) pour assurer le mouvement synchrone du vérin. ",
  "Main Motor": "Moteur principal",
  "The motor of our press brake is adopt world famous brand \"Siemens\", which will not only has low noise during working of the machine but also has longer service life.": "Le moteur de notre presse plieuse adopte la marque de renommée mondiale \"Siemens\", qui aura non seulement un faible bruit pendant le fonctionnement de la machine, mais aura également une durée de vie plus longue.",
  "Oil Pump": "Pompe à huile",
  "International imported brand oil pump is adopted, with lower noise and stronger output power. Amazing low noise, made of high strength cast iron and unique design for inner noise reduction. Low sensitivity to oil pollution and assure of long service life.": "Une pompe à huile de marque importée internationale est adoptée, avec moins de bruit et une puissance de sortie plus forte. ",
  "Hydraulic System": "Système hydraulique",
  "Our press brake machine uses Hoerbiger integrated hydraulic control system that make it more reliable and easy for maintenance.": "Notre presse plieuse utilise le système de commande hydraulique intégré Hoerbiger qui la rend plus fiable et plus facile à entretenir.",
  "Punches & Dies": "Poinçons et matrices",
  "The standard top punch and dual-V bottom die are specially designed for bending sheet metals. More press brake toolings can be selected as per your practical use. Material and HRC47 degree values ​​are marked on it.": "Le poinçon supérieur standard et la matrice inférieure à double V sont spécialement conçus pour plier les tôles. ",
  "Mechanical Crowning": "Couronnement mécanique",
  "The motorized crowning system will adjust the parallelism and straightness automatically.": "Le système de couronnement motorisé ajustera automatiquement le parallélisme et la rectitude.",
  "See Heavy-Duty Power in Action": "Voir la puissance robuste en action",
  "Watch our heavy-duty press brake handle thick steel plates with precision and power": "Regardez notre presse plieuse robuste manipuler des plaques d'acier épaisses avec précision et puissance",
  "Applications": "Applications",
  "Heavy-duty press brakes excel in industries requiring extreme bending force and thick material processing": "Les presses plieuses robustes excellent dans les industries nécessitant une force de flexion extrême et le traitement de matériaux épais",
  "Heavy Steel Fabrication": "Fabrication d'acier lourd",
  "Thick steel plates, structural beams, and heavy-duty components": "Plaques d'acier épaisses, poutres structurelles et composants robustes",
  "Mining Equipment": "Équipement minier",
  "Heavy machinery frames, excavator components, and mining structures": "Châssis de machinerie lourde, composants d'excavatrice et structures minières",
  "Shipbuilding": "Construction navale",
  "Thick hull plates, marine structures, and shipyard fabrication": "Plaques de coque épaisses, structures marines et fabrication sur chantier naval",
  "Bridge Construction": "Construction de ponts",
  "Heavy structural steel, bridge girders, and infrastructure components": "Acier de construction lourd, poutres de pont et composants d'infrastructure",
  "Oil & Gas Industry": "Industrie pétrolière et gazière",
  "Pressure vessels, storage tanks, and pipeline components": "Récipients sous pression, réservoirs de stockage et composants de pipelines",
  "Power Generation": "Production d'énergie",
  "Power plant structures, boiler components, and turbine housings": "Structures de centrales électriques, composants de chaudières et carters de turbine",
  "Construction Machinery": "Machines de construction",
  "Bulldozer blades, crane components, and heavy equipment parts": "Lames de bulldozer, composants de grue et pièces d'équipement lourd",
  "Steel Service Centers": "Centres de service en acier",
  "High-volume processing of thick steel plates and profiles": "Traitement de gros volumes de tôles et de profilés en acier épais",
  "Industrial Configuration": "Configuration industrielle",
  "Premium standard features and advanced options for heavy-duty industrial applications": "Fonctionnalités standard haut de gamme et options avancées pour les applications industrielles intensives",
  "Standard Configuration": "Configuration standard",
  "Advanced Options": "Options avancées",
  "Need a custom heavy-duty solution?": "Besoin d'une solution robuste sur mesure ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about heavy-duty press brakes": "Questions courantes sur les presses plieuses pour usage intensif",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick, stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage, working length, and material properties.": "En fonction du tonnage et du type de matériau, les presses plieuses robustes peuvent plier l'acier doux jusqu'à 50 mm d'épaisseur, l'acier inoxydable jusqu'à 30 mm et l'aluminium jusqu'à 40 mm. ",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "Le système de bombage automatique compense la déflexion du cadre en ajustant la courbure de la table. ",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation. Regular maintenance schedules should be followed to ensure optimal performance.": "Oui, les presses plieuses robustes sont spécialement conçues pour une production industrielle continue. ",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "Les presses plieuses robustes nécessitent des fondations en béton armé en raison de leur poids et de leurs forces opérationnelles importantes. ",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days depending on tonnage, configuration, and optional features. Rush delivery may be available for certain configurations.": "Les presses plieuses robustes sont généralement conçues sur mesure selon les spécifications. ",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended warranty packages and preventive maintenance programs are available.": "Nous offrons une garantie complète de 3 ans sur les machines robustes couvrant tous les composants principaux. ",
  "Need technical specifications?": "Besoin de spécifications techniques ?",
  "Download Industrial Catalog": "Télécharger le catalogue industriel",
  "Get comprehensive technical information about our heavy-duty press brake series, including tonnage charts, specifications, and application examples in PDF format.": "Obtenez des informations techniques complètes sur notre série de presses plieuses robustes, y compris des tableaux de tonnage, des spécifications et des exemples d'application au format PDF."
}