{
  "Heavy-duty Press Brake": "強力プレスブレーキ",
  "Industrial-grade press brake engineered for extreme bending forces and thick materials. Built with reinforced frame construction, oversized hydraulic systems, and advanced CNC control for demanding heavy manufacturing applications requiring maximum power and precision.": "極度の曲げ力や厚い材料向けに設計された工業用グレードのプレス ブレーキ。",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "Industrial heavy-duty press brake designed for extreme bending applications": "極端な曲げ用途向けに設計された産業用重荷重プレス ブレーキ",
  "Machine Capacity": "機械能力",
  "Available in heavy-duty tonnage ranges": "重量級のトン数範囲で利用可能",
  "Extended table length options": "拡張テーブル長オプション",
  "Large stroke capabilities": "大きなストローク能力",
  "Deep throat depth configurations": "ディープスロートの深さ構成",
  "Control System": "制御システム",
  "Advanced CNC controller": "先進的なCNCコントローラー",
  "Positioning Accuracy: ±0.01mm": "位置決め精度：±0.01mm",
  "6-8 axis CNC back gauge": "6-8軸CNCバックゲージ",
  "Industrial safety systems": "産業安全システム",
  "Features": "特徴",
  "Reinforced frame structure": "強化フレーム構造",
  "Heavy-duty hydraulic system": "頑丈な油圧システム",
  "Automatic crowning system": "自動クラウニングシステム",
  "Premium industrial components": "プレミアム産業用コンポーネント",
  "Why Choose Heavy-duty Press Brake?": "耐久性の高いプレス ブレーキを選択する理由",
  "Discover the powerful advantages of our heavy-duty press brake for industrial applications": "産業用途向けの当社の重荷重プレス ブレーキの強力な利点を発見してください。",
  "Extreme Bending Force": "極度の曲げ力",
  "Up to 1000 tons of bending force for thick steel plates and heavy-duty applications": "厚鋼板や頑丈な用途に耐える最大 1000 トンの曲げ力",
  "Reinforced Structure": "強化構造",
  "Ultra-strong welded steel frame with stress-relieved construction for maximum rigidity": "応力を緩和した構造を備えた超強力な溶接スチールフレームにより、最大限の剛性を実現",
  "High Precision": "高精度",
  "Advanced CNC control maintains ±0.01mm accuracy even at maximum tonnage": "高度な CNC 制御により、最大トン数でも ±0.01mm の精度を維持",
  "Industrial Components": "産業用コンポーネント",
  "Premium European hydraulic components and industrial-grade electrical systems": "ヨーロッパのプレミアム油圧コンポーネントと産業グレードの電気システム",
  "Continuous Operation": "連続運転",
  "Built for 24/7 industrial production with advanced cooling and monitoring systems": "高度な冷却および監視システムを備えた 24 時間年中無休の工業生産向けに構築",
  "Maximum Safety": "最大限の安全性",
  "Comprehensive industrial safety systems including light curtains and overload protection": "ライトカーテンや過負荷保護などの包括的な産業安全システム",
  "Components": "コンポーネント",
  "You can better understand the performance of the machine through the following machine detail display and text description": "次のマシンの詳細表示とテキストの説明を通じて、マシンのパフォーマンスをよりよく理解できます。",
  "Controller": "コントローラ",
  "The controller can control the Y1 and Y2 axes (Y1 controls the left cylinder and Y2 controls the right cylinder) to ensure the synchronous movement of the ram. The standard controller of our WAD series press brake is Delem DA53T. CYBELEC and Esa brand controller can be selected based on your practical use and budget.": "コントローラーは Y1 軸と Y2 軸を制御して (Y1 は左側のシリンダーを制御し、Y2 は右側のシリンダーを制御します)、ラムの同期動作を保証します。",
  "Main Motor": "メインモーター",
  "The motor of our press brake is adopt world famous brand \"Siemens\", which will not only has low noise during working of the machine but also has longer service life.": "当社のプレスブレーキのモーターは世界的に有名なブランド「シーメンス」を採用しており、機械作動時の騒音が低いだけでなく、寿命も長いです。",
  "Oil Pump": "オイルポンプ",
  "International imported brand oil pump is adopted, with lower noise and stronger output power. Amazing low noise, made of high strength cast iron and unique design for inner noise reduction. Low sensitivity to oil pollution and assure of long service life.": "海外輸入ブランドのオイルポンプを採用し、低騒音かつ強力な出力を実現します。",
  "Hydraulic System": "油圧システム",
  "Our press brake machine uses Hoerbiger integrated hydraulic control system that make it more reliable and easy for maintenance.": "当社のプレス ブレーキ機はホルビガー統合油圧制御システムを採用しており、信頼性が高くメンテナンスが容易です。",
  "Punches & Dies": "パンチ＆ダイス",
  "The standard top punch and dual-V bottom die are specially designed for bending sheet metals. More press brake toolings can be selected as per your practical use. Material and HRC47 degree values ​​are marked on it.": "標準の上部パンチとデュアル V 下部ダイは、板金の曲げ用に特別に設計されています。",
  "Mechanical Crowning": "メカニカルクラウニング",
  "The motorized crowning system will adjust the parallelism and straightness automatically.": "電動クラウニングシステムにより、平行度と真直度が自動的に調整されます。",
  "See Heavy-Duty Power in Action": "頑丈なパワーの動作をご覧ください",
  "Watch our heavy-duty press brake handle thick steel plates with precision and power": "当社の頑丈なプレス ブレーキが厚鋼板を正確かつ強力に処理する様子をご覧ください。",
  "Applications": "アプリケーション",
  "Heavy-duty press brakes excel in industries requiring extreme bending force and thick material processing": "頑丈なプレスブレーキは、極度の曲げ力や厚い材料の加工を必要とする産業に優れています。",
  "Heavy Steel Fabrication": "重量鋼の製造",
  "Thick steel plates, structural beams, and heavy-duty components": "厚鋼板、構造梁、頑丈なコンポーネント",
  "Mining Equipment": "鉱山機械",
  "Heavy machinery frames, excavator components, and mining structures": "重機フレーム、掘削機コンポーネント、鉱山構造物",
  "Shipbuilding": "造船",
  "Thick hull plates, marine structures, and shipyard fabrication": "厚い船体プレート、海洋構造物、造船所の製造",
  "Bridge Construction": "橋の建設",
  "Heavy structural steel, bridge girders, and infrastructure components": "重量構造用鋼材、橋桁、インフラコンポーネント",
  "Oil & Gas Industry": "石油・ガス産業",
  "Pressure vessels, storage tanks, and pipeline components": "圧力容器、貯蔵タンク、パイプラインコンポーネント",
  "Power Generation": "発電",
  "Power plant structures, boiler components, and turbine housings": "発電所構造物、ボイラー部品、タービンハウジング",
  "Construction Machinery": "建設機械",
  "Bulldozer blades, crane components, and heavy equipment parts": "ブルドーザーブレード、クレーン部品、重機部品",
  "Steel Service Centers": "スチールサービスセンター",
  "High-volume processing of thick steel plates and profiles": "厚鋼板や異形材の大量加工",
  "Industrial Configuration": "産業用構成",
  "Premium standard features and advanced options for heavy-duty industrial applications": "耐久性の高い産業用途向けのプレミアム標準機能と高度なオプション",
  "Standard Configuration": "標準構成",
  "Advanced Options": "詳細オプション",
  "Need a custom heavy-duty solution?": "カスタムの高耐久ソリューションが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about heavy-duty press brakes": "重荷重用プレスブレーキに関するよくある質問",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick, stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage, working length, and material properties.": "トン数と材料の種類に応じて、大型プレス ブレーキは厚さ 50 mm までの軟鋼、厚さ 30 mm までのステンレス鋼、および 40 mm までのアルミニウムを曲げることができます。",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "自動クラウニング システムは、テーブルの曲率を調整することでフレームのたわみを補正します。 ",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation. Regular maintenance schedules should be followed to ensure optimal performance.": "はい、頑丈なプレス ブレーキは、継続的な工業生産向けに特別に設計されています。",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "頑丈なプレスブレーキは、その重量と操作力が大きいため、鉄筋コンクリート基礎が必要です。",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days depending on tonnage, configuration, and optional features. Rush delivery may be available for certain configurations.": "大型プレス ブレーキは通常、仕様に合わせてカスタム設計されています。",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended warranty packages and preventive maintenance programs are available.": "当社は、すべての主要コンポーネントをカバーする大型機械に対して、包括的な 3 年間の保証を提供します。",
  "Need technical specifications?": "技術仕様が必要ですか?",
  "Download Industrial Catalog": "工業用カタログのダウンロード",
  "Get comprehensive technical information about our heavy-duty press brake series, including tonnage charts, specifications, and application examples in PDF format.": "トン数表、仕様、用途例など、重荷重用プレスブレーキシリーズに関する包括的な技術情報を PDF 形式でご覧いただけます。"
}