{
  "Heavy-duty Press Brake": "Hochleistungs-Abkantpresse",
  "Industrial-grade press brake engineered for extreme bending forces and thick materials. Built with reinforced frame construction, oversized hydraulic systems, and advanced CNC control for demanding heavy manufacturing applications requiring maximum power and precision.": "Abkantpresse in Industriequalität, entwickelt für extreme Biegekräfte und dicke Materialien. ",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "Industrial heavy-duty press brake designed for extreme bending applications": "Industrielle Hochleistungs-Abkantpresse für extreme Biegeanwendungen",
  "Machine Capacity": "Maschinenkapazität",
  "Available in heavy-duty tonnage ranges": "Erhältlich in schweren Tonnagebereichen",
  "Extended table length options": "Erweiterte Optionen für die Tabellenlänge",
  "Large stroke capabilities": "Große Hubfähigkeiten",
  "Deep throat depth configurations": "Deep-Throat-Tiefenkonfigurationen",
  "Control System": "Kontrollsystem",
  "Advanced CNC controller": "Fortschrittlicher CNC-Controller",
  "Positioning Accuracy: ±0.01mm": "Positionierungsgenauigkeit: ±0,01 mm",
  "6-8 axis CNC back gauge": "6-8-Achsen-CNC-Hinteranschlag",
  "Industrial safety systems": "Industrielle Sicherheitssysteme",
  "Features": "Merkmale",
  "Reinforced frame structure": "Verstärkte Rahmenstruktur",
  "Heavy-duty hydraulic system": "Hochleistungshydrauliksystem",
  "Automatic crowning system": "Automatisches Bombierungssystem",
  "Premium industrial components": "Hochwertige Industriekomponenten",
  "Why Choose Heavy-duty Press Brake?": "Warum sollten Sie sich für eine Hochleistungs-Abkantpresse entscheiden?",
  "Discover the powerful advantages of our heavy-duty press brake for industrial applications": "Entdecken Sie die kraftvollen Vorteile unserer Hochleistungs-Abkantpresse für industrielle Anwendungen",
  "Extreme Bending Force": "Extreme Biegekraft",
  "Up to 1000 tons of bending force for thick steel plates and heavy-duty applications": "Bis zu 1000 Tonnen Biegekraft für dicke Stahlplatten und schwere Anwendungen",
  "Reinforced Structure": "Verstärkte Struktur",
  "Ultra-strong welded steel frame with stress-relieved construction for maximum rigidity": "Ultrastarker geschweißter Stahlrahmen mit spannungsarmer Konstruktion für maximale Steifigkeit",
  "High Precision": "Hohe Präzision",
  "Advanced CNC control maintains ±0.01mm accuracy even at maximum tonnage": "Die fortschrittliche CNC-Steuerung sorgt selbst bei maximaler Tonnage für eine Genauigkeit von ±0,01 mm",
  "Industrial Components": "Industrielle Komponenten",
  "Premium European hydraulic components and industrial-grade electrical systems": "Hochwertige europäische Hydraulikkomponenten und elektrische Systeme in Industriequalität",
  "Continuous Operation": "Kontinuierlicher Betrieb",
  "Built for 24/7 industrial production with advanced cooling and monitoring systems": "Gebaut für die industrielle Produktion rund um die Uhr mit fortschrittlichen Kühl- und Überwachungssystemen",
  "Maximum Safety": "Maximale Sicherheit",
  "Comprehensive industrial safety systems including light curtains and overload protection": "Umfassende Arbeitsschutzsysteme inklusive Lichtvorhängen und Überlastschutz",
  "Components": "Komponenten",
  "You can better understand the performance of the machine through the following machine detail display and text description": "Anhand der folgenden Maschinendetailanzeige und Textbeschreibung können Sie die Leistung der Maschine besser verstehen",
  "Controller": "Regler",
  "The controller can control the Y1 and Y2 axes (Y1 controls the left cylinder and Y2 controls the right cylinder) to ensure the synchronous movement of the ram. The standard controller of our WAD series press brake is Delem DA53T. CYBELEC and Esa brand controller can be selected based on your practical use and budget.": "Der Controller kann die Y1- und Y2-Achsen steuern (Y1 steuert den linken Zylinder und Y2 steuert den rechten Zylinder), um die synchrone Bewegung des Stößels sicherzustellen. ",
  "Main Motor": "Hauptmotor",
  "The motor of our press brake is adopt world famous brand \"Siemens\", which will not only has low noise during working of the machine but also has longer service life.": "Der Motor unserer Abkantpresse stammt von der weltberühmten Marke „Siemens“, die beim Betrieb der Maschine nicht nur geräuscharm ist, sondern auch eine längere Lebensdauer hat.",
  "Oil Pump": "Ölpumpe",
  "International imported brand oil pump is adopted, with lower noise and stronger output power. Amazing low noise, made of high strength cast iron and unique design for inner noise reduction. Low sensitivity to oil pollution and assure of long service life.": "Es wird eine international importierte Markenölpumpe mit geringerem Geräuschpegel und höherer Ausgangsleistung übernommen. ",
  "Hydraulic System": "Hydrauliksystem",
  "Our press brake machine uses Hoerbiger integrated hydraulic control system that make it more reliable and easy for maintenance.": "Unsere Abkantpresse verwendet das integrierte hydraulische Steuerungssystem von Hoerbiger, das sie zuverlässiger und wartungsfreundlicher macht.",
  "Punches & Dies": "Locher und Matrizen",
  "The standard top punch and dual-V bottom die are specially designed for bending sheet metals. More press brake toolings can be selected as per your practical use. Material and HRC47 degree values ​​are marked on it.": "Der Standard-Oberstempel und die Dual-V-Untermatrize sind speziell für das Biegen von Blechen konzipiert. ",
  "Mechanical Crowning": "Mechanische Krönung",
  "The motorized crowning system will adjust the parallelism and straightness automatically.": "Das motorisierte Bombierungssystem passt die Parallelität und Geradheit automatisch an.",
  "See Heavy-Duty Power in Action": "Erleben Sie Hochleistungsantrieb in Aktion",
  "Watch our heavy-duty press brake handle thick steel plates with precision and power": "Sehen Sie, wie unsere Hochleistungs-Abkantpresse dicke Stahlplatten mit Präzision und Kraft bearbeitet",
  "Applications": "Anwendungen",
  "Heavy-duty press brakes excel in industries requiring extreme bending force and thick material processing": "Hochleistungs-Abkantpressen eignen sich hervorragend für Branchen, in denen extreme Biegekräfte und die Verarbeitung dicker Materialien erforderlich sind",
  "Heavy Steel Fabrication": "Schwere Stahlfertigung",
  "Thick steel plates, structural beams, and heavy-duty components": "Dicke Stahlplatten, Strukturträger und hochbelastbare Komponenten",
  "Mining Equipment": "Bergbauausrüstung",
  "Heavy machinery frames, excavator components, and mining structures": "Rahmen für schwere Maschinen, Baggerkomponenten und Bergbaustrukturen",
  "Shipbuilding": "Schiffbau",
  "Thick hull plates, marine structures, and shipyard fabrication": "Dicke Rumpfplatten, Schiffsstrukturen und Werftfertigung",
  "Bridge Construction": "Brückenbau",
  "Heavy structural steel, bridge girders, and infrastructure components": "Schwerer Baustahl, Brückenträger und Infrastrukturkomponenten",
  "Oil & Gas Industry": "Öl- und Gasindustrie",
  "Pressure vessels, storage tanks, and pipeline components": "Druckbehälter, Lagertanks und Rohrleitungskomponenten",
  "Power Generation": "Stromerzeugung",
  "Power plant structures, boiler components, and turbine housings": "Kraftwerksstrukturen, Kesselkomponenten und Turbinengehäuse",
  "Construction Machinery": "Baumaschinen",
  "Bulldozer blades, crane components, and heavy equipment parts": "Planierraupenblätter, Krankomponenten und schwere Ausrüstungsteile",
  "Steel Service Centers": "Stahl-Servicezentren",
  "High-volume processing of thick steel plates and profiles": "Großserienbearbeitung von dicken Stahlplatten und Profilen",
  "Industrial Configuration": "Industrielle Konfiguration",
  "Premium standard features and advanced options for heavy-duty industrial applications": "Premium-Standardfunktionen und erweiterte Optionen für anspruchsvolle Industrieanwendungen",
  "Standard Configuration": "Standardkonfiguration",
  "Advanced Options": "Erweiterte Optionen",
  "Need a custom heavy-duty solution?": "Benötigen Sie eine maßgeschneiderte Hochleistungslösung?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about heavy-duty press brakes": "Häufige Fragen zu Hochleistungs-Abkantpressen",
  "Depending on tonnage and material type, heavy-duty press brakes can bend mild steel up to 50mm thick, stainless steel up to 30mm, and aluminum up to 40mm. The exact capacity depends on the machine tonnage, working length, and material properties.": "Je nach Tonnage und Materialart können Hochleistungs-Abkantpressen Weichstahl bis zu einer Dicke von 50 mm, Edelstahl bis zu 30 mm und Aluminium bis zu 40 mm biegen. ",
  "The automatic crowning system compensates for frame deflection by adjusting the table curvature. It uses CNC-controlled hydraulic or mechanical wedges to create a slight convex curve in the table, counteracting the natural bowing that occurs under heavy loads, ensuring consistent angle across the entire bend length.": "Das automatische Bombierungssystem gleicht die Durchbiegung des Rahmens aus, indem es die Tischkrümmung anpasst. ",
  "Yes, heavy-duty press brakes are specifically designed for continuous industrial production. They feature oversized cooling systems, industrial-grade components, and robust construction to handle 24/7 operation. Regular maintenance schedules should be followed to ensure optimal performance.": "Ja, Hochleistungs-Abkantpressen sind speziell für die kontinuierliche industrielle Produktion konzipiert. ",
  "Heavy-duty press brakes require reinforced concrete foundations due to their significant weight and operational forces. Foundation specifications vary by machine size but typically require 500-800mm thick concrete pads with proper reinforcement. We provide detailed foundation drawings with each machine.": "Hochleistungs-Abkantpressen erfordern aufgrund ihres hohen Gewichts und ihrer Betriebskräfte ein Fundament aus Stahlbeton. ",
  "Heavy-duty press brakes are typically custom-engineered to specifications. Lead time ranges from 90-180 days depending on tonnage, configuration, and optional features. Rush delivery may be available for certain configurations.": "Hochleistungs-Abkantpressen werden in der Regel individuell nach Spezifikationen gefertigt. ",
  "We provide a comprehensive 3-year warranty on heavy-duty machines covering all major components. This includes on-site installation, commissioning, operator training, and 24/7 technical support. Extended warranty packages and preventive maintenance programs are available.": "Auf Hochleistungsmaschinen gewähren wir eine umfassende 3-Jahres-Garantie auf alle wichtigen Komponenten. ",
  "Need technical specifications?": "Benötigen Sie technische Spezifikationen?",
  "Download Industrial Catalog": "Laden Sie den Industriekatalog herunter",
  "Get comprehensive technical information about our heavy-duty press brake series, including tonnage charts, specifications, and application examples in PDF format.": "Erhalten Sie umfassende technische Informationen zu unserer Hochleistungs-Abkantpresse, einschließlich Tonnagetabellen, Spezifikationen und Anwendungsbeispielen im PDF-Format."
}