{
  "Robotic Press Brake": "ロボットプレスブレーキ",
  "Experience the future of metal forming with our fully automated robotic press brake system. Combining advanced robotics, AI-powered controls, and precision bending technology to deliver unmatched productivity, consistency, and operator safety in automated manufacturing environments.": "当社の全自動ロボットプレスブレーキシステムで金属成形の未来を体験してください。",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "Advanced robotic press brake with intelligent automation and precision control": "インテリジェントな自動化と精密制御を備えた高度なロボットプレスブレーキ",
  "Press Brake Capacity": "プレスブレーキ容量",
  "Multiple tonnage options available": "複数のトン数オプションが利用可能",
  "Customizable table length": "カスタマイズ可能なテーブルの長さ",
  "Adjustable stroke range": "ストローク調整範囲",
  "Variable throat depth configurations": "可変スロート深さ構成",
  "Robotic System": "ロボットシステム",
  "6-axis industrial robot": "6軸産業用ロボット",
  "High payload capacity": "高い積載量",
  "Extended reach capability": "拡張リーチ機能",
  "High precision repeatability": "高精度繰り返し精度",
  "Automation Features": "自動化機能",
  "AI adaptive bending control": "AI適応曲げ制御",
  "Automatic tool change system": "自動工具交換システム",
  "Vision-guided positioning": "視覚に基づいた位置決め",
  "24/7 unmanned operation": "24時間365日無人運転",
  "Why Choose Our Robotic Press Brake?": "当社のロボットプレスブレーキを選ぶ理由?",
  "Discover the revolutionary advantages of fully automated robotic bending for modern manufacturing": "現代の製造における完全自動ロボット曲げの革新的な利点を発見してください。",
  "Full Automation": "完全自動化",
  "Eliminate manual material handling with fully automated robotic loading, bending, and unloading operations": "完全に自動化されたロボットによる積み込み、曲げ、および積み降ろし作業により、手作業でのマテリアルハンドリングが不要になります。",
  "Extreme Precision": "極めて高い精度",
  "AI-powered adaptive control with real-time angle monitoring ensures consistent quality every bend": "リアルタイムの角度モニタリングを備えた AI を活用した適応制御により、どの曲げでも一貫した品質を保証します",
  "Higher Productivity": "生産性の向上",
  "Significantly increase output with continuous 24/7 operation and reduced cycle times": "年中無休の連続稼働とサイクルタイムの短縮により生産量が大幅に増加",
  "Smart Integration": "スマートな統合",
  "Seamlessly integrate with ERP, MES, and Industry 4.0 systems for complete production visibility": "ERP、MES、およびインダストリー 4.0 システムとシームレスに統合して、生産を完全に可視化します",
  "Enhanced Safety": "安全性の強化",
  "Remove operators from hazardous zones with comprehensive safety fencing and collision detection": "包括的な安全フェンスと衝突検知により、オペレーターを危険区域から排除します。",
  "Reduced Labor Costs": "人件費の削減",
  "Minimize labor requirements and reduce operational costs with lights-out manufacturing capability": "自動製造機能により労働要件を最小限に抑え、運用コストを削減します",
  "Components": "コンポーネント",
  "Understand the advanced components that make our robotic press brake the most sophisticated automated bending solution": "当社のロボットプレスブレーキを最も洗練された自動曲げソリューションにする高度なコンポーネントを理解する",
  "6-Axis Industrial Robot": "6軸産業用ロボット",
  "High-precision 6-axis industrial robot with advanced servo drives and absolute encoders. Features adaptive gripping technology, vision-guided positioning, and intelligent path planning for optimal material handling. The robot's high payload capacity and extended reach enable handling of large sheets and complex part geometries.": "先進のサーボドライブとアブソリュートエンコーダを搭載した高精度6軸産業用ロボット。",
  "AI-Powered Control System": "AIを活用した制御システム",
  "Advanced artificial intelligence control system with adaptive bending algorithms, real-time angle measurement, and automatic springback compensation. The system continuously learns and optimizes bending parameters based on material characteristics and historical data, ensuring perfect bends every time.": "適応曲げアルゴリズム、リアルタイム角度測定、自動スプリングバック補償を備えた高度な人工知能制御システム。",
  "3D Vision & Positioning System": "3D ビジョンおよび測位システム",
  "High-resolution 3D vision system with advanced image processing for precise part recognition, orientation detection, and quality inspection. The system guides the robot for accurate part pickup and positioning, while simultaneously performing in-process quality checks for bend angles and dimensions.": "高度な画像処理を備えた高解像度 3D ビジョン システムにより、正確な部品認識、方向検出、品質検査が可能です。",
  "Automatic Tool Change System": "自動工具交換システム",
  "Fully automated tool changing system with intelligent tool magazine that stores multiple punch and die sets. The system automatically selects and changes tools based on programmed bending sequences, eliminating manual setup time and enabling rapid transition between different part programs.": "複数のパンチとダイセットを保管するインテリジェントツールマガジンを備えた完全自動工具交換システム。",
  "Watch Our Robotic System in Action": "当社のロボット システムの動作をご覧ください",
  "See the power of fully automated bending with our integrated robotic press brake system": "当社の統合ロボットプレスブレーキシステムによる完全自動曲げの威力をご覧ください。",
  "Applications": "アプリケーション",
  "Our robotic press brakes excel in high-volume production environments requiring consistent quality and minimal human intervention": "当社のロボットプレスブレーキは、一貫した品質と最小限の人的介入を必要とする大量生産環境に優れています。",
  "High-Volume Production": "大量生産",
  "Automated mass production of standardized parts with consistent quality": "安定した品質の標準化された部品の自動大量生産",
  "Automotive Manufacturing": "自動車製造",
  "Precision parts for vehicle chassis, frames, and structural components": "自動車のシャーシ、フレーム、構造部品などの精密部品",
  "Appliance Industry": "家電産業",
  "Automated production of appliance enclosures, panels, and components": "アプライアンスのエンクロージャ、パネル、コンポーネントの自動生産",
  "Electronics Manufacturing": "電子機器製造",
  "Server racks, IT equipment chassis, and electronic enclosures": "サーバーラック、IT機器シャーシ、電子エンクロージャ",
  "Smart Factories": "スマートファクトリー",
  "Industry 4.0 facilities requiring full automation and data integration": "完全自動化とデータ統合を必要とするインダストリー 4.0 施設",
  "Lights-Out Manufacturing": "消灯製造",
  "Unmanned night shift operations and weekend production runs": "無人夜勤業務と週末の生産稼働",
  "Precision Sheet Metal": "精密板金",
  "Complex multi-bend parts requiring consistent accuracy": "一貫した精度が必要な複雑なマルチベンド部品",
  "Contract Manufacturing": "受託製造",
  "Job shops requiring rapid changeover and flexible automation": "迅速な切り替えと柔軟な自動化が必要なジョブショップ",
  "Standard & Optional Configuration": "標準およびオプションの構成",
  "Customize your robotic press brake with standard features and optional upgrades for maximum automation capability": "標準機能とオプションのアップグレードでロボット プレス ブレーキをカスタマイズし、自動化機能を最大限に高めます",
  "Standard Configuration": "標準構成",
  "Optional Upgrades": "オプションのアップグレード",
  "Need help designing your automated bending cell?": "自動曲げセルの設計に関するサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about our robotic press brake systems": "当社のロボットプレスブレーキシステムに関するよくある質問",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality, significantly increased productivity, reduced labor costs, enhanced safety by removing operators from hazardous zones, and the ability to automate complex multi-bend sequences.": "ロボットプレスブレーキには、年中無休の無人操作、安定した品質、生産性の大幅な向上、人件費の削減、オペレーターを危険区域から排除することによる安全性の向上、複雑な複数の曲げシーケンスを自動化する機能など、大きな利点があります。",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly without interrupting production. The AI system also learns from each bending operation to optimize future programs automatically.": "当社の高度なオフライン プログラミング ソフトウェアと 3D シミュレーションを使用すると、生産を中断することなく新しい部品を迅速にプログラムできます。",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part complexity, and current labor costs.": "ほとんどのお客様は、労働力の節約、生産性の向上、スクラップ率の削減、無人シフトの実行機能によって ROI がすぐに得られることを実感しています。",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide comprehensive training for operators and programmers. Most operators become proficient with basic operations within a short training period.": "当社のシステムは、最小限のロボット工学の知識を必要とする直感的なインターフェイスを備えています。",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts bending parameters for different materials including steel, stainless steel, and aluminum.": "はい、当社のロボット システムは柔軟性が高く、幅広いシート サイズや素材を処理できます。",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press brake maintenance. We provide remote diagnostics and support.": "このシステムには、問題が発生する前に警告を発する予知メンテナンス機能が含まれています。",
  "Still have questions about automation?": "自動化についてまだ質問がありますか?",
  "Download Automation Brochure": "自動化のパンフレットをダウンロード",
  "Get detailed technical specifications, automation capabilities, ROI calculations, and case studies for our robotic press brake systems. Download our comprehensive automation guide in PDF format.": "当社のロボットプレスブレーキシステムの詳細な技術仕様、自動化機能、ROI 計算、およびケーススタディをご覧ください。"
}