{
  "Robotic Press Brake": "Роботизированный листогибочный пресс",
  "Experience the future of metal forming with our fully automated robotic press brake system. Combining advanced robotics, AI-powered controls, and precision bending technology to deliver unmatched productivity, consistency, and operator safety in automated manufacturing environments.": "Откройте для себя будущее обработки металлов давлением с нашей полностью автоматизированной роботизированной системой листогибочного пресса. ",
  "Request Quote": "Запросить цену",
  "Watch Video": "Посмотреть видео",
  "Technical Specifications": "Технические характеристики",
  "Advanced robotic press brake with intelligent automation and precision control": "Усовершенствованный роботизированный листогибочный пресс с интеллектуальной автоматизацией и точным управлением.",
  "Press Brake Capacity": "Производительность листогибочного тормоза",
  "Multiple tonnage options available": "Доступны различные варианты тоннажа",
  "Customizable table length": "Настраиваемая длина стола",
  "Adjustable stroke range": "Регулируемый диапазон хода",
  "Variable throat depth configurations": "Конфигурации с переменной глубиной горловины",
  "Robotic System": "Роботизированная система",
  "6-axis industrial robot": "6-осевой промышленный робот",
  "High payload capacity": "Высокая грузоподъемность",
  "Extended reach capability": "Возможность расширенного охвата",
  "High precision repeatability": "Высокая точность повторяемости",
  "Automation Features": "Возможности автоматизации",
  "AI adaptive bending control": "Адаптивное управление гибкой с помощью искусственного интеллекта",
  "Automatic tool change system": "Автоматическая система смены инструмента",
  "Vision-guided positioning": "Позиционирование под контролем зрения",
  "24/7 unmanned operation": "Беспилотная работа 24/7",
  "Why Choose Our Robotic Press Brake?": "Почему стоит выбрать наш роботизированный листогибочный пресс?",
  "Discover the revolutionary advantages of fully automated robotic bending for modern manufacturing": "Откройте для себя революционные преимущества полностью автоматизированной роботизированной гибки для современного производства.",
  "Full Automation": "Полная автоматизация",
  "Eliminate manual material handling with fully automated robotic loading, bending, and unloading operations": "Устраните ручную обработку материалов благодаря полностью автоматизированным роботизированным операциям по загрузке, гибке и разгрузке.",
  "Extreme Precision": "Экстремальная точность",
  "AI-powered adaptive control with real-time angle monitoring ensures consistent quality every bend": "Адаптивное управление на базе искусственного интеллекта с контролем угла в реальном времени обеспечивает стабильное качество на каждом изгибе.",
  "Higher Productivity": "Более высокая производительность",
  "Significantly increase output with continuous 24/7 operation and reduced cycle times": "Значительное увеличение производительности за счет непрерывной работы в режиме 24/7 и сокращения времени цикла.",
  "Smart Integration": "Умная интеграция",
  "Seamlessly integrate with ERP, MES, and Industry 4.0 systems for complete production visibility": "Полная интеграция с системами ERP, MES и Индустрией 4.0 для полной прозрачности производства.",
  "Enhanced Safety": "Повышенная безопасность",
  "Remove operators from hazardous zones with comprehensive safety fencing and collision detection": "Удалите операторов из опасных зон с помощью комплексного защитного ограждения и обнаружения столкновений.",
  "Reduced Labor Costs": "Снижение затрат на рабочую силу",
  "Minimize labor requirements and reduce operational costs with lights-out manufacturing capability": "Минимизация трудозатрат и снижение эксплуатационных расходов благодаря возможности производства без освещения",
  "Components": "Компоненты",
  "Understand the advanced components that make our robotic press brake the most sophisticated automated bending solution": "Познакомьтесь с передовыми компонентами, которые делают наш роботизированный листогибочный пресс самым сложным решением для автоматизированной гибки.",
  "6-Axis Industrial Robot": "6-осевой промышленный робот",
  "High-precision 6-axis industrial robot with advanced servo drives and absolute encoders. Features adaptive gripping technology, vision-guided positioning, and intelligent path planning for optimal material handling. The robot's high payload capacity and extended reach enable handling of large sheets and complex part geometries.": "Высокоточный 6-осевой промышленный робот с усовершенствованными сервоприводами и абсолютными энкодерами. ",
  "AI-Powered Control System": "Система управления на основе искусственного интеллекта",
  "Advanced artificial intelligence control system with adaptive bending algorithms, real-time angle measurement, and automatic springback compensation. The system continuously learns and optimizes bending parameters based on material characteristics and historical data, ensuring perfect bends every time.": "Усовершенствованная система управления искусственным интеллектом с адаптивными алгоритмами изгиба, измерением угла в реальном времени и автоматической компенсацией пружинения. ",
  "3D Vision & Positioning System": "Система 3D-видения и позиционирования",
  "High-resolution 3D vision system with advanced image processing for precise part recognition, orientation detection, and quality inspection. The system guides the robot for accurate part pickup and positioning, while simultaneously performing in-process quality checks for bend angles and dimensions.": "Система 3D-видения высокого разрешения с расширенной обработкой изображений для точного распознавания деталей, определения ориентации и контроля качества. ",
  "Automatic Tool Change System": "Автоматическая система смены инструмента",
  "Fully automated tool changing system with intelligent tool magazine that stores multiple punch and die sets. The system automatically selects and changes tools based on programmed bending sequences, eliminating manual setup time and enabling rapid transition between different part programs.": "Полностью автоматизированная система смены инструмента с интеллектуальным магазином инструментов, в котором хранятся несколько наборов пуансонов и матриц. ",
  "Watch Our Robotic System in Action": "Посмотрите нашу роботизированную систему в действии",
  "See the power of fully automated bending with our integrated robotic press brake system": "Оцените возможности полностью автоматизированной гибки с помощью нашей интегрированной роботизированной системы гибочного пресса.",
  "Applications": "Приложения",
  "Our robotic press brakes excel in high-volume production environments requiring consistent quality and minimal human intervention": "Наши роботизированные листогибочные прессы отлично подходят для крупносерийного производства, требующего стабильного качества и минимального вмешательства человека.",
  "High-Volume Production": "Крупносерийное производство",
  "Automated mass production of standardized parts with consistent quality": "Автоматизированное массовое производство стандартизированных деталей стабильного качества.",
  "Automotive Manufacturing": "Автомобильное производство",
  "Precision parts for vehicle chassis, frames, and structural components": "Прецизионные детали для шасси, рам и конструктивных элементов автомобилей.",
  "Appliance Industry": "Приборная промышленность",
  "Automated production of appliance enclosures, panels, and components": "Автоматизированное производство корпусов, панелей и компонентов бытовой техники",
  "Electronics Manufacturing": "Производство электроники",
  "Server racks, IT equipment chassis, and electronic enclosures": "Серверные стойки, шасси для ИТ-оборудования и электронные корпуса",
  "Smart Factories": "Умные Фабрики",
  "Industry 4.0 facilities requiring full automation and data integration": "Объекты Индустрии 4.0, требующие полной автоматизации и интеграции данных",
  "Lights-Out Manufacturing": "Производство без освещения",
  "Unmanned night shift operations and weekend production runs": "Беспилотные ночные смены и производство по выходным",
  "Precision Sheet Metal": "Прецизионный листовой металл",
  "Complex multi-bend parts requiring consistent accuracy": "Сложные детали с множеством изгибов, требующие постоянной точности",
  "Contract Manufacturing": "Контрактное производство",
  "Job shops requiring rapid changeover and flexible automation": "Мастерские, требующие быстрой переналадки и гибкой автоматизации",
  "Standard & Optional Configuration": "Стандартная и дополнительная конфигурация",
  "Customize your robotic press brake with standard features and optional upgrades for maximum automation capability": "Настройте свой роботизированный листогибочный пресс с помощью стандартных функций и дополнительных обновлений для максимальной автоматизации.",
  "Standard Configuration": "Стандартная конфигурация",
  "Optional Upgrades": "Дополнительные обновления",
  "Need help designing your automated bending cell?": "Нужна помощь в проектировании автоматизированной гибочной линии?",
  "Frequently Asked Questions": "Часто задаваемые вопросы",
  "Common questions about our robotic press brake systems": "Распространенные вопросы о наших роботизированных листогибочных тормозных системах",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality, significantly increased productivity, reduced labor costs, enhanced safety by removing operators from hazardous zones, and the ability to automate complex multi-bend sequences.": "Роботизированные листогибочные прессы обладают значительными преимуществами, включая круглосуточную работу без участия человека, стабильное качество, значительное повышение производительности, снижение затрат на рабочую силу, повышение безопасности за счет удаления операторов из опасных зон и возможность автоматизации сложных последовательностей с несколькими изгибами.",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly without interrupting production. The AI system also learns from each bending operation to optimize future programs automatically.": "Благодаря нашему передовому программному обеспечению для автономного программирования и 3D-моделированию новые детали можно программировать быстро, не останавливая производство. ",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part complexity, and current labor costs.": "Большинство клиентов быстро видят окупаемость инвестиций за счет экономии трудозатрат, повышения производительности, снижения процента брака и возможности работать в беспилотные смены. ",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide comprehensive training for operators and programmers. Most operators become proficient with basic operations within a short training period.": "Наша система имеет интуитивно понятный интерфейс, требующий минимальных знаний в области робототехники. ",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts bending parameters for different materials including steel, stainless steel, and aluminum.": "Да, наша роботизированная система отличается высокой гибкостью и может обрабатывать листы самых разных размеров и материалов. ",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press brake maintenance. We provide remote diagnostics and support.": "Система включает возможности профилактического обслуживания, которые предупреждают вас о возникновении проблем. ",
  "Still have questions about automation?": "Остались вопросы по автоматизации?",
  "Download Automation Brochure": "Загрузить брошюру по автоматизации",
  "Get detailed technical specifications, automation capabilities, ROI calculations, and case studies for our robotic press brake systems. Download our comprehensive automation guide in PDF format.": "Получите подробные технические характеристики, возможности автоматизации, расчеты рентабельности инвестиций и практические примеры наших роботизированных листогибочных систем. "
}