{
  "Robotic Press Brake": "Prensa plegadora robótica",
  "Experience the future of metal forming with our fully automated robotic press brake system. Combining advanced robotics, AI-powered controls, and precision bending technology to deliver unmatched productivity, consistency, and operator safety in automated manufacturing environments.": "Experimente el futuro del conformado de metales con nuestro sistema de prensa plegadora robótica totalmente automatizada. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "Advanced robotic press brake with intelligent automation and precision control": "Prensa plegadora robótica avanzada con automatización inteligente y control de precisión",
  "Press Brake Capacity": "Capacidad de plegadora",
  "Multiple tonnage options available": "Múltiples opciones de tonelaje disponibles",
  "Customizable table length": "Longitud de mesa personalizable",
  "Adjustable stroke range": "Rango de carrera ajustable",
  "Variable throat depth configurations": "Configuraciones de profundidad de garganta variable",
  "Robotic System": "Sistema Robótico",
  "6-axis industrial robot": "robot industrial de 6 ejes",
  "High payload capacity": "Alta capacidad de carga útil",
  "Extended reach capability": "Capacidad de alcance extendido",
  "High precision repeatability": "Repetibilidad de alta precisión",
  "Automation Features": "Funciones de automatización",
  "AI adaptive bending control": "Control de flexión adaptativo por IA",
  "Automatic tool change system": "Sistema de cambio automático de herramientas.",
  "Vision-guided positioning": "Posicionamiento guiado por visión",
  "24/7 unmanned operation": "Operación no tripulada 24 horas al día, 7 días a la semana",
  "Why Choose Our Robotic Press Brake?": "¿Por qué elegir nuestra plegadora robótica?",
  "Discover the revolutionary advantages of fully automated robotic bending for modern manufacturing": "Descubra las ventajas revolucionarias del doblado robótico totalmente automatizado para la fabricación moderna",
  "Full Automation": "Automatización completa",
  "Eliminate manual material handling with fully automated robotic loading, bending, and unloading operations": "Elimine la manipulación manual de materiales con operaciones robóticas de carga, doblado y descarga totalmente automatizadas.",
  "Extreme Precision": "Precisión extrema",
  "AI-powered adaptive control with real-time angle monitoring ensures consistent quality every bend": "El control adaptativo impulsado por IA con monitoreo de ángulo en tiempo real garantiza una calidad constante en cada curva",
  "Higher Productivity": "Mayor productividad",
  "Significantly increase output with continuous 24/7 operation and reduced cycle times": "Aumente significativamente la producción con un funcionamiento continuo las 24 horas del día, los 7 días de la semana y tiempos de ciclo reducidos",
  "Smart Integration": "Integración inteligente",
  "Seamlessly integrate with ERP, MES, and Industry 4.0 systems for complete production visibility": "Integre perfectamente con los sistemas ERP, MES e Industria 4.0 para una visibilidad completa de la producción",
  "Enhanced Safety": "Seguridad mejorada",
  "Remove operators from hazardous zones with comprehensive safety fencing and collision detection": "Retire a los operadores de zonas peligrosas con vallas de seguridad integrales y detección de colisiones",
  "Reduced Labor Costs": "Costos laborales reducidos",
  "Minimize labor requirements and reduce operational costs with lights-out manufacturing capability": "Minimice los requisitos de mano de obra y reduzca los costos operativos con una capacidad de fabricación sin interrupciones",
  "Components": "Componentes",
  "Understand the advanced components that make our robotic press brake the most sophisticated automated bending solution": "Comprenda los componentes avanzados que hacen de nuestra plegadora robótica la solución de plegado automatizado más sofisticada",
  "6-Axis Industrial Robot": "Robot industrial de 6 ejes",
  "High-precision 6-axis industrial robot with advanced servo drives and absolute encoders. Features adaptive gripping technology, vision-guided positioning, and intelligent path planning for optimal material handling. The robot's high payload capacity and extended reach enable handling of large sheets and complex part geometries.": "Robot industrial de 6 ejes de alta precisión con servoaccionamientos avanzados y codificadores absolutos. ",
  "AI-Powered Control System": "Sistema de control impulsado por IA",
  "Advanced artificial intelligence control system with adaptive bending algorithms, real-time angle measurement, and automatic springback compensation. The system continuously learns and optimizes bending parameters based on material characteristics and historical data, ensuring perfect bends every time.": "Sistema avanzado de control de inteligencia artificial con algoritmos de flexión adaptativos, medición de ángulos en tiempo real y compensación automática de recuperación elástica. ",
  "3D Vision & Positioning System": "Sistema de posicionamiento y visión 3D",
  "High-resolution 3D vision system with advanced image processing for precise part recognition, orientation detection, and quality inspection. The system guides the robot for accurate part pickup and positioning, while simultaneously performing in-process quality checks for bend angles and dimensions.": "Sistema de visión 3D de alta resolución con procesamiento de imágenes avanzado para un reconocimiento preciso de piezas, detección de orientación e inspección de calidad. ",
  "Automatic Tool Change System": "Sistema de cambio automático de herramientas",
  "Fully automated tool changing system with intelligent tool magazine that stores multiple punch and die sets. The system automatically selects and changes tools based on programmed bending sequences, eliminating manual setup time and enabling rapid transition between different part programs.": "Sistema de cambio de herramientas totalmente automatizado con almacén de herramientas inteligente que almacena múltiples juegos de punzones y matrices. ",
  "Watch Our Robotic System in Action": "Vea nuestro sistema robótico en acción",
  "See the power of fully automated bending with our integrated robotic press brake system": "Vea el poder del plegado totalmente automatizado con nuestro sistema de plegadora robótica integrada",
  "Applications": "Aplicaciones",
  "Our robotic press brakes excel in high-volume production environments requiring consistent quality and minimal human intervention": "Nuestras plegadoras robóticas destacan en entornos de producción de gran volumen que requieren una calidad constante y una mínima intervención humana.",
  "High-Volume Production": "Producción de alto volumen",
  "Automated mass production of standardized parts with consistent quality": "Producción en masa automatizada de piezas estandarizadas con calidad constante",
  "Automotive Manufacturing": "Fabricación de automóviles",
  "Precision parts for vehicle chassis, frames, and structural components": "Piezas de precisión para chasis, bastidores y componentes estructurales de vehículos.",
  "Appliance Industry": "Industria de electrodomésticos",
  "Automated production of appliance enclosures, panels, and components": "Producción automatizada de carcasas, paneles y componentes de electrodomésticos.",
  "Electronics Manufacturing": "Fabricación de productos electrónicos",
  "Server racks, IT equipment chassis, and electronic enclosures": "Racks de servidores, chasis de equipos de TI y gabinetes electrónicos",
  "Smart Factories": "Fábricas inteligentes",
  "Industry 4.0 facilities requiring full automation and data integration": "Instalaciones de la Industria 4.0 que requieren total automatización e integración de datos",
  "Lights-Out Manufacturing": "Fabricación sin luces",
  "Unmanned night shift operations and weekend production runs": "Operaciones no tripuladas en turnos nocturnos y ciclos de producción de fin de semana",
  "Precision Sheet Metal": "Chapa de precisión",
  "Complex multi-bend parts requiring consistent accuracy": "Piezas complejas de múltiples curvaturas que requieren una precisión constante",
  "Contract Manufacturing": "Fabricación por contrato",
  "Job shops requiring rapid changeover and flexible automation": "Talleres de trabajo que requieren cambios rápidos y automatización flexible",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your robotic press brake with standard features and optional upgrades for maximum automation capability": "Personalice su plegadora robótica con características estándar y actualizaciones opcionales para una máxima capacidad de automatización",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help designing your automated bending cell?": "¿Necesita ayuda para diseñar su celda de plegado automatizada?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our robotic press brake systems": "Preguntas comunes sobre nuestros sistemas de plegadoras robóticas",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality, significantly increased productivity, reduced labor costs, enhanced safety by removing operators from hazardous zones, and the ability to automate complex multi-bend sequences.": "Las plegadoras robóticas ofrecen ventajas significativas que incluyen operación no tripulada las 24 horas del día, los 7 días de la semana, calidad constante, productividad significativamente mayor, costos de mano de obra reducidos, mayor seguridad al retirar a los operadores de zonas peligrosas y la capacidad de automatizar secuencias complejas de múltiples plegados.",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly without interrupting production. The AI system also learns from each bending operation to optimize future programs automatically.": "Con nuestro avanzado software de programación fuera de línea y simulación 3D, se pueden programar piezas nuevas rápidamente sin interrumpir la producción. ",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part complexity, and current labor costs.": "La mayoría de los clientes obtienen un retorno de la inversión rápidamente gracias al ahorro de mano de obra, el aumento de la productividad, la reducción de las tasas de desperdicio y la capacidad de ejecutar turnos sin personal. ",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide comprehensive training for operators and programmers. Most operators become proficient with basic operations within a short training period.": "Nuestro sistema presenta una interfaz intuitiva que requiere conocimientos mínimos de robótica. ",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts bending parameters for different materials including steel, stainless steel, and aluminum.": "Sí, nuestro sistema robótico es muy flexible y puede manejar una amplia gama de tamaños y materiales de hojas. ",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press brake maintenance. We provide remote diagnostics and support.": "El sistema incluye capacidades de mantenimiento predictivo que le alertan antes de que ocurran problemas. ",
  "Still have questions about automation?": "¿Aún tienes preguntas sobre la automatización?",
  "Download Automation Brochure": "Descargar el folleto de automatización",
  "Get detailed technical specifications, automation capabilities, ROI calculations, and case studies for our robotic press brake systems. Download our comprehensive automation guide in PDF format.": "Obtenga especificaciones técnicas detalladas, capacidades de automatización, cálculos de retorno de la inversión y estudios de casos para nuestros sistemas de plegadoras robóticas. "
}