{
  "Robotic Press Brake": "Presse plieuse robotisée",
  "Experience the future of metal forming with our fully automated robotic press brake system. Combining advanced robotics, AI-powered controls, and precision bending technology to deliver unmatched productivity, consistency, and operator safety in automated manufacturing environments.": "Découvrez l’avenir du formage des métaux avec notre système de presse plieuse robotisée entièrement automatisé. ",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "Advanced robotic press brake with intelligent automation and precision control": "Presse plieuse robotisée avancée avec automatisation intelligente et contrôle de précision",
  "Press Brake Capacity": "Capacité de la presse plieuse",
  "Multiple tonnage options available": "Plusieurs options de tonnage disponibles",
  "Customizable table length": "Longueur de table personnalisable",
  "Adjustable stroke range": "Plage de course réglable",
  "Variable throat depth configurations": "Configurations à profondeur de gorge variable",
  "Robotic System": "Système robotique",
  "6-axis industrial robot": "Robot industriel 6 axes",
  "High payload capacity": "Capacité de charge utile élevée",
  "Extended reach capability": "Capacité de portée étendue",
  "High precision repeatability": "Répétabilité de haute précision",
  "Automation Features": "Fonctionnalités d'automatisation",
  "AI adaptive bending control": "Contrôle de pliage adaptatif IA",
  "Automatic tool change system": "Système de changement d'outil automatique",
  "Vision-guided positioning": "Positionnement guidé par la vision",
  "24/7 unmanned operation": "Fonctionnement sans personnel 24h/24 et 7j/7",
  "Why Choose Our Robotic Press Brake?": "Pourquoi choisir notre presse plieuse robotisée ?",
  "Discover the revolutionary advantages of fully automated robotic bending for modern manufacturing": "Découvrez les avantages révolutionnaires du pliage robotisé entièrement automatisé pour la fabrication moderne",
  "Full Automation": "Automatisation complète",
  "Eliminate manual material handling with fully automated robotic loading, bending, and unloading operations": "Éliminez la manutention manuelle des matériaux grâce à des opérations robotisées de chargement, de pliage et de déchargement entièrement automatisées.",
  "Extreme Precision": "Précision extrême",
  "AI-powered adaptive control with real-time angle monitoring ensures consistent quality every bend": "Le contrôle adaptatif alimenté par l'IA avec surveillance de l'angle en temps réel garantit une qualité constante à chaque virage",
  "Higher Productivity": "Productivité supérieure",
  "Significantly increase output with continuous 24/7 operation and reduced cycle times": "Augmentez considérablement le rendement grâce à un fonctionnement continu 24h/24 et 7j/7 et des temps de cycle réduits",
  "Smart Integration": "Intégration intelligente",
  "Seamlessly integrate with ERP, MES, and Industry 4.0 systems for complete production visibility": "Intégration transparente aux systèmes ERP, MES et Industry 4.0 pour une visibilité complète de la production",
  "Enhanced Safety": "Sécurité améliorée",
  "Remove operators from hazardous zones with comprehensive safety fencing and collision detection": "Éloignez les opérateurs des zones dangereuses grâce à une clôture de sécurité complète et à la détection des collisions",
  "Reduced Labor Costs": "Coûts de main-d'œuvre réduits",
  "Minimize labor requirements and reduce operational costs with lights-out manufacturing capability": "Minimisez les besoins en main-d'œuvre et réduisez les coûts opérationnels grâce à une capacité de fabrication sans éclairage",
  "Components": "Composants",
  "Understand the advanced components that make our robotic press brake the most sophisticated automated bending solution": "Comprendre les composants avancés qui font de notre presse plieuse robotisée la solution de pliage automatisée la plus sophistiquée",
  "6-Axis Industrial Robot": "Robot industriel 6 axes",
  "High-precision 6-axis industrial robot with advanced servo drives and absolute encoders. Features adaptive gripping technology, vision-guided positioning, and intelligent path planning for optimal material handling. The robot's high payload capacity and extended reach enable handling of large sheets and complex part geometries.": "Robot industriel 6 axes de haute précision avec servomoteurs avancés et encodeurs absolus. ",
  "AI-Powered Control System": "Système de contrôle alimenté par l'IA",
  "Advanced artificial intelligence control system with adaptive bending algorithms, real-time angle measurement, and automatic springback compensation. The system continuously learns and optimizes bending parameters based on material characteristics and historical data, ensuring perfect bends every time.": "Système de contrôle d'intelligence artificielle avancé avec algorithmes de flexion adaptatifs, mesure d'angle en temps réel et compensation automatique du retour élastique. ",
  "3D Vision & Positioning System": "Système de vision et de positionnement 3D",
  "High-resolution 3D vision system with advanced image processing for precise part recognition, orientation detection, and quality inspection. The system guides the robot for accurate part pickup and positioning, while simultaneously performing in-process quality checks for bend angles and dimensions.": "Système de vision 3D haute résolution avec traitement d'image avancé pour une reconnaissance précise des pièces, une détection de l'orientation et une inspection de la qualité. ",
  "Automatic Tool Change System": "Système de changement d'outil automatique",
  "Fully automated tool changing system with intelligent tool magazine that stores multiple punch and die sets. The system automatically selects and changes tools based on programmed bending sequences, eliminating manual setup time and enabling rapid transition between different part programs.": "Système de changement d'outils entièrement automatisé avec magasin d'outils intelligent qui stocke plusieurs jeux de poinçons et de matrices. ",
  "Watch Our Robotic System in Action": "Regardez notre système robotique en action",
  "See the power of fully automated bending with our integrated robotic press brake system": "Découvrez la puissance du pliage entièrement automatisé avec notre système de presse plieuse robotique intégré",
  "Applications": "Applications",
  "Our robotic press brakes excel in high-volume production environments requiring consistent quality and minimal human intervention": "Nos presses plieuses robotisées excellent dans les environnements de production à grand volume nécessitant une qualité constante et une intervention humaine minimale.",
  "High-Volume Production": "Production en grand volume",
  "Automated mass production of standardized parts with consistent quality": "Production de masse automatisée de pièces standardisées avec une qualité constante",
  "Automotive Manufacturing": "Fabrication automobile",
  "Precision parts for vehicle chassis, frames, and structural components": "Pièces de précision pour châssis, cadres et composants structurels de véhicules",
  "Appliance Industry": "Industrie de l'électroménager",
  "Automated production of appliance enclosures, panels, and components": "Production automatisée de boîtiers, de panneaux et de composants d'appareils",
  "Electronics Manufacturing": "Fabrication d'électronique",
  "Server racks, IT equipment chassis, and electronic enclosures": "Racks de serveurs, châssis d'équipement informatique et boîtiers électroniques",
  "Smart Factories": "Usines intelligentes",
  "Industry 4.0 facilities requiring full automation and data integration": "Installations de l'industrie 4.0 nécessitant une automatisation complète et une intégration des données",
  "Lights-Out Manufacturing": "Fabrication sans éclairage",
  "Unmanned night shift operations and weekend production runs": "Opérations de nuit sans personnel et cycles de production le week-end",
  "Precision Sheet Metal": "Tôle de précision",
  "Complex multi-bend parts requiring consistent accuracy": "Pièces complexes multi-pliages nécessitant une précision constante",
  "Contract Manufacturing": "Fabrication sous contrat",
  "Job shops requiring rapid changeover and flexible automation": "Ateliers nécessitant un changement rapide et une automatisation flexible",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Customize your robotic press brake with standard features and optional upgrades for maximum automation capability": "Personnalisez votre presse plieuse robotisée avec des fonctionnalités standard et des mises à niveau facultatives pour une capacité d'automatisation maximale",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need help designing your automated bending cell?": "Besoin d'aide pour concevoir votre cellule de pliage automatisée ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our robotic press brake systems": "Questions courantes sur nos systèmes de presses plieuses robotisées",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality, significantly increased productivity, reduced labor costs, enhanced safety by removing operators from hazardous zones, and the ability to automate complex multi-bend sequences.": "Les presses plieuses robotisées offrent des avantages significatifs, notamment un fonctionnement sans personnel 24h/24 et 7j/7, une qualité constante, une productivité considérablement accrue, des coûts de main-d'œuvre réduits, une sécurité améliorée en éloignant les opérateurs des zones dangereuses et la possibilité d'automatiser des séquences complexes à plusieurs plis.",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly without interrupting production. The AI system also learns from each bending operation to optimize future programs automatically.": "Grâce à notre logiciel avancé de programmation hors ligne et à notre simulation 3D, de nouvelles pièces peuvent être programmées rapidement sans interrompre la production. ",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part complexity, and current labor costs.": "La plupart des clients constatent rapidement un retour sur investissement grâce aux économies de main d'œuvre, à une productivité accrue, à des taux de rebut réduits et à la possibilité d'effectuer des équipes sans personnel. ",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide comprehensive training for operators and programmers. Most operators become proficient with basic operations within a short training period.": "Notre système dispose d'une interface intuitive qui nécessite des connaissances minimales en robotique. ",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts bending parameters for different materials including steel, stainless steel, and aluminum.": "Oui, notre système robotique est très flexible et peut gérer une large gamme de tailles de feuilles et de matériaux. ",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press brake maintenance. We provide remote diagnostics and support.": "Le système comprend des fonctionnalités de maintenance prédictive qui vous alertent avant que des problèmes ne surviennent. ",
  "Still have questions about automation?": "Vous avez encore des questions sur l'automatisation ?",
  "Download Automation Brochure": "Télécharger la brochure sur l'automatisation",
  "Get detailed technical specifications, automation capabilities, ROI calculations, and case studies for our robotic press brake systems. Download our comprehensive automation guide in PDF format.": "Obtenez des spécifications techniques détaillées, des capacités d'automatisation, des calculs de retour sur investissement et des études de cas pour nos systèmes de presses plieuses robotisées. "
}