{
  "Robotic Press Brake": "Roboter-Abkantpresse",
  "Experience the future of metal forming with our fully automated robotic press brake system. Combining advanced robotics, AI-powered controls, and precision bending technology to deliver unmatched productivity, consistency, and operator safety in automated manufacturing environments.": "Erleben Sie die Zukunft der Metallumformung mit unserem vollautomatischen Roboter-Abkantsystem. ",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "Advanced robotic press brake with intelligent automation and precision control": "Fortschrittliche Roboter-Abkantpresse mit intelligenter Automatisierung und Präzisionssteuerung",
  "Press Brake Capacity": "Kapazität der Pressebremse",
  "Multiple tonnage options available": "Mehrere Tonnageoptionen verfügbar",
  "Customizable table length": "Anpassbare Tischlänge",
  "Adjustable stroke range": "Einstellbarer Hubbereich",
  "Variable throat depth configurations": "Konfigurationen mit variabler Ausladungstiefe",
  "Robotic System": "Robotersystem",
  "6-axis industrial robot": "6-Achsen-Industrieroboter",
  "High payload capacity": "Hohe Nutzlastkapazität",
  "Extended reach capability": "Erweiterte Reichweite",
  "High precision repeatability": "Hohe Wiederholgenauigkeit",
  "Automation Features": "Automatisierungsfunktionen",
  "AI adaptive bending control": "KI-adaptive Biegesteuerung",
  "Automatic tool change system": "Automatisches Werkzeugwechselsystem",
  "Vision-guided positioning": "Visiongesteuerte Positionierung",
  "24/7 unmanned operation": "Unbemannter Betrieb rund um die Uhr",
  "Why Choose Our Robotic Press Brake?": "Warum sollten Sie sich für unsere Roboter-Abkantpresse entscheiden?",
  "Discover the revolutionary advantages of fully automated robotic bending for modern manufacturing": "Entdecken Sie die revolutionären Vorteile des vollautomatischen Roboterbiegens für die moderne Fertigung",
  "Full Automation": "Vollständige Automatisierung",
  "Eliminate manual material handling with fully automated robotic loading, bending, and unloading operations": "Eliminieren Sie die manuelle Materialhandhabung durch vollautomatische Lade-, Biege- und Entladevorgänge durch Roboter",
  "Extreme Precision": "Extreme Präzision",
  "AI-powered adaptive control with real-time angle monitoring ensures consistent quality every bend": "Die KI-gestützte adaptive Steuerung mit Echtzeit-Winkelüberwachung sorgt für eine gleichbleibende Qualität in jeder Kurve",
  "Higher Productivity": "Höhere Produktivität",
  "Significantly increase output with continuous 24/7 operation and reduced cycle times": "Erhebliche Steigerung der Leistung durch kontinuierlichen 24/7-Betrieb und kürzere Zykluszeiten",
  "Smart Integration": "Intelligente Integration",
  "Seamlessly integrate with ERP, MES, and Industry 4.0 systems for complete production visibility": "Nahtlose Integration in ERP-, MES- und Industrie 4.0-Systeme für vollständige Produktionstransparenz",
  "Enhanced Safety": "Erhöhte Sicherheit",
  "Remove operators from hazardous zones with comprehensive safety fencing and collision detection": "Halten Sie Bediener mit umfassenden Sicherheitszäunen und Kollisionserkennung aus Gefahrenbereichen fern",
  "Reduced Labor Costs": "Reduzierte Arbeitskosten",
  "Minimize labor requirements and reduce operational costs with lights-out manufacturing capability": "Minimieren Sie den Arbeitsaufwand und senken Sie die Betriebskosten durch die Möglichkeit der „Lights-out“-Fertigung",
  "Components": "Komponenten",
  "Understand the advanced components that make our robotic press brake the most sophisticated automated bending solution": "Verstehen Sie die fortschrittlichen Komponenten, die unsere Roboter-Abkantpresse zur fortschrittlichsten automatisierten Biegelösung machen",
  "6-Axis Industrial Robot": "6-Achsen-Industrieroboter",
  "High-precision 6-axis industrial robot with advanced servo drives and absolute encoders. Features adaptive gripping technology, vision-guided positioning, and intelligent path planning for optimal material handling. The robot's high payload capacity and extended reach enable handling of large sheets and complex part geometries.": "Hochpräziser 6-Achsen-Industrieroboter mit fortschrittlichen Servoantrieben und Absolutwertgebern. ",
  "AI-Powered Control System": "KI-gestütztes Steuerungssystem",
  "Advanced artificial intelligence control system with adaptive bending algorithms, real-time angle measurement, and automatic springback compensation. The system continuously learns and optimizes bending parameters based on material characteristics and historical data, ensuring perfect bends every time.": "Fortschrittliches Steuerungssystem mit künstlicher Intelligenz mit adaptiven Biegealgorithmen, Echtzeit-Winkelmessung und automatischer Rückfederungskompensation. ",
  "3D Vision & Positioning System": "3D-Vision- und Positionierungssystem",
  "High-resolution 3D vision system with advanced image processing for precise part recognition, orientation detection, and quality inspection. The system guides the robot for accurate part pickup and positioning, while simultaneously performing in-process quality checks for bend angles and dimensions.": "Hochauflösendes 3D-Vision-System mit fortschrittlicher Bildverarbeitung für präzise Teileerkennung, Orientierungserkennung und Qualitätsprüfung. ",
  "Automatic Tool Change System": "Automatisches Werkzeugwechselsystem",
  "Fully automated tool changing system with intelligent tool magazine that stores multiple punch and die sets. The system automatically selects and changes tools based on programmed bending sequences, eliminating manual setup time and enabling rapid transition between different part programs.": "Vollautomatisches Werkzeugwechselsystem mit intelligentem Werkzeugmagazin, das mehrere Stempel- und Matrizensätze speichert. ",
  "Watch Our Robotic System in Action": "Sehen Sie sich unser Robotersystem in Aktion an",
  "See the power of fully automated bending with our integrated robotic press brake system": "Erleben Sie die Leistungsfähigkeit des vollautomatischen Biegens mit unserem integrierten Roboter-Abkantsystem",
  "Applications": "Anwendungen",
  "Our robotic press brakes excel in high-volume production environments requiring consistent quality and minimal human intervention": "Unsere Roboter-Abkantpressen eignen sich hervorragend für Produktionsumgebungen mit hohem Volumen, die eine gleichbleibende Qualität und minimale menschliche Eingriffe erfordern",
  "High-Volume Production": "Großserienproduktion",
  "Automated mass production of standardized parts with consistent quality": "Automatisierte Massenproduktion standardisierter Teile mit gleichbleibender Qualität",
  "Automotive Manufacturing": "Automobilbau",
  "Precision parts for vehicle chassis, frames, and structural components": "Präzisionsteile für Fahrzeugchassis, Rahmen und Strukturkomponenten",
  "Appliance Industry": "Haushaltsgeräteindustrie",
  "Automated production of appliance enclosures, panels, and components": "Automatisierte Produktion von Gerätegehäusen, Paneelen und Komponenten",
  "Electronics Manufacturing": "Elektronikfertigung",
  "Server racks, IT equipment chassis, and electronic enclosures": "Server-Racks, IT-Gerätegehäuse und Elektronikgehäuse",
  "Smart Factories": "Intelligente Fabriken",
  "Industry 4.0 facilities requiring full automation and data integration": "Industrie 4.0-Anlagen erfordern vollständige Automatisierung und Datenintegration",
  "Lights-Out Manufacturing": "Lights-Out-Fertigung",
  "Unmanned night shift operations and weekend production runs": "Unbemannter Nachtschichtbetrieb und Wochenendproduktion",
  "Precision Sheet Metal": "Präzisionsblech",
  "Complex multi-bend parts requiring consistent accuracy": "Komplexe Teile mit mehreren Biegungen, die eine gleichbleibende Genauigkeit erfordern",
  "Contract Manufacturing": "Auftragsfertigung",
  "Job shops requiring rapid changeover and flexible automation": "Lohnfertigungsbetriebe, die schnelle Umrüstung und flexible Automatisierung erfordern",
  "Standard & Optional Configuration": "Standard- und optionale Konfiguration",
  "Customize your robotic press brake with standard features and optional upgrades for maximum automation capability": "Passen Sie Ihre Roboter-Abkantpresse mit Standardfunktionen und optionalen Upgrades individuell an, um maximale Automatisierungsfähigkeit zu erreichen",
  "Standard Configuration": "Standardkonfiguration",
  "Optional Upgrades": "Optionale Upgrades",
  "Need help designing your automated bending cell?": "Benötigen Sie Hilfe bei der Gestaltung Ihrer automatisierten Biegezelle?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about our robotic press brake systems": "Häufige Fragen zu unseren Roboter-Abkantsystemen",
  "Robotic press brakes offer significant advantages including 24/7 unmanned operation, consistent quality, significantly increased productivity, reduced labor costs, enhanced safety by removing operators from hazardous zones, and the ability to automate complex multi-bend sequences.": "Roboter-Abkantpressen bieten erhebliche Vorteile, darunter mannlosen Betrieb rund um die Uhr, gleichbleibende Qualität, deutlich gesteigerte Produktivität, reduzierte Arbeitskosten, erhöhte Sicherheit durch die Entfernung von Bedienern aus Gefahrenzonen und die Möglichkeit, komplexe Mehrfachbiegeabläufe zu automatisieren.",
  "With our advanced offline programming software and 3D simulation, new parts can be programmed quickly without interrupting production. The AI system also learns from each bending operation to optimize future programs automatically.": "Mit unserer fortschrittlichen Offline-Programmiersoftware und 3D-Simulation können neue Teile schnell programmiert werden, ohne die Produktion zu unterbrechen. ",
  "Most customers see ROI quickly through labor savings, increased productivity, reduced scrap rates, and the ability to run unmanned shifts. The exact ROI depends on your production volume, part complexity, and current labor costs.": "Die meisten Kunden erzielen schnell einen ROI durch Arbeitseinsparungen, höhere Produktivität, geringere Ausschussraten und die Möglichkeit, mannlose Schichten zu betreiben. ",
  "Our system features an intuitive interface that requires minimal robotics knowledge. We provide comprehensive training for operators and programmers. Most operators become proficient with basic operations within a short training period.": "Unser System verfügt über eine intuitive Benutzeroberfläche, die nur minimale Robotikkenntnisse erfordert. ",
  "Yes, our robotic system is highly flexible and can handle a wide range of sheet sizes and materials. The adaptive gripper system automatically adjusts for different part geometries, and the AI control adapts bending parameters for different materials including steel, stainless steel, and aluminum.": "Ja, unser Robotersystem ist äußerst flexibel und kann ein breites Spektrum an Blechgrößen und Materialien verarbeiten. ",
  "The system includes predictive maintenance capabilities that alert you before issues occur. Routine maintenance is minimal - primarily gripper inspection, robot lubrication (automated), and standard press brake maintenance. We provide remote diagnostics and support.": "Das System verfügt über vorausschauende Wartungsfunktionen, die Sie warnen, bevor Probleme auftreten. ",
  "Still have questions about automation?": "Sie haben noch Fragen zur Automatisierung?",
  "Download Automation Brochure": "Laden Sie die Automatisierungsbroschüre herunter",
  "Get detailed technical specifications, automation capabilities, ROI calculations, and case studies for our robotic press brake systems. Download our comprehensive automation guide in PDF format.": "Erhalten Sie detaillierte technische Spezifikationen, Automatisierungsmöglichkeiten, ROI-Berechnungen und Fallstudien für unsere Roboter-Abkantpressensysteme. "
}