{
  "Tandem Press Brake System": "نظام الفرامل الصحافة جنبا إلى جنب",
  "Advanced dual press brake system for extra-long workpiece bending. Two synchronized CNC press brakes working in perfect coordination to handle oversized parts that exceed the capacity of single machines. Ideal for aerospace, shipbuilding, and large-scale fabrication projects.": "نظام مكابح ضغط مزدوج متطور لثني قطع العمل لفترة طويلة جدًا. ",
  "Request Quote": "طلب اقتباس",
  "Watch Video": "شاهد الفيديو",
  "Technical Specifications": "المواصفات الفنية",
  "Dual synchronized press brake system for extra-long workpiece bending applications": "نظام فرامل ضغط مزدوج متزامن لتطبيقات ثني قطع العمل الطويلة جدًا",
  "System Capacity": "سعة النظام",
  "Combined Force: High-capacity dual system": "القوة المشتركة: نظام مزدوج عالي السعة",
  "Working Length: Extra-long workpiece capability": "طول العمل: قدرة الشغل طويلة للغاية",
  "Stroke: Adjustable for various applications": "السكتة الدماغية: قابل للتعديل لمختلف التطبيقات",
  "Configuration: 2 x CNC Press Brakes": "التكوين: 2 × مكابح ضغط CNC",
  "Control System": "نظام التحكم",
  "Master-Slave CNC coordination": "التنسيق بين السيد والعبد باستخدام الحاسب الآلي",
  "High-precision synchronized positioning": "تحديد المواقع المتزامنة عالية الدقة",
  "Networked back gauge systems": "أنظمة القياس الخلفي المتصلة بالشبكة",
  "Real-time synchronization monitoring": "مراقبة التزامن في الوقت الحقيقي",
  "Features": "سمات",
  "Dual CNC controllers in sync": "وحدات تحكم CNC مزدوجة متزامنة",
  "Advanced communication protocol": "بروتوكول الاتصال المتقدم",
  "Programmable angle compensation": "تعويض زاوية قابل للبرمجة",
  "Integrated safety systems": "أنظمة أمان متكاملة",
  "Why Choose Tandem Press Brake System?": "لماذا تختار نظام الفرامل الضاغطة الترادفي؟",
  "Discover the unique advantages of our tandem press brake system for handling oversized workpieces": "اكتشف المزايا الفريدة لنظام مكابح الضغط الترادفي الخاص بنا للتعامل مع قطع العمل كبيرة الحجم",
  "Extreme Length Capacity": "سعة الطول القصوى",
  "Handle extra-long workpieces with synchronized dual-machine operation for applications beyond standard capacity": "يمكنك التعامل مع قطع العمل الطويلة جدًا من خلال التشغيل المتزامن للآلة المزدوجة للتطبيقات التي تتجاوز السعة القياسية",
  "Perfect Synchronization": "تزامن مثالي",
  "Advanced CNC coordination ensures both machines work in perfect harmony": "يضمن التنسيق المتقدم باستخدام الحاسب الآلي عمل كلا الجهازين في تناغم تام",
  "High Precision": "دقة عالية",
  "Maintains exceptional accuracy across the entire bending length for consistent quality": "يحافظ على دقة استثنائية عبر طول الانحناء بالكامل للحصول على جودة ثابتة",
  "Flexible Configuration": "تكوين مرن",
  "Can operate independently or synchronized based on workpiece requirements": "يمكن أن تعمل بشكل مستقل أو متزامن على أساس متطلبات قطعة العمل",
  "Combined Power": "القوة المشتركة",
  "Double the bending force for heavy-duty applications and thick materials": "مضاعفة قوة الانحناء للتطبيقات الثقيلة والمواد السميكة",
  "Enhanced Safety": "تعزيز السلامة",
  "Integrated safety systems with emergency stop coordination for operator protection": "أنظمة سلامة متكاملة مع تنسيق التوقف في حالات الطوارئ لحماية المشغل",
  "System Components": "مكونات النظام",
  "Understanding the advanced technology behind our tandem press brake synchronization system": "فهم التكنولوجيا المتقدمة وراء نظام مزامنة مكابح الضغط الترادفية",
  "Dual Machine Configuration": "تكوين الجهاز المزدوج",
  "Two high-precision CNC press brakes positioned in-line and connected through advanced communication systems. Each machine maintains its own structural integrity while working in perfect coordination with its partner, enabling the bending of workpieces up to 6 meters or longer.": "مكابح ضغط CNC عالية الدقة موضوعة في الخط ومتصلة من خلال أنظمة اتصالات متقدمة. ",
  "Master-Slave Control System": "نظام التحكم الرئيسي والعبد",
  "Advanced CNC coordination where one machine acts as the master controller, coordinating all movements with the slave machine. Real-time communication ensures microsecond-level synchronization, preventing any misalignment during the bending process. Both controllers can display the same program and status.": "تنسيق CNC متقدم حيث تعمل آلة واحدة كوحدة تحكم رئيسية، وتنسق جميع الحركات مع الآلة التابعة. ",
  "Synchronized Back Gauge System": "نظام قياس خلفي متزامن",
  "Multi-axis back gauge systems on both machines communicate and coordinate their positioning. Networked control ensures that both back gauges move to identical positions simultaneously, maintaining perfect workpiece alignment across the entire length. Features automatic error detection and correction.": "تعمل أنظمة القياس الخلفي متعددة المحاور على كلا الجهازين على التواصل وتنسيق مواقعها. ",
  "High-Speed Communication Network": "شبكة اتصالات عالية السرعة",
  "Dedicated high-speed network connection between the two machines enables real-time data exchange. Continuously monitors position, speed, force, and angle, making instant adjustments to maintain synchronization. Includes redundant communication paths for fail-safe operation.": "يتيح اتصال الشبكة المخصص عالي السرعة بين الجهازين إمكانية تبادل البيانات في الوقت الفعلي. ",
  "Coordinated Hydraulic System": "النظام الهيدروليكي المنسق",
  "Each machine has its own independent hydraulic system, but both are coordinated through the master control. Pressure and speed are synchronized to ensure uniform bending force distribution across the entire workpiece length. Advanced servo valves provide precise control and instant response.": "كل آلة لديها نظام هيدروليكي مستقل خاص بها، ولكن يتم تنسيق كليهما من خلال التحكم الرئيسي. ",
  "CNC Crowning System": "نظام التتويج باستخدام الحاسب الآلي",
  "Advanced CNC crowning compensation system automatically adjusts for beam deflection across the extended working length. The system calculates optimal crowning values based on material thickness, length, and bending force, ensuring consistent bend angles from end to end. With four cylinders working in coordination, the crowning system maintains perfect straightness even when processing extra-long workpieces, eliminating the common problem of center deflection.": "يتم ضبط نظام تعويض التتويج CNC المتقدم تلقائيًا لانحراف الشعاع عبر طول العمل الممتد. ",
  "See Tandem System in Action": "انظر النظام الترادفي أثناء العمل",
  "Watch how our synchronized tandem press brake system handles extra-long workpieces": "شاهد كيف يتعامل نظام مكابح الضغط الترادفي المتزامن مع قطع العمل الطويلة للغاية",
  "Applications": "التطبيقات",
  "Tandem press brake systems excel in industries requiring extra-long workpiece bending": "تتفوق أنظمة مكابح الضغط الترادفية في الصناعات التي تتطلب ثني قطع العمل لفترة طويلة جدًا",
  "Aerospace Industry": "صناعة الطيران",
  "Wing components, fuselage panels, and large structural parts requiring precise bending": "تتطلب مكونات الجناح وألواح جسم الطائرة والأجزاء الهيكلية الكبيرة ثنيًا دقيقًا",
  "Shipbuilding": "بناء السفن",
  "Hull plates, deck sections, and marine structural components": "ألواح الهيكل، وأقسام السطح، والمكونات الهيكلية البحرية",
  "Bridge Construction": "بناء الجسر",
  "Long steel beams, girders, and structural bridge elements": "العوارض الفولاذية الطويلة والعوارض وعناصر الجسور الإنشائية",
  "Wind Energy": "طاقة الرياح",
  "Wind tower sections and large-scale renewable energy components": "أقسام برج الرياح ومكونات الطاقة المتجددة واسعة النطاق",
  "Rail Transport": "النقل بالسكك الحديدية",
  "Train car bodies, chassis frames, and railway infrastructure": "أجسام سيارات القطارات وإطارات الشاسيه والبنية التحتية للسكك الحديدية",
  "Heavy Equipment": "المعدات الثقيلة",
  "Large machinery frames, excavator arms, and industrial equipment": "إطارات الآلات الكبيرة وأذرع الحفارات والمعدات الصناعية",
  "Architectural Metalwork": "الأعمال المعدنية المعمارية",
  "Large facade panels, canopies, and architectural steel elements": "ألواح الواجهة الكبيرة والمظلات والعناصر الفولاذية المعمارية",
  "Industrial Tanks": "الخزانات الصناعية",
  "Large storage tanks, pressure vessels, and container manufacturing": "صهاريج التخزين الكبيرة وأوعية الضغط وتصنيع الحاويات",
  "System Configuration": "تكوين النظام",
  "Comprehensive standard features and customization options for your tandem press brake system": "ميزات قياسية شاملة وخيارات تخصيص لنظام مكابح الضغط الترادفي لديك",
  "Standard Configuration": "التكوين القياسي",
  "Optional Upgrades": "ترقيات اختيارية",
  "Need a custom tandem configuration?": "هل تحتاج إلى تكوين ترادفي مخصص؟",
  "Frequently Asked Questions": "الأسئلة المتداولة",
  "Common questions about tandem press brake systems": "أسئلة شائعة حول أنظمة مكابح الضغط الترادفية",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations can be designed for various length requirements based on your specific applications.": "يمكن للتكوينات الترادفية التعامل مع قطع العمل الطويلة جدًا بما يتجاوز سعة الآلة الفردية القياسية. ",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced sensors continuously monitor and adjust for perfect coordination between both machines.": "تحافظ أنظمتنا الترادفية على دقة تزامن استثنائية طوال عملية الثني. ",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively giving you two separate press brakes when tandem operation is not needed.": "نعم، يمكن تحويل كل آلة إلى وضع التشغيل المستقل لقطع العمل ذات الطول القياسي، مما يوفر لك بشكل فعال مكابح ضغط منفصلة عندما لا تكون هناك حاجة إلى التشغيل الترادفي.",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both controllers.": "يتضمن النظام معالجة شاملة للأخطاء. ",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and synchronization testing. We provide comprehensive on-site commissioning and operator training.": "يتطلب التثبيت عادةً من 2 إلى 3 أسابيع، بما في ذلك تحديد موضع الجهاز وإعداد الشبكة والمعايرة واختبار المزامنة. ",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization system. Extended warranty packages and dedicated support programs are available.": "نحن نقدم ضمانًا شاملاً لمدة عامين يغطي جميع المكونات الرئيسية بما في ذلك نظام المزامنة. ",
  "Have specific technical questions?": "هل لديك أسئلة فنية محددة؟",
  "Download Technical Documentation": "تحميل الوثائق الفنية",
  "Get comprehensive technical information about our tandem press brake systems, including synchronization technology, specifications, and application examples in PDF format.": "احصل على معلومات فنية شاملة حول أنظمة مكابح الضغط الترادفية الخاصة بنا، بما في ذلك تقنية المزامنة والمواصفات وأمثلة التطبيق بتنسيق PDF."
}