{
  "Tandem Press Brake System": "Tandem-Abkantpressensystem",
  "Advanced dual press brake system for extra-long workpiece bending. Two synchronized CNC press brakes working in perfect coordination to handle oversized parts that exceed the capacity of single machines. Ideal for aerospace, shipbuilding, and large-scale fabrication projects.": "Fortschrittliches Doppel-Abkantbremssystem für besonders langes Biegen von Werkstücken. ",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "Dual synchronized press brake system for extra-long workpiece bending applications": "Doppeltes synchronisiertes Abkantbremssystem für Biegeanwendungen mit besonders langen Werkstücken",
  "System Capacity": "Systemkapazität",
  "Combined Force: High-capacity dual system": "Combined Force: Hochleistungs-Dualsystem",
  "Working Length: Extra-long workpiece capability": "Arbeitslänge: Extralange Werkstückfähigkeit",
  "Stroke: Adjustable for various applications": "Hub: Einstellbar für verschiedene Anwendungen",
  "Configuration: 2 x CNC Press Brakes": "Konfiguration: 2 x CNC-Abkantpressen",
  "Control System": "Kontrollsystem",
  "Master-Slave CNC coordination": "Master-Slave-CNC-Koordination",
  "High-precision synchronized positioning": "Hochpräzise synchronisierte Positionierung",
  "Networked back gauge systems": "Vernetzte Hinteranschlagsysteme",
  "Real-time synchronization monitoring": "Synchronisationsüberwachung in Echtzeit",
  "Features": "Merkmale",
  "Dual CNC controllers in sync": "Zwei CNC-Steuerungen synchron",
  "Advanced communication protocol": "Erweitertes Kommunikationsprotokoll",
  "Programmable angle compensation": "Programmierbare Winkelkompensation",
  "Integrated safety systems": "Integrierte Sicherheitssysteme",
  "Why Choose Tandem Press Brake System?": "Warum sollten Sie sich für ein Tandem-Abkantsystem entscheiden?",
  "Discover the unique advantages of our tandem press brake system for handling oversized workpieces": "Entdecken Sie die einzigartigen Vorteile unseres Tandem-Abkantsystems für die Handhabung übergroßer Werkstücke",
  "Extreme Length Capacity": "Extreme Längenkapazität",
  "Handle extra-long workpieces with synchronized dual-machine operation for applications beyond standard capacity": "Behandeln Sie besonders lange Werkstücke mit synchronisiertem Zweimaschinenbetrieb für Anwendungen, die über die Standardkapazität hinausgehen",
  "Perfect Synchronization": "Perfekte Synchronisation",
  "Advanced CNC coordination ensures both machines work in perfect harmony": "Eine fortschrittliche CNC-Koordination stellt sicher, dass beide Maschinen perfekt harmonieren",
  "High Precision": "Hohe Präzision",
  "Maintains exceptional accuracy across the entire bending length for consistent quality": "Behält außergewöhnliche Genauigkeit über die gesamte Biegelänge für gleichbleibende Qualität bei",
  "Flexible Configuration": "Flexible Konfiguration",
  "Can operate independently or synchronized based on workpiece requirements": "Kann je nach Werkstückanforderungen unabhängig oder synchronisiert arbeiten",
  "Combined Power": "Kombinierte Kraft",
  "Double the bending force for heavy-duty applications and thick materials": "Verdoppeln Sie die Biegekraft für schwere Anwendungen und dicke Materialien",
  "Enhanced Safety": "Erhöhte Sicherheit",
  "Integrated safety systems with emergency stop coordination for operator protection": "Integrierte Sicherheitssysteme mit Not-Aus-Koordination zum Schutz des Bedieners",
  "System Components": "Systemkomponenten",
  "Understanding the advanced technology behind our tandem press brake synchronization system": "Verständnis der fortschrittlichen Technologie hinter unserem Synchronisationssystem für Tandem-Abkantpressen",
  "Dual Machine Configuration": "Konfiguration mit zwei Maschinen",
  "Two high-precision CNC press brakes positioned in-line and connected through advanced communication systems. Each machine maintains its own structural integrity while working in perfect coordination with its partner, enabling the bending of workpieces up to 6 meters or longer.": "Zwei hochpräzise CNC-Abkantpressen, die in Reihe angeordnet und über fortschrittliche Kommunikationssysteme verbunden sind. ",
  "Master-Slave Control System": "Master-Slave-Steuerungssystem",
  "Advanced CNC coordination where one machine acts as the master controller, coordinating all movements with the slave machine. Real-time communication ensures microsecond-level synchronization, preventing any misalignment during the bending process. Both controllers can display the same program and status.": "Erweiterte CNC-Koordination, bei der eine Maschine als Master-Steuerung fungiert und alle Bewegungen mit der Slave-Maschine koordiniert. ",
  "Synchronized Back Gauge System": "Synchronisiertes Hinteranschlagsystem",
  "Multi-axis back gauge systems on both machines communicate and coordinate their positioning. Networked control ensures that both back gauges move to identical positions simultaneously, maintaining perfect workpiece alignment across the entire length. Features automatic error detection and correction.": "Mehrachsige Hinteranschlagsysteme an beiden Maschinen kommunizieren und koordinieren ihre Positionierung. ",
  "High-Speed Communication Network": "Hochgeschwindigkeits-Kommunikationsnetzwerk",
  "Dedicated high-speed network connection between the two machines enables real-time data exchange. Continuously monitors position, speed, force, and angle, making instant adjustments to maintain synchronization. Includes redundant communication paths for fail-safe operation.": "Eine spezielle Hochgeschwindigkeits-Netzwerkverbindung zwischen den beiden Maschinen ermöglicht den Datenaustausch in Echtzeit. ",
  "Coordinated Hydraulic System": "Koordiniertes Hydrauliksystem",
  "Each machine has its own independent hydraulic system, but both are coordinated through the master control. Pressure and speed are synchronized to ensure uniform bending force distribution across the entire workpiece length. Advanced servo valves provide precise control and instant response.": "Jede Maschine verfügt über ein eigenes unabhängiges Hydrauliksystem, beide werden jedoch über die übergeordnete Steuerung koordiniert. ",
  "CNC Crowning System": "CNC-Bröselsystem",
  "Advanced CNC crowning compensation system automatically adjusts for beam deflection across the extended working length. The system calculates optimal crowning values based on material thickness, length, and bending force, ensuring consistent bend angles from end to end. With four cylinders working in coordination, the crowning system maintains perfect straightness even when processing extra-long workpieces, eliminating the common problem of center deflection.": "Das fortschrittliche CNC-Balligkeitskompensationssystem passt sich automatisch an die Strahlablenkung über die erweiterte Arbeitslänge an. ",
  "See Tandem System in Action": "Sehen Sie sich das Tandemsystem in Aktion an",
  "Watch how our synchronized tandem press brake system handles extra-long workpieces": "Sehen Sie, wie unser synchronisiertes Tandem-Abkantpressensystem extra lange Werkstücke bearbeitet",
  "Applications": "Anwendungen",
  "Tandem press brake systems excel in industries requiring extra-long workpiece bending": "Tandem-Abkantsysteme eignen sich hervorragend für Branchen, in denen besonders lange Werkstücke gebogen werden müssen",
  "Aerospace Industry": "Luft- und Raumfahrtindustrie",
  "Wing components, fuselage panels, and large structural parts requiring precise bending": "Flügelkomponenten, Rumpfplatten und große Strukturteile, die präzises Biegen erfordern",
  "Shipbuilding": "Schiffbau",
  "Hull plates, deck sections, and marine structural components": "Rumpfplatten, Decksabschnitte und Schiffsbauteile",
  "Bridge Construction": "Brückenbau",
  "Long steel beams, girders, and structural bridge elements": "Lange Stahlträger, Träger und strukturelle Brückenelemente",
  "Wind Energy": "Windenergie",
  "Wind tower sections and large-scale renewable energy components": "Windturmabschnitte und großflächige Komponenten für erneuerbare Energien",
  "Rail Transport": "Schienenverkehr",
  "Train car bodies, chassis frames, and railway infrastructure": "Trainieren Sie Wagenkästen, Fahrgestellrahmen und Eisenbahninfrastruktur",
  "Heavy Equipment": "Schwere Ausrüstung",
  "Large machinery frames, excavator arms, and industrial equipment": "Große Maschinenrahmen, Baggerarme und Industrieausrüstung",
  "Architectural Metalwork": "Architektonische Metallarbeiten",
  "Large facade panels, canopies, and architectural steel elements": "Große Fassadenplatten, Vordächer und architektonische Stahlelemente",
  "Industrial Tanks": "Industrietanks",
  "Large storage tanks, pressure vessels, and container manufacturing": "Herstellung großer Lagertanks, Druckbehälter und Behälter",
  "System Configuration": "Systemkonfiguration",
  "Comprehensive standard features and customization options for your tandem press brake system": "Umfangreiche Standardfunktionen und Anpassungsmöglichkeiten für Ihre Tandem-Abkantpresse",
  "Standard Configuration": "Standardkonfiguration",
  "Optional Upgrades": "Optionale Upgrades",
  "Need a custom tandem configuration?": "Benötigen Sie eine individuelle Tandemkonfiguration?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about tandem press brake systems": "Häufige Fragen zu Tandem-Abkantsystemen",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations can be designed for various length requirements based on your specific applications.": "Tandemkonfigurationen können extralange Werkstücke verarbeiten, die weit über die Standardkapazität einer einzelnen Maschine hinausgehen. ",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced sensors continuously monitor and adjust for perfect coordination between both machines.": "Unsere Tandemsysteme gewährleisten während des gesamten Biegeprozesses eine außergewöhnliche Synchronisierungsgenauigkeit. ",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively giving you two separate press brakes when tandem operation is not needed.": "Ja, jede Maschine kann für Werkstücke mit Standardlänge auf einen unabhängigen Betriebsmodus umgeschaltet werden, sodass Sie praktisch zwei separate Abkantpressen erhalten, wenn kein Tandembetrieb erforderlich ist.",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both controllers.": "Das System beinhaltet eine umfassende Fehlerbehandlung. ",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and synchronization testing. We provide comprehensive on-site commissioning and operator training.": "Die Installation dauert in der Regel zwei bis drei Wochen, einschließlich Maschinenpositionierung, Netzwerkeinrichtung, Kalibrierung und Synchronisierungstests. ",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization system. Extended warranty packages and dedicated support programs are available.": "Wir gewähren eine umfassende 2-Jahres-Garantie auf alle wichtigen Komponenten einschließlich des Synchronisationssystems. ",
  "Have specific technical questions?": "Haben Sie spezielle technische Fragen?",
  "Download Technical Documentation": "Laden Sie die technische Dokumentation herunter",
  "Get comprehensive technical information about our tandem press brake systems, including synchronization technology, specifications, and application examples in PDF format.": "Erhalten Sie umfassende technische Informationen zu unseren Tandem-Abkantpressen, einschließlich Synchronisationstechnologie, Spezifikationen und Anwendungsbeispielen im PDF-Format."
}