{
  "Tandem Press Brake System": "Système de presse plieuse tandem",
  "Advanced dual press brake system for extra-long workpiece bending. Two synchronized CNC press brakes working in perfect coordination to handle oversized parts that exceed the capacity of single machines. Ideal for aerospace, shipbuilding, and large-scale fabrication projects.": "Système de presse plieuse double avancé pour le pliage de pièces extra longues. ",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "Dual synchronized press brake system for extra-long workpiece bending applications": "Système de presse plieuse double synchronisé pour les applications de pliage de pièces extra longues",
  "System Capacity": "Capacité du système",
  "Combined Force: High-capacity dual system": "Force combinée : système double haute capacité",
  "Working Length: Extra-long workpiece capability": "Longueur de travail : capacité de pièce extra-longue",
  "Stroke: Adjustable for various applications": "Course : réglable pour diverses applications",
  "Configuration: 2 x CNC Press Brakes": "Configuration : 2 x presses plieuses CNC",
  "Control System": "Système de contrôle",
  "Master-Slave CNC coordination": "Coordination CNC maître-esclave",
  "High-precision synchronized positioning": "Positionnement synchronisé de haute précision",
  "Networked back gauge systems": "Systèmes de butée arrière en réseau",
  "Real-time synchronization monitoring": "Surveillance de la synchronisation en temps réel",
  "Features": "Caractéristiques",
  "Dual CNC controllers in sync": "Deux contrôleurs CNC synchronisés",
  "Advanced communication protocol": "Protocole de communication avancé",
  "Programmable angle compensation": "Compensation d'angle programmable",
  "Integrated safety systems": "Systèmes de sécurité intégrés",
  "Why Choose Tandem Press Brake System?": "Pourquoi choisir le système de presse plieuse tandem ?",
  "Discover the unique advantages of our tandem press brake system for handling oversized workpieces": "Découvrez les avantages uniques de notre système de presse plieuse tandem pour la manipulation de pièces surdimensionnées",
  "Extreme Length Capacity": "Capacité de longueur extrême",
  "Handle extra-long workpieces with synchronized dual-machine operation for applications beyond standard capacity": "Manipulez des pièces très longues avec un fonctionnement synchronisé sur deux machines pour les applications au-delà de la capacité standard",
  "Perfect Synchronization": "Synchronisation parfaite",
  "Advanced CNC coordination ensures both machines work in perfect harmony": "La coordination CNC avancée garantit que les deux machines fonctionnent en parfaite harmonie",
  "High Precision": "Haute précision",
  "Maintains exceptional accuracy across the entire bending length for consistent quality": "Maintient une précision exceptionnelle sur toute la longueur de pliage pour une qualité constante",
  "Flexible Configuration": "Configuration flexible",
  "Can operate independently or synchronized based on workpiece requirements": "Peut fonctionner indépendamment ou synchronisé en fonction des exigences de la pièce à usiner",
  "Combined Power": "Puissance combinée",
  "Double the bending force for heavy-duty applications and thick materials": "Doublez la force de flexion pour les applications intensives et les matériaux épais",
  "Enhanced Safety": "Sécurité améliorée",
  "Integrated safety systems with emergency stop coordination for operator protection": "Systèmes de sécurité intégrés avec coordination d'arrêt d'urgence pour la protection des opérateurs",
  "System Components": "Composants du système",
  "Understanding the advanced technology behind our tandem press brake synchronization system": "Comprendre la technologie avancée derrière notre système de synchronisation des presses plieuses tandem",
  "Dual Machine Configuration": "Configuration à deux machines",
  "Two high-precision CNC press brakes positioned in-line and connected through advanced communication systems. Each machine maintains its own structural integrity while working in perfect coordination with its partner, enabling the bending of workpieces up to 6 meters or longer.": "Deux presses plieuses CNC de haute précision positionnées en ligne et connectées via des systèmes de communication avancés. ",
  "Master-Slave Control System": "Système de contrôle maître-esclave",
  "Advanced CNC coordination where one machine acts as the master controller, coordinating all movements with the slave machine. Real-time communication ensures microsecond-level synchronization, preventing any misalignment during the bending process. Both controllers can display the same program and status.": "Coordination CNC avancée où une machine agit comme contrôleur maître, coordonnant tous les mouvements avec la machine esclave. ",
  "Synchronized Back Gauge System": "Système de jauge arrière synchronisé",
  "Multi-axis back gauge systems on both machines communicate and coordinate their positioning. Networked control ensures that both back gauges move to identical positions simultaneously, maintaining perfect workpiece alignment across the entire length. Features automatic error detection and correction.": "Les systèmes de butée arrière multi-axes sur les deux machines communiquent et coordonnent leur positionnement. ",
  "High-Speed Communication Network": "Réseau de communication à haut débit",
  "Dedicated high-speed network connection between the two machines enables real-time data exchange. Continuously monitors position, speed, force, and angle, making instant adjustments to maintain synchronization. Includes redundant communication paths for fail-safe operation.": "Une connexion réseau haut débit dédiée entre les deux machines permet un échange de données en temps réel. ",
  "Coordinated Hydraulic System": "Système hydraulique coordonné",
  "Each machine has its own independent hydraulic system, but both are coordinated through the master control. Pressure and speed are synchronized to ensure uniform bending force distribution across the entire workpiece length. Advanced servo valves provide precise control and instant response.": "Chaque machine possède son propre système hydraulique indépendant, mais les deux sont coordonnés via la commande principale. ",
  "CNC Crowning System": "Système de couronnement CNC",
  "Advanced CNC crowning compensation system automatically adjusts for beam deflection across the extended working length. The system calculates optimal crowning values based on material thickness, length, and bending force, ensuring consistent bend angles from end to end. With four cylinders working in coordination, the crowning system maintains perfect straightness even when processing extra-long workpieces, eliminating the common problem of center deflection.": "Le système avancé de compensation de couronnement CNC s'ajuste automatiquement à la déviation du faisceau sur toute la longueur de travail étendue. ",
  "See Tandem System in Action": "Voir le système tandem en action",
  "Watch how our synchronized tandem press brake system handles extra-long workpieces": "Regardez comment notre système de presse plieuse tandem synchronisé gère des pièces très longues",
  "Applications": "Applications",
  "Tandem press brake systems excel in industries requiring extra-long workpiece bending": "Les systèmes de presse plieuse tandem excellent dans les industries nécessitant un cintrage de pièces extra longues",
  "Aerospace Industry": "Industrie aérospatiale",
  "Wing components, fuselage panels, and large structural parts requiring precise bending": "Composants d'aile, panneaux de fuselage et grandes pièces structurelles nécessitant un pliage précis",
  "Shipbuilding": "Construction navale",
  "Hull plates, deck sections, and marine structural components": "Plaques de coque, sections de pont et composants structurels marins",
  "Bridge Construction": "Construction de ponts",
  "Long steel beams, girders, and structural bridge elements": "Longues poutres en acier, poutres et éléments structurels de pont",
  "Wind Energy": "Énergie éolienne",
  "Wind tower sections and large-scale renewable energy components": "Sections de tours éoliennes et composants d'énergie renouvelable à grande échelle",
  "Rail Transport": "Transport ferroviaire",
  "Train car bodies, chassis frames, and railway infrastructure": "Carrosseries de wagons, châssis et infrastructures ferroviaires",
  "Heavy Equipment": "Matériel lourd",
  "Large machinery frames, excavator arms, and industrial equipment": "Grands châssis de machines, bras d'excavatrice et équipements industriels",
  "Architectural Metalwork": "Ferronnerie architecturale",
  "Large facade panels, canopies, and architectural steel elements": "Grands panneaux de façade, auvents et éléments architecturaux en acier",
  "Industrial Tanks": "Réservoirs industriels",
  "Large storage tanks, pressure vessels, and container manufacturing": "Fabrication de grands réservoirs de stockage, d'appareils sous pression et de conteneurs",
  "System Configuration": "Configuration du système",
  "Comprehensive standard features and customization options for your tandem press brake system": "Caractéristiques standard complètes et options de personnalisation pour votre système de presse plieuse tandem",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need a custom tandem configuration?": "Besoin d'une configuration tandem personnalisée ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about tandem press brake systems": "Questions courantes sur les systèmes de presse plieuse tandem",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations can be designed for various length requirements based on your specific applications.": "Les configurations tandem peuvent traiter des pièces très longues bien au-delà de la capacité standard d'une seule machine. ",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced sensors continuously monitor and adjust for perfect coordination between both machines.": "Nos systèmes tandem maintiennent une précision de synchronisation exceptionnelle tout au long du processus de pliage. ",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively giving you two separate press brakes when tandem operation is not needed.": "Oui, chaque machine peut être commutée en mode de fonctionnement indépendant pour les pièces de longueur standard, vous offrant ainsi deux presses plieuses séparées lorsque le fonctionnement en tandem n'est pas nécessaire.",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both controllers.": "Le système comprend une gestion complète des erreurs. ",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and synchronization testing. We provide comprehensive on-site commissioning and operator training.": "L'installation nécessite généralement 2 à 3 semaines, y compris le positionnement de la machine, la configuration du réseau, l'étalonnage et les tests de synchronisation. ",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization system. Extended warranty packages and dedicated support programs are available.": "Nous offrons une garantie complète de 2 ans couvrant tous les composants principaux, y compris le système de synchronisation. ",
  "Have specific technical questions?": "Vous avez des questions techniques spécifiques ?",
  "Download Technical Documentation": "Télécharger la documentation technique",
  "Get comprehensive technical information about our tandem press brake systems, including synchronization technology, specifications, and application examples in PDF format.": "Obtenez des informations techniques complètes sur nos systèmes de presses plieuses tandem, y compris la technologie de synchronisation, les spécifications et des exemples d'application au format PDF."
}