{
  "Tandem Press Brake System": "Sistema de plegadora en tándem",
  "Advanced dual press brake system for extra-long workpiece bending. Two synchronized CNC press brakes working in perfect coordination to handle oversized parts that exceed the capacity of single machines. Ideal for aerospace, shipbuilding, and large-scale fabrication projects.": "Sistema avanzado de plegadora doble para doblar piezas de trabajo extralargas. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "Dual synchronized press brake system for extra-long workpiece bending applications": "Sistema de plegadora sincronizada dual para aplicaciones de doblado de piezas de trabajo extralargas",
  "System Capacity": "Capacidad del sistema",
  "Combined Force: High-capacity dual system": "Fuerza Combinada: Sistema dual de alta capacidad",
  "Working Length: Extra-long workpiece capability": "Longitud de trabajo: Capacidad de pieza de trabajo extralarga",
  "Stroke: Adjustable for various applications": "Carrera: Ajustable para diversas aplicaciones",
  "Configuration: 2 x CNC Press Brakes": "Configuración: 2 prensas plegadoras CNC",
  "Control System": "Sistema de control",
  "Master-Slave CNC coordination": "Coordinación CNC maestro-esclavo",
  "High-precision synchronized positioning": "Posicionamiento sincronizado de alta precisión",
  "Networked back gauge systems": "Sistemas de tope trasero conectados en red",
  "Real-time synchronization monitoring": "Monitoreo de sincronización en tiempo real",
  "Features": "Características",
  "Dual CNC controllers in sync": "Controladores CNC duales sincronizados",
  "Advanced communication protocol": "Protocolo de comunicación avanzado",
  "Programmable angle compensation": "Compensación de ángulo programable",
  "Integrated safety systems": "Sistemas de seguridad integrados",
  "Why Choose Tandem Press Brake System?": "¿Por qué elegir el sistema de plegadora en tándem?",
  "Discover the unique advantages of our tandem press brake system for handling oversized workpieces": "Descubra las ventajas únicas de nuestro sistema de plegadora en tándem para manipular piezas de trabajo de gran tamaño",
  "Extreme Length Capacity": "Capacidad de longitud extrema",
  "Handle extra-long workpieces with synchronized dual-machine operation for applications beyond standard capacity": "Maneje piezas de trabajo extralargas con operación sincronizada de doble máquina para aplicaciones que superan la capacidad estándar",
  "Perfect Synchronization": "Sincronización perfecta",
  "Advanced CNC coordination ensures both machines work in perfect harmony": "La coordinación CNC avanzada garantiza que ambas máquinas funcionen en perfecta armonía.",
  "High Precision": "Alta precisión",
  "Maintains exceptional accuracy across the entire bending length for consistent quality": "Mantiene una precisión excepcional en toda la longitud de plegado para una calidad constante",
  "Flexible Configuration": "Configuración flexible",
  "Can operate independently or synchronized based on workpiece requirements": "Puede funcionar de forma independiente o sincronizada según los requisitos de la pieza de trabajo.",
  "Combined Power": "Potencia combinada",
  "Double the bending force for heavy-duty applications and thick materials": "Duplica la fuerza de flexión para aplicaciones de servicio pesado y materiales gruesos.",
  "Enhanced Safety": "Seguridad mejorada",
  "Integrated safety systems with emergency stop coordination for operator protection": "Sistemas de seguridad integrados con coordinación de parada de emergencia para protección del operador",
  "System Components": "Componentes del sistema",
  "Understanding the advanced technology behind our tandem press brake synchronization system": "Comprender la tecnología avanzada detrás de nuestro sistema de sincronización de plegadoras en tándem",
  "Dual Machine Configuration": "Configuración de máquina dual",
  "Two high-precision CNC press brakes positioned in-line and connected through advanced communication systems. Each machine maintains its own structural integrity while working in perfect coordination with its partner, enabling the bending of workpieces up to 6 meters or longer.": "Dos plegadoras CNC de alta precisión colocadas en línea y conectadas a través de sistemas de comunicación avanzados. ",
  "Master-Slave Control System": "Sistema de control maestro-esclavo",
  "Advanced CNC coordination where one machine acts as the master controller, coordinating all movements with the slave machine. Real-time communication ensures microsecond-level synchronization, preventing any misalignment during the bending process. Both controllers can display the same program and status.": "Coordinación CNC avanzada donde una máquina actúa como controlador maestro, coordinando todos los movimientos con la máquina esclava. ",
  "Synchronized Back Gauge System": "Sistema de tope trasero sincronizado",
  "Multi-axis back gauge systems on both machines communicate and coordinate their positioning. Networked control ensures that both back gauges move to identical positions simultaneously, maintaining perfect workpiece alignment across the entire length. Features automatic error detection and correction.": "Los sistemas de tope trasero de ejes múltiples en ambas máquinas comunican y coordinan su posicionamiento. ",
  "High-Speed Communication Network": "Red de comunicación de alta velocidad",
  "Dedicated high-speed network connection between the two machines enables real-time data exchange. Continuously monitors position, speed, force, and angle, making instant adjustments to maintain synchronization. Includes redundant communication paths for fail-safe operation.": "La conexión de red dedicada de alta velocidad entre las dos máquinas permite el intercambio de datos en tiempo real. ",
  "Coordinated Hydraulic System": "Sistema hidráulico coordinado",
  "Each machine has its own independent hydraulic system, but both are coordinated through the master control. Pressure and speed are synchronized to ensure uniform bending force distribution across the entire workpiece length. Advanced servo valves provide precise control and instant response.": "Cada máquina tiene su propio sistema hidráulico independiente, pero ambos se coordinan a través del control maestro. ",
  "CNC Crowning System": "Sistema de coronación CNC",
  "Advanced CNC crowning compensation system automatically adjusts for beam deflection across the extended working length. The system calculates optimal crowning values based on material thickness, length, and bending force, ensuring consistent bend angles from end to end. With four cylinders working in coordination, the crowning system maintains perfect straightness even when processing extra-long workpieces, eliminating the common problem of center deflection.": "El avanzado sistema de compensación de coronación CNC se ajusta automáticamente a la deflexión del haz en toda la longitud de trabajo extendida. ",
  "See Tandem System in Action": "Vea el sistema tándem en acción",
  "Watch how our synchronized tandem press brake system handles extra-long workpieces": "Vea cómo nuestro sistema de plegadora en tándem sincronizado maneja piezas de trabajo extralargas",
  "Applications": "Aplicaciones",
  "Tandem press brake systems excel in industries requiring extra-long workpiece bending": "Los sistemas de plegadoras en tándem destacan en industrias que requieren doblar piezas de trabajo extralargas",
  "Aerospace Industry": "Industria aeroespacial",
  "Wing components, fuselage panels, and large structural parts requiring precise bending": "Componentes de alas, paneles de fuselaje y piezas estructurales grandes que requieren una flexión precisa",
  "Shipbuilding": "Construcción naval",
  "Hull plates, deck sections, and marine structural components": "Placas de casco, secciones de cubierta y componentes estructurales marinos",
  "Bridge Construction": "Construcción de puentes",
  "Long steel beams, girders, and structural bridge elements": "Vigas largas de acero, vigas y elementos estructurales de puentes.",
  "Wind Energy": "Energía Eólica",
  "Wind tower sections and large-scale renewable energy components": "Secciones de torres eólicas y componentes de energía renovable a gran escala",
  "Rail Transport": "Transporte ferroviario",
  "Train car bodies, chassis frames, and railway infrastructure": "Carrocerías de vagones, bastidores de chasis e infraestructura ferroviaria",
  "Heavy Equipment": "Equipo Pesado",
  "Large machinery frames, excavator arms, and industrial equipment": "Grandes bastidores de maquinaria, brazos de excavadora y equipos industriales.",
  "Architectural Metalwork": "Metalistería arquitectónica",
  "Large facade panels, canopies, and architectural steel elements": "Grandes paneles de fachada, marquesinas y elementos arquitectónicos de acero.",
  "Industrial Tanks": "Tanques industriales",
  "Large storage tanks, pressure vessels, and container manufacturing": "Grandes tanques de almacenamiento, recipientes a presión y fabricación de contenedores.",
  "System Configuration": "Configuración del sistema",
  "Comprehensive standard features and customization options for your tandem press brake system": "Funciones estándar integrales y opciones de personalización para su sistema de plegadora en tándem",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need a custom tandem configuration?": "¿Necesita una configuración tándem personalizada?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about tandem press brake systems": "Preguntas comunes sobre los sistemas de plegadoras en tándem",
  "Tandem configurations can handle extra-long workpieces well beyond standard single-machine capacity. Custom configurations can be designed for various length requirements based on your specific applications.": "Las configuraciones en tándem pueden manejar piezas de trabajo extralargas mucho más allá de la capacidad estándar de una sola máquina. ",
  "Our tandem systems maintain exceptional synchronization accuracy throughout the bending process. Advanced sensors continuously monitor and adjust for perfect coordination between both machines.": "Nuestros sistemas tándem mantienen una precisión de sincronización excepcional durante todo el proceso de plegado. ",
  "Yes, each machine can be switched to independent operation mode for standard-length workpieces, effectively giving you two separate press brakes when tandem operation is not needed.": "Sí, cada máquina se puede cambiar al modo de operación independiente para piezas de trabajo de longitud estándar, lo que le brinda efectivamente dos plegadoras separadas cuando no se necesita la operación en tándem.",
  "The system includes comprehensive error handling. If either machine detects an issue, both machines automatically stop to prevent damage to the workpiece. Diagnostic information is displayed on both controllers.": "El sistema incluye un manejo integral de errores. ",
  "Installation typically requires 2-3 weeks, including machine positioning, network setup, calibration, and synchronization testing. We provide comprehensive on-site commissioning and operator training.": "La instalación normalmente requiere de 2 a 3 semanas, incluido el posicionamiento de la máquina, la configuración de la red, la calibración y las pruebas de sincronización. ",
  "We provide a comprehensive 2-year warranty covering all major components including the synchronization system. Extended warranty packages and dedicated support programs are available.": "Ofrecemos una garantía integral de 2 años que cubre todos los componentes principales, incluido el sistema de sincronización. ",
  "Have specific technical questions?": "¿Tiene preguntas técnicas específicas?",
  "Download Technical Documentation": "Descargar Documentación Técnica",
  "Get comprehensive technical information about our tandem press brake systems, including synchronization technology, specifications, and application examples in PDF format.": "Obtenga información técnica completa sobre nuestros sistemas de plegadoras en tándem, incluida la tecnología de sincronización, especificaciones y ejemplos de aplicaciones en formato PDF."
}