{
  "Torsion-synchro NC Press Brake": "Prensa plegadora NC sincronizada por torsión",
  "Reliable and economical bending solution with mechanical torsion bar synchronization. Perfect for small to medium production runs, offering excellent value with robust construction, easy operation, and consistent bending performance.": "Solución de plegado confiable y económica con sincronización mecánica de barra de torsión. ",
  "Request Quote": "Solicitar Cotización",
  "Watch Video": "Ver vídeo",
  "Technical Specifications": "Especificaciones técnicas",
  "Economical torsion-synchro NC press brake with reliable mechanical synchronization": "Prensa plegadora NC económica con sincronización de torsión y sincronización mecánica confiable",
  "Machine Capacity": "Capacidad de la máquina",
  "Bending Force: Available in various tonnage ranges": "Fuerza de flexión: Disponible en varios rangos de tonelaje",
  "Table Length: Multiple length options available": "Longitud de la mesa: Múltiples opciones de longitud disponibles",
  "Stroke: Adjustable stroke options": "Carrera: Opciones de carrera ajustables",
  "Throat Depth: Various throat depth configurations": "Profundidad de garganta: varias configuraciones de profundidad de garganta",
  "Control System": "Sistema de control",
  "NC Controller: Digital display": "Controlador NC: pantalla digital",
  "Positioning Accuracy: High precision positioning": "Precisión de posicionamiento: posicionamiento de alta precisión",
  "Back Gauge: Multi-axis NC control": "Tope trasero: control NC multieje",
  "Safety: CE certified": "Seguridad: certificado CE",
  "Features": "Características",
  "Torsion bar synchronization": "Sincronización de la barra de torsión",
  "Robust welded frame": "Marco soldado robusto",
  "Manual crowning adjustment": "Ajuste manual de coronación",
  "Simple operation interface": "Interfaz de operación sencilla",
  "Why Choose Torsion-synchro Press Brake?": "¿Por qué elegir la prensa plegadora sincronizada por torsión?",
  "Discover the key advantages that make our torsion-synchro NC press brake an excellent choice for cost-conscious manufacturers": "Descubra las ventajas clave que hacen de nuestra prensa plegadora NC sincronizada con torsión una excelente opción para los fabricantes preocupados por los costos",
  "Cost-Effective": "Rentable",
  "Economical solution with lower initial investment and minimal maintenance costs": "Solución económica con menor inversión inicial y mínimos costes de mantenimiento.",
  "Simple Operation": "Operación sencilla",
  "Intuitive NC controller with straightforward operation reduces operator training time": "El controlador NC intuitivo con operación sencilla reduce el tiempo de capacitación del operador",
  "Reliable Synchronization": "Sincronización confiable",
  "Mechanical torsion bar ensures consistent synchronization with minimal maintenance": "La barra de torsión mecánica garantiza una sincronización constante con un mantenimiento mínimo",
  "Compact Design": "Diseño compacto",
  "Space-saving design perfect for workshops with limited floor space": "Diseño que ahorra espacio, perfecto para talleres con espacio limitado",
  "Safety Features": "Características de seguridad",
  "CE certified with comprehensive safety features including emergency stops": "Certificado CE con características de seguridad integrales que incluyen paradas de emergencia",
  "Low Maintenance": "Bajo mantenimiento",
  "Simple mechanical design requires minimal maintenance and fewer spare parts": "El diseño mecánico simple requiere un mantenimiento mínimo y menos piezas de repuesto.",
  "Components": "Componentes",
  "Understanding the key components that make our torsion-synchro press brake reliable and efficient": "Comprender los componentes clave que hacen que nuestra prensa plegadora sincronizada por torsión sea confiable y eficiente",
  "Mechanical Structure": "Estructura mecánica",
  "The main frame is constructed from high-quality welded steel, providing excellent rigidity and stability. The torsion bar synchronization system ensures parallel movement of the ram, delivering consistent bending results across the entire working length.": "El bastidor principal está construido con acero soldado de alta calidad, lo que proporciona una rigidez y estabilidad excelentes. ",
  "Torsion Bar Synchronization": "Sincronización de la barra de torsión",
  "The torsion bar synchronization system is a proven mechanical solution that ensures the left and right sides of the ram move in perfect synchronization. This simple yet effective system requires minimal maintenance and provides reliable long-term performance.": "El sistema de sincronización de barra de torsión es una solución mecánica probada que garantiza que los lados izquierdo y derecho del ariete se muevan en perfecta sincronización. ",
  "NC Control System": "Sistema de control NC",
  "User-friendly NC controller with digital display for easy operation. Features include programmable back gauge positioning, stroke adjustment, and bending counter. The intuitive interface allows operators to quickly set up bending parameters.": "Controlador NC fácil de usar con pantalla digital para una fácil operación. ",
  "NC Back Gauge": "Medidor trasero NC",
  "2-axis NC back gauge system provides accurate positioning for consistent bending results. The motorized back gauge eliminates manual adjustment, improving productivity and reducing setup time. Ball screw drive ensures smooth and precise movement.": "El sistema de tope posterior NC de 2 ejes proporciona un posicionamiento preciso para obtener resultados de doblado consistentes. ",
  "Hydraulic System": "Sistema hidráulico",
  "Reliable hydraulic system with quality components ensures consistent bending force. The system includes a hydraulic pump, control valves, and cylinders designed for efficient operation and long service life. Oil cooling system prevents overheating during continuous operation.": "El sistema hidráulico confiable con componentes de calidad garantiza una fuerza de flexión constante. ",
  "Safety System": "Sistema de seguridad",
  "Essential safety features including emergency stop buttons, safety guards, and two-hand control operation. The machine meets CE safety standards to protect operators during all phases of operation while maintaining productivity and ease of use.": "Funciones de seguridad esenciales que incluyen botones de parada de emergencia, protecciones de seguridad y operación de control con dos manos. ",
  "Watch Our Machine in Action": "Vea nuestra máquina en acción",
  "See the reliability and efficiency of our torsion-synchro NC press brake": "Vea la confiabilidad y eficiencia de nuestra plegadora NC con sincronización de torsión",
  "Applications": "Aplicaciones",
  "Our torsion-synchro press brakes are ideal for various metal forming applications": "Nuestras prensas plegadoras de torsión sincronizada son ideales para diversas aplicaciones de conformado de metales.",
  "General Fabrication": "Fabricación general",
  "Versatile bending for general sheet metal fabrication work": "Doblado versátil para trabajos generales de fabricación de chapa metálica",
  "Small Workshops": "Pequeños talleres",
  "Perfect for job shops and small fabrication facilities": "Perfecto para talleres y pequeñas instalaciones de fabricación.",
  "Educational Institutions": "Instituciones educativas",
  "Ideal for training centers and technical schools": "Ideal para centros de formación y escuelas técnicas.",
  "Light Manufacturing": "Fabricación ligera",
  "Suitable for small to medium production runs": "Adecuado para tiradas de producción pequeñas y medianas",
  "Maintenance Shops": "Talleres de mantenimiento",
  "Perfect for repair and maintenance operations": "Perfecto para operaciones de reparación y mantenimiento.",
  "Prototyping": "Creación de prototipos",
  "Excellent for prototype development and short runs": "Excelente para desarrollo de prototipos y tiradas cortas.",
  "Metal Enclosures": "Cajas Metálicas",
  "Manufacturing of cabinets, boxes, and enclosures": "Fabricación de armarios, cajas y cerramientos.",
  "Brackets & Supports": "Soportes y soportes",
  "Production of metal brackets and support structures": "Producción de soportes metálicos y estructuras de soporte.",
  "Standard & Optional Configuration": "Configuración estándar y opcional",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personalice su máquina con funciones estándar y actualizaciones opcionales para satisfacer sus requisitos específicos",
  "Standard Configuration": "Configuración estándar",
  "Optional Upgrades": "Actualizaciones opcionales",
  "Need help choosing the right configuration?": "¿Necesita ayuda para elegir la configuración correcta?",
  "Frequently Asked Questions": "Preguntas frecuentes",
  "Common questions about our torsion-synchro NC press brakes": "Preguntas comunes sobre nuestras plegadoras NC con sincronización de torsión",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than electro-hydraulic systems, it's more reliable and requires less maintenance.": "Torsion-synchro utiliza una barra de torsión mecánica para sincronizar el movimiento del ariete, lo que lo hace más simple y económico que los sistemas hidráulicos o electrohidráulicos. ",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "La prensa plegadora sincronizada por torsión puede procesar acero dulce, acero inoxidable, aluminio y otras aleaciones metálicas comunes. ",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and occasional inspection of the torsion bar are typically all that's needed. The mechanical design is inherently reliable.": "Se requiere un mantenimiento mínimo. ",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller and straightforward operation make it easy to learn compared to more complex CNC systems.": "Sí, la plegadora de torsión sincronizada es ideal para operadores con capacitación básica. ",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us for specific delivery timelines.": "Los modelos estándar suelen enviarse en un plazo de 20 a 30 días. ",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are available. Technical support is provided for the life of the machine.": "Ofrecemos una garantía estándar de 1 año que cubre todos los componentes principales. ",
  "Still have questions?": "¿Aún tienes preguntas?",
  "Download Technical Brochure": "Descargar Folleto Técnico",
  "Get detailed technical specifications, dimensions, and performance data for our torsion-synchro NC press brakes. Download our comprehensive product brochure in PDF format.": "Obtenga especificaciones técnicas detalladas, dimensiones y datos de rendimiento para nuestras plegadoras NC con sincronización de torsión. "
}