{
  "Torsion-synchro NC Press Brake": "Torsionssynchrone NC-Abkantpresse",
  "Reliable and economical bending solution with mechanical torsion bar synchronization. Perfect for small to medium production runs, offering excellent value with robust construction, easy operation, and consistent bending performance.": "Zuverlässige und wirtschaftliche Biegelösung mit mechanischer Drehstabsynchronisation. ",
  "Request Quote": "Angebot anfordern",
  "Watch Video": "Video ansehen",
  "Technical Specifications": "Technische Spezifikationen",
  "Economical torsion-synchro NC press brake with reliable mechanical synchronization": "Wirtschaftliche torsionssynchrone NC-Abkantpresse mit zuverlässiger mechanischer Synchronisierung",
  "Machine Capacity": "Maschinenkapazität",
  "Bending Force: Available in various tonnage ranges": "Biegekraft: Erhältlich in verschiedenen Tonnagebereichen",
  "Table Length: Multiple length options available": "Tischlänge: Mehrere Längenoptionen verfügbar",
  "Stroke: Adjustable stroke options": "Hub: Einstellbare Huboptionen",
  "Throat Depth: Various throat depth configurations": "Ausladungstiefe: Verschiedene Konfigurationen der Ausladungstiefe",
  "Control System": "Kontrollsystem",
  "NC Controller: Digital display": "NC-Controller: Digitalanzeige",
  "Positioning Accuracy: High precision positioning": "Positionierungsgenauigkeit: Hochpräzise Positionierung",
  "Back Gauge: Multi-axis NC control": "Hinteranschlag: Mehrachsige NC-Steuerung",
  "Safety: CE certified": "Sicherheit: CE-zertifiziert",
  "Features": "Merkmale",
  "Torsion bar synchronization": "Torsionsstabsynchronisation",
  "Robust welded frame": "Robuster geschweißter Rahmen",
  "Manual crowning adjustment": "Manuelle Bombierungseinstellung",
  "Simple operation interface": "Einfache Bedienoberfläche",
  "Why Choose Torsion-synchro Press Brake?": "Warum sollten Sie sich für eine Torsionssynchron-Abkantpresse entscheiden?",
  "Discover the key advantages that make our torsion-synchro NC press brake an excellent choice for cost-conscious manufacturers": "Entdecken Sie die wichtigsten Vorteile, die unsere torsionssynchrone NC-Abkantpresse zu einer ausgezeichneten Wahl für kostenbewusste Hersteller machen",
  "Cost-Effective": "Kostengünstig",
  "Economical solution with lower initial investment and minimal maintenance costs": "Wirtschaftliche Lösung mit geringerer Anfangsinvestition und minimalen Wartungskosten",
  "Simple Operation": "Einfache Bedienung",
  "Intuitive NC controller with straightforward operation reduces operator training time": "Die intuitive NC-Steuerung mit einfacher Bedienung reduziert die Einarbeitungszeit des Bedieners",
  "Reliable Synchronization": "Zuverlässige Synchronisierung",
  "Mechanical torsion bar ensures consistent synchronization with minimal maintenance": "Der mechanische Torsionsstab gewährleistet eine gleichmäßige Synchronisierung bei minimalem Wartungsaufwand",
  "Compact Design": "Kompaktes Design",
  "Space-saving design perfect for workshops with limited floor space": "Platzsparendes Design, perfekt für Werkstätten mit begrenzter Stellfläche",
  "Safety Features": "Sicherheitsfunktionen",
  "CE certified with comprehensive safety features including emergency stops": "CE-zertifiziert mit umfassenden Sicherheitsfunktionen einschließlich Not-Aus",
  "Low Maintenance": "Geringer Wartungsaufwand",
  "Simple mechanical design requires minimal maintenance and fewer spare parts": "Das einfache mechanische Design erfordert minimale Wartung und weniger Ersatzteile",
  "Components": "Komponenten",
  "Understanding the key components that make our torsion-synchro press brake reliable and efficient": "Verständnis der Schlüsselkomponenten, die unsere Torsions-Synchro-Abkantpresse zuverlässig und effizient machen",
  "Mechanical Structure": "Mechanische Struktur",
  "The main frame is constructed from high-quality welded steel, providing excellent rigidity and stability. The torsion bar synchronization system ensures parallel movement of the ram, delivering consistent bending results across the entire working length.": "Der Hauptrahmen besteht aus hochwertigem geschweißtem Stahl und bietet hervorragende Steifigkeit und Stabilität. ",
  "Torsion Bar Synchronization": "Torsionsstab-Synchronisation",
  "The torsion bar synchronization system is a proven mechanical solution that ensures the left and right sides of the ram move in perfect synchronization. This simple yet effective system requires minimal maintenance and provides reliable long-term performance.": "Das Torsionsstab-Synchronisationssystem ist eine bewährte mechanische Lösung, die dafür sorgt, dass sich die linke und rechte Seite des Stößels perfekt synchron bewegen. ",
  "NC Control System": "NC-Steuerungssystem",
  "User-friendly NC controller with digital display for easy operation. Features include programmable back gauge positioning, stroke adjustment, and bending counter. The intuitive interface allows operators to quickly set up bending parameters.": "Benutzerfreundliche NC-Steuerung mit Digitalanzeige für einfache Bedienung. ",
  "NC Back Gauge": "NC-Hinteranschlag",
  "2-axis NC back gauge system provides accurate positioning for consistent bending results. The motorized back gauge eliminates manual adjustment, improving productivity and reducing setup time. Ball screw drive ensures smooth and precise movement.": "Das 2-Achsen-NC-Hinteranschlagsystem sorgt für eine genaue Positionierung für konsistente Biegeergebnisse. ",
  "Hydraulic System": "Hydrauliksystem",
  "Reliable hydraulic system with quality components ensures consistent bending force. The system includes a hydraulic pump, control valves, and cylinders designed for efficient operation and long service life. Oil cooling system prevents overheating during continuous operation.": "Ein zuverlässiges Hydrauliksystem mit hochwertigen Komponenten gewährleistet eine konstante Biegekraft. ",
  "Safety System": "Sicherheitssystem",
  "Essential safety features including emergency stop buttons, safety guards, and two-hand control operation. The machine meets CE safety standards to protect operators during all phases of operation while maintaining productivity and ease of use.": "Wesentliche Sicherheitsfunktionen, einschließlich Not-Aus-Tasten, Schutzvorrichtungen und Zweihandbedienung. ",
  "Watch Our Machine in Action": "Sehen Sie unsere Maschine in Aktion",
  "See the reliability and efficiency of our torsion-synchro NC press brake": "Erleben Sie die Zuverlässigkeit und Effizienz unserer torsionssynchronen NC-Abkantpresse",
  "Applications": "Anwendungen",
  "Our torsion-synchro press brakes are ideal for various metal forming applications": "Unsere torsionssynchronen Abkantpressen eignen sich ideal für verschiedene Metallumformungsanwendungen",
  "General Fabrication": "Allgemeine Fertigung",
  "Versatile bending for general sheet metal fabrication work": "Vielseitiges Biegewerkzeug für allgemeine Blechbearbeitungsarbeiten",
  "Small Workshops": "Kleine Werkstätten",
  "Perfect for job shops and small fabrication facilities": "Perfekt für Lohnfertiger und kleine Fertigungsbetriebe",
  "Educational Institutions": "Bildungseinrichtungen",
  "Ideal for training centers and technical schools": "Ideal für Ausbildungszentren und technische Schulen",
  "Light Manufacturing": "Leichte Fertigung",
  "Suitable for small to medium production runs": "Geeignet für kleine bis mittlere Produktionsserien",
  "Maintenance Shops": "Wartungswerkstätten",
  "Perfect for repair and maintenance operations": "Perfekt für Reparatur- und Wartungsarbeiten",
  "Prototyping": "Prototyping",
  "Excellent for prototype development and short runs": "Hervorragend geeignet für die Entwicklung von Prototypen und Kleinserien",
  "Metal Enclosures": "Metallgehäuse",
  "Manufacturing of cabinets, boxes, and enclosures": "Herstellung von Schränken, Kästen und Gehäusen",
  "Brackets & Supports": "Halterungen und Stützen",
  "Production of metal brackets and support structures": "Herstellung von Metallhalterungen und Stützkonstruktionen",
  "Standard & Optional Configuration": "Standard- und optionale Konfiguration",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Passen Sie Ihre Maschine mit Standardfunktionen und optionalen Upgrades an Ihre spezifischen Anforderungen an",
  "Standard Configuration": "Standardkonfiguration",
  "Optional Upgrades": "Optionale Upgrades",
  "Need help choosing the right configuration?": "Benötigen Sie Hilfe bei der Auswahl der richtigen Konfiguration?",
  "Frequently Asked Questions": "Häufig gestellte Fragen",
  "Common questions about our torsion-synchro NC press brakes": "Häufige Fragen zu unseren torsionssynchronen NC-Abkantpressen",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than electro-hydraulic systems, it's more reliable and requires less maintenance.": "Torsion-Synchro verwendet einen mechanischen Torsionsstab, um die Stößelbewegung zu synchronisieren, was es einfacher und wirtschaftlicher macht als hydraulische oder elektrohydraulische Systeme. ",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "Die torsionssynchrone Abkantpresse kann Baustahl, Edelstahl, Aluminium und andere gängige Metalllegierungen verarbeiten. ",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and occasional inspection of the torsion bar are typically all that's needed. The mechanical design is inherently reliable.": "Es ist nur ein minimaler Wartungsaufwand erforderlich. ",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller and straightforward operation make it easy to learn compared to more complex CNC systems.": "Ja, die Torsions-Synchro-Abkantpresse ist ideal für Bediener mit Grundausbildung. ",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us for specific delivery timelines.": "Standardmodelle werden in der Regel innerhalb von 20–30 Tagen versendet. ",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are available. Technical support is provided for the life of the machine.": "Wir gewähren standardmäßig eine einjährige Garantie auf alle wichtigen Komponenten. ",
  "Still have questions?": "Sie haben noch Fragen?",
  "Download Technical Brochure": "Laden Sie die technische Broschüre herunter",
  "Get detailed technical specifications, dimensions, and performance data for our torsion-synchro NC press brakes. Download our comprehensive product brochure in PDF format.": "Erhalten Sie detaillierte technische Spezifikationen, Abmessungen und Leistungsdaten für unsere torsionssynchronen NC-Abkantpressen. "
}