{
  "Torsion-synchro NC Press Brake": "Presse plieuse NC à torsion synchronisée",
  "Reliable and economical bending solution with mechanical torsion bar synchronization. Perfect for small to medium production runs, offering excellent value with robust construction, easy operation, and consistent bending performance.": "Solution de pliage fiable et économique avec synchronisation mécanique des barres de torsion. ",
  "Request Quote": "Demander un devis",
  "Watch Video": "Regarder la vidéo",
  "Technical Specifications": "Spécifications techniques",
  "Economical torsion-synchro NC press brake with reliable mechanical synchronization": "Presse-plieuse NC économique à synchronisation de torsion avec synchronisation mécanique fiable",
  "Machine Capacity": "Capacité des machines",
  "Bending Force: Available in various tonnage ranges": "Force de flexion : disponible dans différentes gammes de tonnages",
  "Table Length: Multiple length options available": "Longueur de la table : plusieurs options de longueur disponibles",
  "Stroke: Adjustable stroke options": "Course : options de course réglables",
  "Throat Depth: Various throat depth configurations": "Profondeur de gorge : diverses configurations de profondeur de gorge",
  "Control System": "Système de contrôle",
  "NC Controller: Digital display": "Contrôleur NC : affichage numérique",
  "Positioning Accuracy: High precision positioning": "Précision de positionnement : positionnement de haute précision",
  "Back Gauge: Multi-axis NC control": "Jauge arrière : contrôle NC multi-axes",
  "Safety: CE certified": "Sécurité : certifié CE",
  "Features": "Caractéristiques",
  "Torsion bar synchronization": "Synchronisation des barres de torsion",
  "Robust welded frame": "Cadre soudé robuste",
  "Manual crowning adjustment": "Réglage manuel du couronnement",
  "Simple operation interface": "Interface d'opération simple",
  "Why Choose Torsion-synchro Press Brake?": "Pourquoi choisir la presse plieuse à torsion synchronisée ?",
  "Discover the key advantages that make our torsion-synchro NC press brake an excellent choice for cost-conscious manufacturers": "Découvrez les principaux avantages qui font de notre presse plieuse NC à synchronisation de torsion un excellent choix pour les fabricants soucieux des coûts",
  "Cost-Effective": "Rentable",
  "Economical solution with lower initial investment and minimal maintenance costs": "Solution économique avec un investissement initial réduit et des coûts de maintenance minimes",
  "Simple Operation": "Opération simple",
  "Intuitive NC controller with straightforward operation reduces operator training time": "Le contrôleur NC intuitif avec un fonctionnement simple réduit le temps de formation des opérateurs",
  "Reliable Synchronization": "Synchronisation fiable",
  "Mechanical torsion bar ensures consistent synchronization with minimal maintenance": "La barre de torsion mécanique assure une synchronisation constante avec un minimum d'entretien",
  "Compact Design": "Conception compacte",
  "Space-saving design perfect for workshops with limited floor space": "Conception peu encombrante, parfaite pour les ateliers avec un espace au sol limité",
  "Safety Features": "Caractéristiques de sécurité",
  "CE certified with comprehensive safety features including emergency stops": "Certifié CE avec des fonctionnalités de sécurité complètes, y compris des arrêts d'urgence",
  "Low Maintenance": "Faible entretien",
  "Simple mechanical design requires minimal maintenance and fewer spare parts": "La conception mécanique simple nécessite un minimum d'entretien et moins de pièces de rechange",
  "Components": "Composants",
  "Understanding the key components that make our torsion-synchro press brake reliable and efficient": "Comprendre les composants clés qui rendent notre presse plieuse à torsion synchronisée fiable et efficace",
  "Mechanical Structure": "Structure mécanique",
  "The main frame is constructed from high-quality welded steel, providing excellent rigidity and stability. The torsion bar synchronization system ensures parallel movement of the ram, delivering consistent bending results across the entire working length.": "Le cadre principal est construit en acier soudé de haute qualité, offrant une excellente rigidité et stabilité. ",
  "Torsion Bar Synchronization": "Synchronisation des barres de torsion",
  "The torsion bar synchronization system is a proven mechanical solution that ensures the left and right sides of the ram move in perfect synchronization. This simple yet effective system requires minimal maintenance and provides reliable long-term performance.": "Le système de synchronisation des barres de torsion est une solution mécanique éprouvée qui garantit que les côtés gauche et droit du vérin se déplacent en parfaite synchronisation. ",
  "NC Control System": "Système de contrôle NC",
  "User-friendly NC controller with digital display for easy operation. Features include programmable back gauge positioning, stroke adjustment, and bending counter. The intuitive interface allows operators to quickly set up bending parameters.": "Contrôleur NC convivial avec affichage numérique pour une utilisation facile. ",
  "NC Back Gauge": "Jauge arrière NC",
  "2-axis NC back gauge system provides accurate positioning for consistent bending results. The motorized back gauge eliminates manual adjustment, improving productivity and reducing setup time. Ball screw drive ensures smooth and precise movement.": "Le système de butée arrière NC à 2 axes offre un positionnement précis pour des résultats de pliage cohérents. ",
  "Hydraulic System": "Système hydraulique",
  "Reliable hydraulic system with quality components ensures consistent bending force. The system includes a hydraulic pump, control valves, and cylinders designed for efficient operation and long service life. Oil cooling system prevents overheating during continuous operation.": "Un système hydraulique fiable avec des composants de qualité garantit une force de flexion constante. ",
  "Safety System": "Système de sécurité",
  "Essential safety features including emergency stop buttons, safety guards, and two-hand control operation. The machine meets CE safety standards to protect operators during all phases of operation while maintaining productivity and ease of use.": "Fonctions de sécurité essentielles, notamment des boutons d'arrêt d'urgence, des protections de sécurité et une commande bimanuelle. ",
  "Watch Our Machine in Action": "Regardez notre machine en action",
  "See the reliability and efficiency of our torsion-synchro NC press brake": "Découvrez la fiabilité et l’efficacité de notre presse plieuse NC à synchronisation de torsion",
  "Applications": "Applications",
  "Our torsion-synchro press brakes are ideal for various metal forming applications": "Nos presses plieuses à torsion synchronisée sont idéales pour diverses applications de formage des métaux",
  "General Fabrication": "Fabrication générale",
  "Versatile bending for general sheet metal fabrication work": "Pliage polyvalent pour les travaux généraux de fabrication de tôlerie",
  "Small Workshops": "Petits ateliers",
  "Perfect for job shops and small fabrication facilities": "Parfait pour les ateliers et les petites installations de fabrication",
  "Educational Institutions": "Établissements d'enseignement",
  "Ideal for training centers and technical schools": "Idéal pour les centres de formation et les écoles techniques",
  "Light Manufacturing": "Fabrication légère",
  "Suitable for small to medium production runs": "Convient aux petites et moyennes séries de production",
  "Maintenance Shops": "Ateliers d'entretien",
  "Perfect for repair and maintenance operations": "Parfait pour les opérations de réparation et de maintenance",
  "Prototyping": "Prototypage",
  "Excellent for prototype development and short runs": "Excellent pour le développement de prototypes et les petites séries",
  "Metal Enclosures": "Boîtiers métalliques",
  "Manufacturing of cabinets, boxes, and enclosures": "Fabrication d'armoires, de coffrets et de coffrets",
  "Brackets & Supports": "Supports et supports",
  "Production of metal brackets and support structures": "Production de supports métalliques et de structures de support",
  "Standard & Optional Configuration": "Configuration standard et facultative",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "Personnalisez votre machine avec des fonctionnalités standard et des mises à niveau facultatives pour répondre à vos besoins spécifiques",
  "Standard Configuration": "Configuration standard",
  "Optional Upgrades": "Mises à niveau facultatives",
  "Need help choosing the right configuration?": "Besoin d'aide pour choisir la bonne configuration ?",
  "Frequently Asked Questions": "Foire aux questions",
  "Common questions about our torsion-synchro NC press brakes": "Questions courantes sur nos presses plieuses NC à synchronisation de torsion",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than electro-hydraulic systems, it's more reliable and requires less maintenance.": "Torsion-synchro utilise une barre de torsion mécanique pour synchroniser le mouvement du vérin, ce qui le rend plus simple et plus économique que les systèmes hydrauliques ou électro-hydrauliques. ",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "La presse plieuse à torsion synchronisée peut traiter l'acier doux, l'acier inoxydable, l'aluminium et d'autres alliages métalliques courants. ",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and occasional inspection of the torsion bar are typically all that's needed. The mechanical design is inherently reliable.": "Un entretien très minimal est requis. ",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller and straightforward operation make it easy to learn compared to more complex CNC systems.": "Oui, la presse plieuse à torsion synchronisée est idéale pour les opérateurs ayant une formation de base. ",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us for specific delivery timelines.": "Les modèles standard sont généralement expédiés sous 20 à 30 jours. ",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are available. Technical support is provided for the life of the machine.": "Nous offrons une garantie standard d'un an couvrant tous les principaux composants. ",
  "Still have questions?": "Vous avez encore des questions ?",
  "Download Technical Brochure": "Télécharger la brochure technique",
  "Get detailed technical specifications, dimensions, and performance data for our torsion-synchro NC press brakes. Download our comprehensive product brochure in PDF format.": "Obtenez des spécifications techniques détaillées, des dimensions et des données de performances pour nos presses plieuses NC à torsion synchronisée. "
}