{
  "Torsion-synchro NC Press Brake": "トーションシンクロNCプレスブレーキ",
  "Reliable and economical bending solution with mechanical torsion bar synchronization. Perfect for small to medium production runs, offering excellent value with robust construction, easy operation, and consistent bending performance.": "機械式トーションバー同期による、信頼性が高く経済的な曲げソリューション。",
  "Request Quote": "見積依頼",
  "Watch Video": "ビデオを見る",
  "Technical Specifications": "技術仕様",
  "Economical torsion-synchro NC press brake with reliable mechanical synchronization": "確実な機械同期を備えた経済的なトーションシンクロNCプレスブレーキ",
  "Machine Capacity": "機械能力",
  "Bending Force: Available in various tonnage ranges": "曲げ力: さまざまなトン数範囲で利用可能",
  "Table Length: Multiple length options available": "テーブルの長さ: 複数の長さのオプションが利用可能",
  "Stroke: Adjustable stroke options": "ストローク: 調整可能なストロークオプション",
  "Throat Depth: Various throat depth configurations": "スロートの深さ: さまざまなスロートの深さの構成",
  "Control System": "制御システム",
  "NC Controller: Digital display": "NCコントローラ：デジタル表示",
  "Positioning Accuracy: High precision positioning": "位置決め精度：高精度位置決め",
  "Back Gauge: Multi-axis NC control": "バックゲージ：多軸NC制御",
  "Safety: CE certified": "安全性: CE 認証済み",
  "Features": "特徴",
  "Torsion bar synchronization": "トーションバーの同期",
  "Robust welded frame": "堅牢な溶接フレーム",
  "Manual crowning adjustment": "手動クラウニング調整",
  "Simple operation interface": "シンプルな操作インターフェース",
  "Why Choose Torsion-synchro Press Brake?": "トーションシンクロプレスブレーキを選ぶ理由",
  "Discover the key advantages that make our torsion-synchro NC press brake an excellent choice for cost-conscious manufacturers": "当社のトーションシンクロ NC プレス ブレーキがコスト重視のメーカーにとって優れた選択肢となる主な利点をご覧ください。",
  "Cost-Effective": "費用対効果が高い",
  "Economical solution with lower initial investment and minimal maintenance costs": "初期投資とメンテナンスコストを最小限に抑えた経済的なソリューション",
  "Simple Operation": "簡単な操作",
  "Intuitive NC controller with straightforward operation reduces operator training time": "直感的なNCコントローラーで簡単な操作が可能で、オペレーターのトレーニング時間を短縮します。",
  "Reliable Synchronization": "信頼性の高い同期",
  "Mechanical torsion bar ensures consistent synchronization with minimal maintenance": "機械式トーションバーにより、最小限のメンテナンスで一貫した同期が保証されます。",
  "Compact Design": "コンパクトなデザイン",
  "Space-saving design perfect for workshops with limited floor space": "床面積が限られた作業場に最適な省スペース設計",
  "Safety Features": "安全機能",
  "CE certified with comprehensive safety features including emergency stops": "緊急停止を含む包括的な安全機能を備えた CE 認定済み",
  "Low Maintenance": "メンテナンスの手間がかからない",
  "Simple mechanical design requires minimal maintenance and fewer spare parts": "シンプルな機械設計で必要なメンテナンスは最小限で、スペアパーツも少なくて済みます。",
  "Components": "コンポーネント",
  "Understanding the key components that make our torsion-synchro press brake reliable and efficient": "当社のトーションシンクロプレスブレーキの信頼性と効率性を高める重要なコンポーネントを理解する",
  "Mechanical Structure": "機械構造",
  "The main frame is constructed from high-quality welded steel, providing excellent rigidity and stability. The torsion bar synchronization system ensures parallel movement of the ram, delivering consistent bending results across the entire working length.": "メインフレームは高品質の溶接鋼材で作られており、剛性と安定性に優れています。",
  "Torsion Bar Synchronization": "トーションバーの同期",
  "The torsion bar synchronization system is a proven mechanical solution that ensures the left and right sides of the ram move in perfect synchronization. This simple yet effective system requires minimal maintenance and provides reliable long-term performance.": "トーションバー同期システムは、ラムの左側と右側が完全に同期して動くことを保証する実績のある機械的ソリューションです。",
  "NC Control System": "NC制御システム",
  "User-friendly NC controller with digital display for easy operation. Features include programmable back gauge positioning, stroke adjustment, and bending counter. The intuitive interface allows operators to quickly set up bending parameters.": "デジタル表示で操作が簡単な、ユーザーフレンドリーなNCコントローラ。",
  "NC Back Gauge": "NCバックゲージ",
  "2-axis NC back gauge system provides accurate positioning for consistent bending results. The motorized back gauge eliminates manual adjustment, improving productivity and reducing setup time. Ball screw drive ensures smooth and precise movement.": "2 軸 NC バック ゲージ システムにより、正確な位置決めが可能になり、一貫した曲げ結果が得られます。",
  "Hydraulic System": "油圧システム",
  "Reliable hydraulic system with quality components ensures consistent bending force. The system includes a hydraulic pump, control valves, and cylinders designed for efficient operation and long service life. Oil cooling system prevents overheating during continuous operation.": "高品質のコンポーネントを備えた信頼性の高い油圧システムにより、一貫した曲げ力が保証されます。",
  "Safety System": "安全システム",
  "Essential safety features including emergency stop buttons, safety guards, and two-hand control operation. The machine meets CE safety standards to protect operators during all phases of operation while maintaining productivity and ease of use.": "緊急停止ボタン、安全ガード、両手制御操作などの基本的な安全機能。",
  "Watch Our Machine in Action": "機械の動作をご覧ください",
  "See the reliability and efficiency of our torsion-synchro NC press brake": "当社のトーションシンクロNCプレスブレーキの信頼性と効率をご覧ください。",
  "Applications": "アプリケーション",
  "Our torsion-synchro press brakes are ideal for various metal forming applications": "当社のトーションシンクロプレスブレーキは、さまざまな金属成形用途に最適です",
  "General Fabrication": "一般的な製造",
  "Versatile bending for general sheet metal fabrication work": "一般的な板金加工に適した多用途曲げ加工が可能",
  "Small Workshops": "小さなワークショップ",
  "Perfect for job shops and small fabrication facilities": "作業工場や小規模製造施設に最適",
  "Educational Institutions": "教育機関",
  "Ideal for training centers and technical schools": "トレーニングセンターや専門学校に最適",
  "Light Manufacturing": "軽工業",
  "Suitable for small to medium production runs": "小規模から中規模の生産に適しています",
  "Maintenance Shops": "整備工場",
  "Perfect for repair and maintenance operations": "修理やメンテナンス作業に最適",
  "Prototyping": "プロトタイピング",
  "Excellent for prototype development and short runs": "プロトタイプ開発や短期生産に最適",
  "Metal Enclosures": "金属製エンクロージャ",
  "Manufacturing of cabinets, boxes, and enclosures": "キャビネット、ボックス、エンクロージャーの製造",
  "Brackets & Supports": "ブラケットとサポート",
  "Production of metal brackets and support structures": "金属ブラケットおよび支持構造の製造",
  "Standard & Optional Configuration": "標準およびオプションの構成",
  "Customize your machine with standard features and optional upgrades to meet your specific requirements": "標準機能とオプションのアップグレードを使用してマシンをカスタマイズし、特定の要件を満たすことができます",
  "Standard Configuration": "標準構成",
  "Optional Upgrades": "オプションのアップグレード",
  "Need help choosing the right configuration?": "適切な構成を選択するのにサポートが必要ですか?",
  "Frequently Asked Questions": "よくある質問",
  "Common questions about our torsion-synchro NC press brakes": "トーションシンクロNCプレスブレーキに関するよくあるご質問",
  "Torsion-synchro uses a mechanical torsion bar to synchronize the ram movement, making it simpler and more economical than hydraulic or electro-hydraulic systems. While it offers slightly less precision than electro-hydraulic systems, it's more reliable and requires less maintenance.": "トーションシンクロは、機械式トーションバーを使用してラムの動きを同期させるため、油圧システムや電気油圧システムよりもシンプルで経済的です。",
  "The torsion-synchro press brake can process mild steel, stainless steel, aluminum, and other common metal alloys. The maximum thickness depends on the material type, tonnage, and bending length.": "トーションシンクロプレスブレーキは、軟鋼、ステンレス鋼、アルミニウム、その他の一般的な合金を加工できます。",
  "Very minimal maintenance is required. Regular hydraulic oil changes, lubrication of moving parts, and occasional inspection of the torsion bar are typically all that's needed. The mechanical design is inherently reliable.": "最小限のメンテナンスが必要です。",
  "Yes, the torsion-synchro press brake is ideal for operators with basic training. The simple NC controller and straightforward operation make it easy to learn compared to more complex CNC systems.": "はい、トーションシンクロプレスブレーキは基礎訓練を受けたオペレーターに最適です。",
  "Standard models typically ship within 20-30 days. Custom configurations may require 45-60 days. Contact us for specific delivery timelines.": "標準モデルは通常 20 ～ 30 日以内に発送されます。",
  "We provide a standard 1-year warranty covering all major components. Extended warranty options are available. Technical support is provided for the life of the machine.": "すべての主要コンポーネントをカバーする標準 1 年間保証を提供します。",
  "Still have questions?": "まだ質問がありますか?",
  "Download Technical Brochure": "技術パンフレットをダウンロード",
  "Get detailed technical specifications, dimensions, and performance data for our torsion-synchro NC press brakes. Download our comprehensive product brochure in PDF format.": "当社のトーションシンクロ NC プレス ブレーキの詳細な技術仕様、寸法、性能データをご覧ください。"
}